[
  {
    "Id": "5450-cbf1-3e74-254a",
    "Name": "Armoured Hide (1)",
    "Type": "Global",
    "Description": "Description: The hide of some creatures forms natural armour and improves their armour value ( and that of their rider). By how much armour value is improved varies from model to model, as shown in brackets after the name of this special rule.\nNote that a model that wears no armour is considerer to have an armour value of 7+ for the purposes of rules that improve armour value.\n"
  },
  {
    "Id": "b592-330-5a29-162f",
    "Name": "Choppas",
    "Type": "Global",
    "Description": "Description: During a turn in which it charged, a model with this special rule may re-roll any rolls To Wound of a natural 1, and improves the Armour Piercing characteristic of its weapon(s) by 1.\nNote that this special rule only applies to non-magical weapons and does not apply to a model’s mount (should it have one). If the model is using a magic weapon, this special rule ceases to apply.\n"
  },
  {
    "Id": "5186-798d-69d-6545",
    "Name": "Counter Charge",
    "Type": "Global",
    "Description": "Description: This special rule can only be used by units that consist entirely of models with this special rule. When a unit with this special rule is charged in its front arc by an enemy unit whose troop type is ‘cavalry,’ ‘chariot’ or ‘monster’, it may declare a ‘Counter Charge’ charge reaction:\nCounter Charge: The unit surges forward to meet the enemy charge. Measure the distance between the two units. If the distance is less than the Movement characteristic of the charging unit, the charged unit has not enough time to meet the enemy charge and must either Hold or Flee instead.\nOtherwise, pivot the unit about its centre so that it is facing directly towards the centre of the charging enemy unit. After pivoting, the unit moves D3+1\" directly towards the enemy unit. Both units are considered to have charged during this turn.\nFleeing units and units already engaged in combat when charged cannot Counter Charge. A unit can only Counter Charge in response to one charge per turn, even if charged by multiple units. Once all charges have been declared, the inactive player can choose which charging unit to Counter Charge. The unit will then Hold against the other charging units.\n"
  },
  {
    "Id": "7a44-b74f-ad39-c2c8",
    "Name": "Da Boyz",
    "Type": "Global",
    "Description": "Description: Your army must include one Black Orc Boss for every Black Orc Mob it includes, and vice versa. In other words:\n\n• For each Black Orc Mob your army includes, it must also include one Black Orc War Boss or Big Boss.\n\n• For each Black Orc War Boss or Big Boss your army includes, it must also include one Black Orc Mob.\n"
  },
  {
    "Id": "eaca-69a2-8b6a-81c6",
    "Name": "Furious Charge",
    "Type": "Global",
    "Description": "Description: During a turn in which it made a charge move of 3\" or more, a model with this special rule gains a +1 modifier to its Attacks characteristic.\n"
  },
  {
    "Id": "a097-2e5c-8366-efc1",
    "Name": "Ignore Panic",
    "Type": "Global",
    "Description": "Description: This unit does not have to make a Panic test when a friendly unit that does not also have this special rule is destroyed or Breaks and flees from combat whilst within 6\" of it. Nor does this unit have to make a Panic test when it is fled through by a friendly unit that does not have this special rule..\n"
  },
  {
    "Id": "2fb3-330c-b6cb-fc2d",
    "Name": "Quell Impetuosity",
    "Type": "Global",
    "Description": "Description: Whilst within 6\" of a unit with this special rule, friendly units may choose to ignore the Impetuous special rule.\n"
  },
  {
    "Id": "23c4-bd19-2422-ad08",
    "Name": "Rallying Cry",
    "Type": "Global",
    "Description": "Description: During the Command sub-phase of their turn, if they are not engaged in combat, this character may nominate a single fleeing friendly unit that is within their Command range. The nominated unit immediately makes a Rally test. If this test is failed, the unit may attempt to rally again as normal during the Rally sub-phase.\n"
  },
  {
    "Id": "dc91-48b3-3696-217",
    "Name": "Swiftstride",
    "Type": "Global",
    "Description": "Description: A unit which consists entirely of models with this special rule increases its maximum possible charge range by 3\" and, when it makes a Charge, Flee or Pursuit roll, may apply a +D6 modifier to the result.\n"
  },
  {
    "Id": "c392-507a-daf5-126",
    "Name": "Tusker Charge",
    "Type": "Global",
    "Description": "Description: During a turn in which it charged, a War Boar’s Tusks (hand weapon) have a Strength characteristic of S+1 and an Armour Piercing characteristic of -1.\nNote that this special rule only applies to attacks made by a War Boar, not to their rider, a chariot or its crew.\n"
  },
  {
    "Id": "7711-627f-5ae5-cc7c",
    "Name": "Waaagh!",
    "Type": "Global",
    "Description": "Description: Once per game, during the Command sub-phase of their turn, this character may attempt to invoke the power of the Waaagh! by making a Leadership test (using their own Leadership). If this test is passed, until your next Start of Turn sub-phase this character, their mount and any Orc unit they have joined may re-roll any rolls To Hit of a natural 1 and, when calculating its combat result, may claim an additional bonus of +1 combat result point.\nNote that, for the purposes of this rule, an Orc unit is considered to be any unit that is made up entirely of Orcs or Black Orcs, mounted or otherwise. Should an Orc unit be joined by a Goblin character, it is no longer considered to be an Orc unit. This special rule is not cumulative.\n"
  },
  {
    "Id": "6d4a-7733-d725-a267",
    "Name": "Hand Weapon",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -\nSpecial Rules: -\nNotes: Unless specified otherwise, all models are assumed to be equipped with a hand weapon.\n"
  },
  {
    "Id": "883e-e1b1-4fe9-5912",
    "Name": "Close Order",
    "Type": "Global",
    "Description": "Description: A unit consisting of models with this special rule may adopt a Close Order formation.\n"
  },
  {
    "Id": "785a-2886-af42-dce9",
    "Name": "First Charge",
    "Type": "Global",
    "Description": "Description: If this unit’s first charge of the game is successful (i.e., if the unit makes contact with the charge target), the charge target becomes Disrupted until the end of the Combat phase of that turn.\n"
  },
  {
    "Id": "78e4-fffe-6662-41fe",
    "Name": "Ignore Goblin Panic",
    "Type": "Global",
    "Description": "Description: This unit does not have to make a Panic test when a friendly Goblin unit is destroyed or Breaks and flees from combat whilst within 6\" of it. Nor does this unit have to make a Panic test when it is fled through by a friendly Goblin unit.\nNote that, for the purposes of this rule, a Goblin unit is considered to be any unit that is made up entirely of Goblins of any kind, mounted or otherwise. This includes any war machine or chariot that is crewed entirely by Goblins. Should a Goblin unit be joined by an Orc character, it is no longer considered to be a Goblin unit.\n"
  },
  {
    "Id": "5c2-e9dd-2715-a0c0",
    "Name": "Impact Hits (D3+1)",
    "Type": "Global",
    "Description": "Description: The number of Impact Hits caused varies from model to model, and will be shown in brackets after the name of this special rile. Often, this is determined by the roll of a dice.\nResolving Impact Hits: Impact Hits can only be made by a charging model that moved 3\" or more and that is in base contact with the enemy. Impact hits are attacks made in combat that always strike at Initiative 10 (regardless of modifiers), and that hit automatically using the unmodified Strength characteristic of the model.\n"
  },
  {
    "Id": "b664-8530-a988-7ba9",
    "Name": "Impetuous",
    "Type": "Global",
    "Description": "Description: If during the Declare Charges & Charge Reactions sub-phase of its turn, a unit that includes one or more Impetuous models is able to declare a charge, roll a D6. On a roll of 1-3, the unit must declare a charge. On a roll of 4+, the unit may act as normal.\n"
  },
  {
    "Id": "505f-e12d-2e36-31d0",
    "Name": "Warband",
    "Type": "Global",
    "Description": "Description: Unless it is fleeing, a Warband gains a positive (+) modifier to its Leadership characteristic equal to its current Rank Bonus, up to a maximum of Leadership 10. However, a Warband cannot use this modifier to its Leadership should it ever choose to make a Restraint test. In addition, if the majority of the models in a unit have this special rule, it may re-roll its Charge roll.\nNote that unless a character also has this special rule, their Leadership cannot be modified by this special rule. A Warband can use either its own modified Leadership, the modified Leadership of a Warband character, or the unmodified Leadership of a non-Warband character, whichever is the higher.\n"
  },
  {
    "Id": "e099-1ebb-9e85-34c8",
    "Name": "Armour Value : 3+",
    "Type": "Equipment",
    "Description": "Description: Base Armour value\n"
  },
  {
    "Id": "ee75-c1a8-2f0c-c264",
    "Name": "Cavalry Spear",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+1\nAP: -1\nSpecial Rules: Fight in Extra Rank\nNotes: Models whose troop type is ‘cavalry’, ‘monster’ or ‘chariot’ only. A cavalry spear’s Strength and Armour Piercing modifiers apply only during a turn in which the wielder charged. A model wielding a cavalry spear cannot make a supporting attack during a turn in which it charged.\n"
  },
  {
    "Id": "44c2-f355-d5ed-24d7",
    "Name": "Additional Hand Weapon",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -\nSpecial Rules: Extra Atacks (+1), Require Two Hands\nNotes: -\n"
  },
  {
    "Id": "9a1d-38b0-7d7-7552",
    "Name": "Full Plate Armour",
    "Type": "Equipment",
    "Description": "Description: Armour Value 4+\n"
  },
  {
    "Id": "c557-6102-9a35-bbcd",
    "Name": "Fly (9)",
    "Type": "Global",
    "Description": "Description: Whenever a model with this special rule moves, it can choose either to move across the ground as normal, using its given Movement characteristic, or to move by flying through the air. When a model flies it uses a special ‘Fly Movement’ characteristic, shown in brackets after the name of this special rule (shown here as ‘X’). Models that choose to move by flying:\n- May move as normal (i.e. they may charge, march and manoeuvre as if moving on the ground), except that they are able to pass freely above other models, units and terrain features without any penalty, and they can march whilst within 8\" of an enemy unit without first having to make a Leadership test.\n- May end their movement in terrain, but will suffer its effects if they do. They cannot end their movement 'on top' of impassable terrain or another unit, or within 1\" of an enemy unit.\nModels that can Fly must begin and end all their movement on the ground. A character with this special rule cannot join a unit without this special rule, and vice versa.\n"
  },
  {
    "Id": "c822-7ad0-f24a-e4af",
    "Name": "Large Target",
    "Type": "Global",
    "Description": "Description: Enemy models never suffer To Hit modifiers for full or partial cover when shooting at models with this special rule. In addition, a model can draw a line of sight to a model with this special rule over or through other models, and vice versa.\n"
  },
  {
    "Id": "72db-24bb-7493-d753",
    "Name": "Stomp Attacks (D3)",
    "Type": "Global",
    "Description": "Description: The number of Stomp Attacks caused varies from model to model and will be shown in brackets after the name of this special rule. Often, this is determined by the roll of a dice.\nResolving Stomp Attacks: Stomp Attacks can only be made by a model that is in base contact with the enemy. Stomp Attacks are attacks made in combat that always strike at Initiative 1 (regardless of modifiers) and that hit automatically using the unmodified Strength characteristic of the model.\n"
  },
  {
    "Id": "c7a2-35bf-4313-f4f0",
    "Name": "Terror",
    "Type": "Global",
    "Description": "Description: Models with this special rule cause Terror. Models that cause Terror also cause Fear:\n\n• When a unit that causes Terror declares a charge, the charge target must immediately make a Leadership test. If this test is failed, it must Flee. If this test is passed, it can declare its charge reaction normally.\n\n• If the winning side of a combat includes one or more units that cause Terror, each unit that belongs to the losing side must apply a -1 modifier to its Leadership characteristic when making its Break test.\nNote that if a charged unit cannot choose to Flee, it does not make this Leadership test.\nModels with the Fear special rule Fear models that cause Terror. Models that cause Terror are immune to Terror. A unit that does not cause Terror does not become immune to Terror when joined by a character that does.\n"
  },
  {
    "Id": "c56e-8d1b-bb4-de99",
    "Name": "Heavy Armour",
    "Type": "Equipment",
    "Description": "Description: Armour Value 5+\n"
  },
  {
    "Id": "c761-4dde-b2c8-b6fe",
    "Name": "Venomous Tail",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -\nSpecial Rules: Poisoned Attacks, Strike First\nNotes: In combat, this model must make one of its attacks each turn with this weapon\n"
  },
  {
    "Id": "8382-4e23-e72c-d90",
    "Name": "Wicked Claws",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -2\nSpecial Rules: -\nNotes: -\n"
  },
  {
    "Id": "2af0-975f-bb14-8b8f",
    "Name": "Armour Bane (2)",
    "Type": "Global",
    "Description": "Description: If a model with this special rule rolls a natural 6 when making a roll To Wound, the Armour Piercing characteristic of its weapon is improved by the amount shown in brackets after the name of this special rule.\nFor example, if a natural 6 is rolled when rolling To Wound with a weapon that has an AP of \"-\" and the Armour Bane (1) special rule its AP counts as being -1 when making an Armour Save roll against that wound.\n"
  },
  {
    "Id": "cbdf-d42c-ab0f-d3c6",
    "Name": "Blackshard Armour",
    "Type": "Global",
    "Description": "Description: A model with this special rule has a 5+ Ward save against any wounds suffered that were caused by an attack that has the Flaming Attacks special rule. In addition, a Wizard with this special rule may wear armour without penalty.\n"
  },
  {
    "Id": "e50-cfab-b320-3b1d",
    "Name": "Ensorcelled Weapons",
    "Type": "Global",
    "Description": "Description: A hand weapon carried by a model with this special rule has the Magical Attacks special rule and an Armour Piercing characteristic of -1.\nNote that this special rule only applies to a single, non-magical hand weapon and does not apply to a model’s mount (should it have one). If the model is using two hand weapons or any other sort of weapon, this special rule ceases to apply.\n"
  },
  {
    "Id": "5ec9-a98-d8c5-e18b",
    "Name": "Fear",
    "Type": "Global",
    "Description": "Description: Models with this special rule cause Fear:\n\n• If a unit wishes to declare a charge against an enemy unit that both causes Fear and has a higher Unit Strength, it must first make a Leadership test. If this test is failed, the unit cannot charge. It does not move and is considered to have made a failed charge. If this test is passed, the unit can charge as normal.\n\n• If a unit is engaged with an enemy unit that both causes Fear and has a higher Unit Strength when its combat is chosen during any Choose & Fight Combat sub-phase, it must make a Leadership test. If this test is failed, any models in the unit that direct their attacks against the Fear-causing enemy suffer a -1 modifier to their rolls To Hit.\nA unit only needs to make one Fear test per turn. Models that cause Fear are immune to Fear. A unit that does not cause Fear does not become immune to Fear when joined by a character that does.\n"
  },
  {
    "Id": "2ecd-c6b3-bd8b-864b",
    "Name": "Loner",
    "Type": "Global",
    "Description": "Description: A character with this special rule cannot be your General and cannot join a unit without this special rule. A unit with this special rule cannot be joined by a character without this special rule.\n"
  },
  {
    "Id": "10a-38e5-1cb4-80a3",
    "Name": "Stampede",
    "Type": "Global",
    "Description": "Description: Impact Hits caused by a model with this special rule have an Armour Piercing characteristic of -2.\n"
  },
  {
    "Id": "e351-bbd6-f470-b604",
    "Name": "Stubborn",
    "Type": "Global",
    "Description": "Description: The first time this unit is required to make a Break test it may choose not to and will automatically Fall Back in Good Order instead, even if the Unit Strength of the winning side is more than twice that of the losing side. A unit that is not Stubborn does not become Stubborn when joined by a character that is. A Stubborn character cannot use this special rule whilst part of a unit that is not Stubborn.\n"
  },
  {
    "Id": "ca2c-2a54-1cb5-d96",
    "Name": "Infernal Engineer",
    "Type": "Global",
    "Description": "Description: Unless this model is fleeing or engaged in combat, once per turn a friendly war machine that is within its Command range may re-roll one Scatter dice or one Artillery dice.\n"
  },
  {
    "Id": "a81b-35e3-4e85-ca1e",
    "Name": "Lore of Hashut",
    "Type": "Global",
    "Description": "Description: A Wizard with the ‘Lore of Hashut’ special rule may discard one of their randomly generated spells as normal. When they do so, they may select instead either the signature spell of their chosen Lore of Magic, or one of the spells listed below:\n• Curse Of Hashut \n• Storm Of Ash \n• Flames Of Hashut\n"
  },
  {
    "Id": "90ed-c9be-a611-79cc",
    "Name": "Magic Resistance (-3)",
    "Type": "Global",
    "Description": "Description: The Casting roll of any enemy spell (including Bound Spells) that targets a unit that includes one or more models with this special rule suffers a modifier, as shown in brackets after the name of this special rule (-X).\nNote that this special rule is not cumulative. If two or more models in a unit have this special rule, use the highest modifier.\n"
  },
  {
    "Id": "144b-f554-392a-fd79",
    "Name": "Resolute",
    "Type": "Global",
    "Description": "Description: Models with this special rule suffer a -1 modifier to the result of any Flee roll or Pursuit roll they make (to a minimum of 1).\nNote that this modifier does not apply to mounted characters.\n"
  },
  {
    "Id": "9b0a-3405-96ad-f20e",
    "Name": "Sorcerer’s Curse",
    "Type": "Global",
    "Description": "Description: If this model miscasts a spell, it must immediately make a Toughness test. If this test is failed, it loses a single Wound and gains a +1 modifier to its Toughness characteristic instead of rolling on the Miscast table. If this test is passed, it rolls on the Miscast table as normal.\n"
  },
  {
    "Id": "23c6-7ce-8a24-76ef",
    "Name": "Sorcerous Miasma",
    "Type": "Global",
    "Description": "Description: During the Combat phase, any enemy model that uses a magic weapon to attack a character mounted on a Lammasu counts as being armed with a simple hand weapon instead.\nCharacter Mount: A Lammasu may only be included in your army as a character’s mount. Its points are added to that of its rider.\n"
  },
  {
    "Id": "b8-6065-a1f7-2cf2",
    "Name": "Blazing Body",
    "Type": "Global",
    "Description": "Description: At the start of every Combat phase, any model (friend or foe) that is in base contact with this model and that does not also have this special rule suffers a single Strength 3 hit with an AP of -. This hit has the Flaming Attacks special rule.\nNote that any Wounds lost due to these hits do not count towards the combat result.\n"
  },
  {
    "Id": "7d45-cf86-c84a-d2e9",
    "Name": "Born of Fire",
    "Type": "Global",
    "Description": "Description: A Bale Taurus or Great Taurus has a 3+ Ward save against any wounds suffered that were caused by an attack that has the Flaming Attacks special rule.\n"
  },
  {
    "Id": "5a6-4b8e-d397-8d42",
    "Name": "Goring horns",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+1\nAP: -3\nSpecial Rules: Flaming Attacks, Strike First\nNotes: In combat, this model may make one of its attacks each turn with this weapon.\n"
  },
  {
    "Id": "9dd9-6632-bc76-803d",
    "Name": "Trampling hooves",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -1\nSpecial Rules: Flaming Attacks\nNotes: undefined\n"
  },
  {
    "Id": "df-a39-e62-1c57",
    "Name": "Fast Cavalry",
    "Type": "Global",
    "Description": "Description: If all of the models (including characters) within a unit arrayed in an Open Order formation have this special rule, the unit may perform its Quick Turn (see page 183) even if it marched.\n"
  },
  {
    "Id": "1a06-31aa-cbfe-1a5",
    "Name": "Fire & Flee",
    "Type": "Global",
    "Description": "Description: If the majority of the models in a unit armed armed with missile weapons have this special rule, the unit may declare that it will ‘Fire & Flee’ as a charge reaction:\nFire & Flee: The unit launches a volley of weapons fire before turning to flee from the enemy. If a unit with this special rule is armed with missile weapons and can draw a line of sight to the charging unit, it may declare that it will Fire & Flee. The unit will Stand & Shoot before turning tail and fleeing from the charge. However, due to the time spent shooting at the charging foe, when making its Flee roll the unit rolls two D6 and discards the lowest result. If both dice roll the same result, discard either.\nNote that, if the distance between this unit and the charging unit is less than the Movement characteristic of the charging unit, this unit must either Hold or Flee.\n"
  },
  {
    "Id": "256b-6a1-239c-178e",
    "Name": "Daemonology",
    "Type": "Equipment",
    "Description": "Steed of Shadows\nGathering Darkness\nDaemonic Familiars\nDaemonic Vessel\nVortex of Chaos\nDaemonic Vigour\nThe Summoning\n"
  },
  {
    "Id": "17a0-e08c-7414-b9e7",
    "Name": "Backstab",
    "Type": "Global",
    "Description": "Description: If a unit with this special rule is engaged with an enemy unit’s flank or rear arc, it may re-roll any failed rolls To Hit made against that enemy unit.\n"
  },
  {
    "Id": "9fff-999f-6e96-e149",
    "Name": "Evasive",
    "Type": "Global",
    "Description": "Description: Once per turn, when a unit in which the majority of models have this special rule is declared the target during the enemy Shooting phase, it may choose to Fall Back in Good Order, fleeing directly away from the enemy unit shooting at it. Once this unit has completed its move, the enemy unit may continue with its shooting as declared.\n"
  },
  {
    "Id": "8cc3-d6f5-da17-6600",
    "Name": "Levies",
    "Type": "Global",
    "Description": "Description: Models with this special rule cannot use the Inspiring Presence rule of the army’s General nor the Hold your Ground rule of a Battle Standard. However, little is expected from Levies in battle. Therefore, units that do not have this special rule are not required to make a Panic test when a friendly unit of Levies Breaks and flees from combat.\n"
  },
  {
    "Id": "eee5-db12-1271-f2c5",
    "Name": "Throwing Weapon",
    "Type": "Equipment",
    "Description": "R: 9\"\nS: S\nAP: -\nSpecial Rules: Multiple Shots (2), Move & Shoot, Quick Shot\nNotes: -\n"
  }
]