[
  {
    "Id": "8bf7-8812-923d-29e4",
    "Name": "Pistol",
    "Type": "Core",
    "Description": "Weapons with [PISTOL] in their profile are known as Pistols. If a unit contains any models equipped with Pistols, that unit is eligible to shoot in its controlling player’s Shooting phase even while it is within Engagement Range of one or more enemy units. When such a unit is selected to shoot, it can only resolve attacks using its Pistols and can only target one of the enemy units it is within Engagement Range of. In such circumstances, a Pistol can target an enemy unit even if other friendly units are within Engagement Range of the same enemy unit. \n\nIf a model is equipped with one or more Pistols, unless it is a MONSTER or VEHICLE model, it can either shoot with its Pistols or with all of its other ranged weapons. Declare whether such a model will shoot with its Pistols or its other ranged weapons before selecting targets."
  },
  {
    "Id": "8367-374c-f87-c627",
    "Name": "Hazardous",
    "Type": "Core",
    "Description": "Weapons with [HAZARDOUS] in their profile are known as Hazardous weapons. Each time a unit is selected to shoot or fight, after that unit has resolved all of its attacks, for each Hazardous weapon that targets were selected for when resolving those attacks, that unit must take one Hazardous test. To do so, roll one D6: on a 1, that test is failed. For each failed test you must resolve the following sequence (resolve each failed test one at a time): \n\n■ If possible, select one model in that unit that has lost one or more wounds and is equipped with one or more Hazardous weapons. \n■ Otherwise, if possible, select one model in that unit (excluding CHARACTER models) equipped with one or more Hazardous weapons. \n■ Otherwise, select one CHARACTER model in that unit equipped with one or more Hazardous weapons. \n\nIf a model was selected, that unit suffers 3 mortal wounds and when allocating those mortal wounds, they must be allocated to the selected model. \n\nIf a unit from a player’s army is selected as the target of the Fire Overwatch Stratagem in their opponent’s Charge phase, any mortal wounds inflicted by Hazardous tests are allocated after the charging unit has ended its Charge move."
  },
  {
    "Id": "b4dd-3e1f-41cb-218f",
    "Name": "Leader",
    "Type": "Core",
    "Description": "While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed (pg 12), it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack successfully wounds an Attached unit, that attack cannot be allocated to a Character model in that unit, even if that Character model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to Character models in that unit.\n\nEach time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. \n\nEach time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. \n\nEach time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed."
  },
  {
    "Id": "be1e-ac8e-1e2c-3528",
    "Name": "Devastating Wounds",
    "Type": "Core",
    "Description": "Weapons with [DEVASTATING WOUNDS] in their profile are known as Devastating Wounds weapons. Each time an attack is made with such a weapon, if that attack scores a Critical Wound, no saving throw of any kind can be made against that attack (including invulnerable saving throws). Such attacks are only allocated to models after all other attacks made by the attacking unit have been allocated and resolved. After that attack is allocated and after any modifiers are applied, it inflicts a number of mortal wounds on the target equal to the Damage characteristic of that attack, instead of inflicting damage normally."
  },
  {
    "Id": "fc8a-8c24-bae9-cc1c",
    "Name": "Assault",
    "Type": "Core",
    "Description": "Weapons with [ASSAULT] in their profile are known as Assault weapons. If a unit that Advanced this turn contains any models equipped with Assault weapons, it is still eligible to shoot in this turn’s Shooting phase. When such a unit is selected to shoot, you can only resolve attacks using Assault weapons its models are equipped with."
  },
  {
    "Id": "115b-79dc-f723-d761",
    "Name": "Extra Attacks",
    "Type": "Core",
    "Description": "Weapons with [EXTRA ATTACKS] in their profile are known as Extra Attacks weapons. Each time the bearer of one or more Extra Attacks weapons fights, it makes attacks with each of the Extra Attacks melee weapons it is equipped with and it makes attacks with one of the melee weapons it is equipped with that does not have the [EXTRA ATTACKS] ability (if any). The number of attacks made with an Extra Attacks weapon cannot be modified by other rules, unless that weapon’s name is explicitly specified in that rule."
  },
  {
    "Id": "cf93-ad4d-2f08-a79d",
    "Name": "Twin-linked",
    "Type": "Core",
    "Description": "Weapons with [TWIN-LINKED] in their profile are known as Twin-linked weapons. Each time an attack is made with such a weapon, you can re-roll that attack’s Wound roll."
  },
  {
    "Id": "4111-82e3-9444-e942",
    "Name": "Anti-",
    "Type": "Core",
    "Description": "Weapons with [ANTI-KEYWORD X+] in their profile are known as Anti weapons. Each time an attack is made with such a weapon against a target with the keyword after the word ‘Anti-’, an unmodified Wound roll of ‘x+’ scores a Critical Wound."
  },
  {
    "Id": "1897-c22c-9597-12b1",
    "Name": "Sustained Hits",
    "Type": "Core",
    "Description": "Weapons with [SUSTAINED HITS X] in their profile are known as Sustained Hits weapons. Each time an attack is made with such a weapon, if a Critical Hit is rolled, that attack scores a number of additional hits on the target as denoted by ‘x’"
  },
  {
    "Id": "1202-10a8-78e9-4c67",
    "Name": "Heavy",
    "Type": "Core",
    "Description": "Weapons with [HEAVY] in their profile are known as Heavy weapons. Each time an attack is made with such a weapon, if the attacking model’s unit Remained Stationary this turn, add 1 to that attack’s Hit roll."
  },
  {
    "Id": "7cdb-fb99-44a9-8849",
    "Name": "Melta",
    "Type": "Core",
    "Description": "Weapons with [MELTA X] in their profile are known as Melta weapons. Each time an attack made with such a weapon targets a unit within half that weapon’s range, that attack’s Damage characteristic is increased by the amount denoted by ‘x’."
  },
  {
    "Id": "9bf4-280f-bbe2-6fbb",
    "Name": "Feel No Pain",
    "Type": "Core",
    "Description": "Some models have 'Feel No Pain x+' listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by 'x: that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound."
  },
  {
    "Id": "6c1f-1cf7-ff25-c99e",
    "Name": "Blast",
    "Type": "Core",
    "Description": "Weapons with [BLAST] in their profile are known as Blast weapons, and they make a random number of attacks. Each time you determine how many attacks are made with a Blast weapon, add 1 to the result for every five models that were in the target unit when you selected it as the target (rounding down). Blast weapons can never be used to make attacks against a unit that is within Engagement Range of one or more units from the attacking model’s army (including its own unit)."
  },
  {
    "Id": "9143-31ae-e0a6-6007",
    "Name": "Precision",
    "Type": "Core",
    "Description": "Weapons with [PRECISION] in their profile are known as Precision weapons. Each time an attack made with such a weapon successfully wounds an Attached unit, if a Character model in that unit is visible to the attacking model, the attacking model’s player can choose to have that attack allocated to that Character model instead of following the normal attack sequence."
  },
  {
    "Id": "4ddd-4e29-acdd-5e6d",
    "Name": "Indirect Fire",
    "Type": "Core",
    "Description": "Weapons with [INDIRECT FIRE] in their profile are known as Indirect Fire weapons, and attacks can be made with them even if the target is not visible to the attacking model. These attacks can destroy enemy models in a target unit even though none may have been visible to the attacking unit when you selected that target.\n\n\nIf no models in a target unit are visible to the attacking unit when you select that target, then each time a model in the attacking unit makes an attack against that target using an Indirect Fire weapon, subtract 1 from that attack’s Hit roll, an unmodified Hit roll of 1-3 always fails, and the target has the Benefit of Cover against that attack. Weapons with the [TORRENT] ability cannot be fired using the [INDIRECT FIRE] ability."
  },
  {
    "Id": "2ebc-abdf-8129-6c57",
    "Name": "Lance",
    "Type": "Core",
    "Description": "Weapons with [LANCE] in their profile are known as Lance weapons. Each time an attack is made with such a weapon, if the bearer made a Charge move this turn, add 1 to that attack’s Wound roll."
  },
  {
    "Id": "d1d1-611e-5191-1095",
    "Name": "Lethal Hits",
    "Type": "Core",
    "Description": "Weapons with [LETHAL HITS] in their profile are known as Lethal Hits weapons. Each time an attack is made with such a weapon, a Critical Hit automatically wounds the target."
  },
  {
    "Id": "4640-43e7-30b-215a",
    "Name": "Ignores Cover",
    "Type": "Core",
    "Description": "Weapons with [IGNORES COVER] in their profile are known as Ignores Cover weapons. Each time an attack is made with such a weapon, the target cannot have the Benefit of Cover against that attack."
  },
  {
    "Id": "c5c8-8b58-b8b6-7786",
    "Name": "Rapid Fire",
    "Type": "Core",
    "Description": "Weapons with [RAPID FIRE X] in their profile are known as Rapid Fire weapons. Each time such a weapon targets a unit within half that weapon’s range, the Attacks characteristic of that weapon is increased by the amount denoted by ‘x’."
  },
  {
    "Id": "5edf-d619-23e0-9b56",
    "Name": "Torrent",
    "Type": "Core",
    "Description": "Weapons with [TORRENT] in their profile are known as Torrent weapons. Each time an attack is made with such a weapon, that attack automatically hits the target."
  },
  {
    "Id": "ada6-bac1-ffe0-d6f7",
    "Name": "Scouts",
    "Type": "Core",
    "Description": "Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". \n\nDEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT  model has (provided only models with this ability are embarked within that Dedicated Transport model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached Character, etc.). \n\nA unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first."
  },
  {
    "Id": "c05d-f4c3-f091-4938",
    "Name": "Infiltrators",
    "Type": "Core",
    "Description": "During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models."
  },
  {
    "Id": "7cb5-dd6b-dd87-ad3b",
    "Name": "Deep Strike",
    "Type": "Core",
    "Description": "During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models.\n\nIf a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability."
  },
  {
    "Id": "b68a-5ded-65ac-98c",
    "Name": "Deadly Demise",
    "Type": "Core",
    "Description": "Some models have 'Deadly Demise x' listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by 'x' (if this is a random number, roll separately for each unit within 6\")."
  },
  {
    "Id": "bec5-4288-34a6-ccfa",
    "Name": "Stealth",
    "Type": "Core",
    "Description": "If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll."
  },
  {
    "Id": "5e13-1624-d280-418d",
    "Name": "Super-Heavy Walker",
    "Type": "Core",
    "Description": "Each time a model with this ability makes a Normal, Advance or Fall Back move, it can move through models (excluding TITANIC models) and sections of terrain features that are 4\" or less in height. \nWhen doing so:\n- It can move within Engagement Range of enemy models, but cannot end that move within Engagement Range of them.\n- It can also move through sections of terrain features that are more than 4\" in height, but if it does, after it has moved, roll one D6: on a 1, that model is Battle-shocked."
  },
  {
    "Id": "a8a0-8fe7-898-e0f3",
    "Name": "Lone Operative",
    "Type": "Core",
    "Description": "Unless part of an Attached unit, this unit can only be selected as the target of a ranged attack if the attacking model is within 12\"."
  },
  {
    "Id": "eec5-5f54-9c03-c305",
    "Name": "Hover",
    "Type": "Core",
    "Description": "Some AIRCRAFT models have 'Hover' listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode.\n\nIf a model is in Hover mode,  then until the end of the battle, its Move characteristic is changed to 20\", it loses the AIRCRAFT keyword and it loses all associated rules for being an AlRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish."
  },
  {
    "Id": "24-c886-e8ba-5a89",
    "Name": "Fights First",
    "Type": "Core",
    "Description": "Units with this ability that are eligible to fight do so in the Fights First step, provided every model in the unit has this ability."
  },
  {
    "Id": "e9c4-2bb8-12ee-cd1b",
    "Name": "Psychic",
    "Type": "Core",
    "Description": "Some weapons and abilities can only be used by PSYKERS. Such weapons and abilities are tagged with the word 'Psychic'. If a Psychic weapon or ability causes any unit to suffer one or more wounds, each of those wounds is considered to have been inflicted by a Psychic Attack."
  },
  {
    "Id": "13b2-6518-dab3-7ea1",
    "Name": "Firing Deck",
    "Type": "Core",
    "Description": "Some TRANSPORT models have ‘Firing Deck x’ listed in their abilities. Each time such a model is selected to shoot in the Shooting phase, you can select up to ‘x’ models embarked within it whose units have not already shot this phase. Then, for each of those embarked models, you can select one ranged weapon that embarked model is equipped with (excluding weapons with the [ONE SHOT] ability). Until that TRANSPORT model has resolved all of its attacks, it counts as being equipped with all of the weapons you selected in this way, in addition to its other weapons. Until the end of the phase, those selected models’ units are not eligible to shoot."
  },
  {
    "Id": "cd26-1611-860a-91e4",
    "Name": "One Shot",
    "Type": "Core",
    "Description": "The bearer can only shoot with this weapon once per battle."
  },
  {
    "Id": "c081-8ea9-eb18-0bff",
    "Name": "Tactical Perception",
    "Type": "Faction",
    "Description": "While this model is leading a unit, models in that unit have the Fights First ability."
  },
  {
    "Id": "48d0-0d0f-c9b6-5b34",
    "Name": "Tenacious Spirit",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a model in that unit makes an attack, add 1 to the Hit roll if that unit is below its Starting Strength, and add 1 to the Wound roll as well if that unit is Below Half-strength."
  },
  {
    "Id": "a7f1-e106-1e30-3452",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ Prosecutors\n■ Vigilators\n■ Witchseekers"
  },
  {
    "Id": "d569-61db-406d-1d42",
    "Name": "Slayers of Tyrants",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes an attack that targets a ^^Character, Monster^^ or ^^Vehicle^^ unit, you can re-roll the Wound roll."
  },
  {
    "Id": "0a36-c494-baad-91db",
    "Name": "From Golden Light",
    "Type": "Faction",
    "Description": "Once per battle, at the end of your opponent's turn, if this unit is not within Engagement Range of one or more enemy units, you can remove it from the battlefield and place it into Strategic Reserves."
  },
  {
    "Id": "0ad3-82b1-9962-2f29",
    "Name": "Self Repair",
    "Type": "Faction",
    "Description": "At the start of your Command phase, this model regains 1 lost wound."
  },
  {
    "Id": "1a70-8702-4179-b711",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ Custodian Guard\n■ Custodian Wardens"
  },
  {
    "Id": "be52-2414-896d-55fc",
    "Name": "Martial Inspiration",
    "Type": "Faction",
    "Description": "Once per battle, in your Charge phase, this model's unit is eligible to declare a charge in a turn in which it Advanced."
  },
  {
    "Id": "31ef-fcd4-c165-a95d",
    "Name": "Swift Onslaught",
    "Type": "Faction",
    "Description": "While this model is leading a unit, you can re-roll Charge rolls made for that unit."
  },
  {
    "Id": "07c7-730f-5219-ef8f",
    "Name": "Stand Vigil",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes an attack, re-roll a Wound roll of 1. While this unit is within range of an objective marker you control, you can re-roll the Wound roll instead."
  },
  {
    "Id": "9c46-e189-463c-266e",
    "Name": "Sentinel Storm",
    "Type": "Faction",
    "Description": "Once per battle, in your Shooting phase, after the unit has shot, it can shoot again."
  },
  {
    "Id": "8792-7fc7-692e-9a57",
    "Name": "Resolute Will",
    "Type": "Faction",
    "Description": "While a CHARACTER is leading this unit, each time an attack targets this unit, if the Strength characteristic of that attack is greater than the Toughness characteristic of this unit, subtract 1 from the Wound roll."
  },
  {
    "Id": "a696-cfc6-e27a-97ce",
    "Name": "Living Fortress",
    "Type": "Faction",
    "Description": "Once per battle, at the start of any phase, this unit can use this ability. If it does, until the end of the phase, models in this unit have the Feel No Pain 4+ ability."
  },
  {
    "Id": "957b-3814-759a-a6f9",
    "Name": "Vexilla",
    "Type": "Faction",
    "Description": "Add 1 to the Objective Control characteristic of models in the bearer’s unit."
  },
  {
    "Id": "101b-4770-32be-d3a2",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ Prosecutors\n■ Vigilators\n■ Witchseekers"
  },
  {
    "Id": "dea5-7d20-9057-895b",
    "Name": "Seeker's Instincts",
    "Type": "Faction",
    "Description": "While this model is leading a unit, add 2\" to the Move characteristic of models in that unit and add 2 to Advance and Charge rolls made for that unit."
  },
  {
    "Id": "ffb8-5424-36a5-f9da",
    "Name": "Corner the Quarry",
    "Type": "Faction",
    "Description": "Each time an enemy unit (excluding MONSTERS and VEHICLES) that is within Engagement Range of this model’s unit Falls Back, all models in that enemy unit must take a Desperate Escape test. When doing so, if that enemy unit is Battle-shocked, subtract 1 from each of those tests."
  },
  {
    "Id": "34ce-359c-4fc1-da0b",
    "Name": "Purity of Execution",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes a ranged attack that targets a Psyker unit, that attack has the PRECISION] and [DEVASTATING WOUNDS] abilities."
  },
  {
    "Id": "e6a6-1d13-3027-3fce",
    "Name": "Master of the Stances",
    "Type": "Faction",
    "Description": "Once per battle, when this model's unit is selected to fight, it can use this ability. If it does, until that fight is resolved, both Ka'tah Stances are active for that unit, instead of only one."
  },
  {
    "Id": "de62-c023-6540-2206",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ Custodian Guard\n■ Custodian Wardens"
  },
  {
    "Id": "4e62-8c6f-2631-373c",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ Allarus Custodians"
  },
  {
    "Id": "ec4f-845a-63a9-62fb",
    "Name": "Auramite and Adamantite",
    "Type": "Faction",
    "Description": "Once per battle, at the start of any phase, this model can use this ability. If it does, until the end of the phase, each time an attack is allocated to this model, change the Damage characteristic of that attack to 1."
  },
  {
    "Id": "d569-255b-ad41-d354",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ Vertus Praetors"
  },
  {
    "Id": "df6a-c9a7-bfc1-5cf9",
    "Name": "Sweeping Advance",
    "Type": "Faction",
    "Description": "Once per battle, at the end of the Fight phase, if this model's unit fought this phase, if it is within Engagement Range of one or more enemy units, it can make a Fall Back move or, if it is not within Engagement Range of one or more enemy units, it can make a Normal move."
  },
  {
    "Id": "8ba8-1664-4bc8-3a2d",
    "Name": "Feel No Pain",
    "Type": "Faction",
    "Description": "5+"
  },
  {
    "Id": "a26c-fa45-83a0-13b5",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ Custodian Guard\n■ Custodian Wardens"
  },
  {
    "Id": "7797-8174-31bb-6e9f",
    "Name": "Captain-General",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a model in that unit makes an attack, you can ignore any or all modifiers to that attack's Ballistic Skill or Weapon Skill characteristics and/or all modifiers to the Hit roll."
  },
  {
    "Id": "0d01-a562-a398-9775",
    "Name": "Moment Shackle",
    "Type": "Faction",
    "Description": "Once per battle, at the start of the Fight phase, you can select one of the following to take effect until the end of the phase:\n■ This model's Watcher's Axe melee weapon has an Attacks characteristic of 12.\n■ This model has a 2+ invulnerable save."
  },
  {
    "Id": "7591-8f8b-3b46-ede2",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ Custodian Guard\n■ Custodian Wardens"
  },
  {
    "Id": "2397-a41d-fe9e-ed6d",
    "Name": "Golden Laurels",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a melee attack targets that unit, worsen that Armour Penetration characteristic of that attack by 1."
  },
  {
    "Id": "f775-c5a7-e958-0496",
    "Name": "Hero of Lion's Gate",
    "Type": "Faction",
    "Description": "Once per battle, after making a Hit roll, Wound roll or saving throw for this model, you can change the result of that roll to an unmodified 6."
  },
  {
    "Id": "afc2-2959-a417-e071",
    "Name": "Unyielding Ancient",
    "Type": "Faction",
    "Description": "The first time this model is destroyed, remove it from play without resolving its Deadly Demise ability. Then, at the end of the phase, roll one D6: on a 2+, set this model back up on the battlefield as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with D6 wounds remaining."
  },
  {
    "Id": "2157-a06e-818d-5b71",
    "Name": "Assault Ramp",
    "Type": "Faction",
    "Description": "Each time a unit disembarks from this model after it has made a Normal move, that unit is still eligible to declare a charge this turn."
  },
  {
    "Id": "7ab4-e69c-6d26-8827",
    "Name": "Damaged: 1-5 Wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "1203-8d21-0ebf-b3da",
    "Name": "Turbo Boost",
    "Type": "Faction",
    "Description": "Each time this unit Advances, do not make an Advance roll. Instead, until the end of the phase, add 6\" to the Move characteristic of models in this unit."
  },
  {
    "Id": "9896-b356-2ad8-2fb9",
    "Name": "Quicksilver Execution",
    "Type": "Faction",
    "Description": "Once per battle, after this unit ends a normal or Advance move, you can select one enemy unit (excluding MONSTER and VEHICLE units) that it moved over during that move, then roll one D6 for each model in this unit; for each 2+, that enemy unit suffers 2 mortal wounds."
  },
  {
    "Id": "ba73-e7d0-22ea-1c8f",
    "Name": "Deft Parry",
    "Type": "Faction",
    "Description": "Each time a melee attack targets this unit, subtract 1 from the Hit roll."
  },
  {
    "Id": "6449-d735-2ac6-02b1",
    "Name": "Sanctified Flames",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this unit has shot, select one enemy unit that was hit by one or more of those attacks. That unit must take a Battle-shock test."
  },
  {
    "Id": "9ab1-2eb7-a100-ab90",
    "Name": "Stand Vigil",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes an attack, re-roll a Wound roll of 1. While this unit is within range of an objective marker you control, you can re-roll the Wound roll isntead."
  },
  {
    "Id": "8b43-d041-22ff-b0a5",
    "Name": "No Foe Shall Stand",
    "Type": "Faction",
    "Description": "Once per battle, at the start of your Shooting phase, this unit can use this ability. If it does, until the end of the phase, ranged weapons equipped by models in this unit have the [LETHAL HITS] and [IGNORES COVER abilities]."
  },
  {
    "Id": "85d7-f209-acae-3353",
    "Name": "Disintegration Beams",
    "Type": "Faction",
    "Description": "Once per battle, at the start of your Shooting phase, this unit can use this ability. If it does, until the end of the phase, ranged weapons equipped by models in this unit have the Devastating Wounds ability."
  },
  {
    "Id": "9ce3-c1f0-ec93-d409",
    "Name": "Saturation Volleys",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this unit has shot, select one enemy unit (excluding MONSTERS and VEHICLES) hit by one or more of those attacks. Until the start of your next turn, while this unit is on the battlefield. that enemy unit is suppressed. While a unit is suppressed, each time a model in that unit makes an attack, subtract 1 from the hit roll."
  },
  {
    "Id": "1d2c-eda9-a400-f075",
    "Name": "Heavy Assault Infantry",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes a ranged attack that targets the closest eligible target, re-roll a Wound roll of 1."
  },
  {
    "Id": "cf57-6e91-6435-b3fd",
    "Name": "From Golden Light",
    "Type": "Faction",
    "Description": "Once per battle, at the end of your opponent's turn, if this unit is not whithin Engagement Range of one or more enemy units, you can remove it from the battlefield. In the Reinforcements step of your next Movement phase, set it up anywhere on the battlefield that is more than 9\" horizontally away from all enemy models."
  },
  {
    "Id": "8733-1b5b-a5b8-deaf",
    "Name": "Implacable Vanguard",
    "Type": "Faction",
    "Description": "Once per battle, in your Shooting phase, after this unit has shot, if it is not within Engagement Range of one or more enemy units, it can make a Normal move of up to 6\". If it does, until the end of the turn, this unit is not elgibile to declare a charge."
  },
  {
    "Id": "4d74-67a5-1b1f-16ce",
    "Name": "Turbo Boost",
    "Type": "Faction",
    "Description": "Each time this unit Advances, do not make an Advance roll. Instead, until the end of the phase, add 6\" to the Move characteristic of models in this unit."
  },
  {
    "Id": "fd11-6ea5-03cc-0fa7",
    "Name": "Strike from the Skies",
    "Type": "Faction",
    "Description": "This unit is eligible to shoot and declare a charge in a turn in which it Fell Back."
  },
  {
    "Id": "95ed-fba0-2edf-540c",
    "Name": "Swooping Dive",
    "Type": "Faction",
    "Description": "Once per battle, you can target this unit with the Rapid Ingress Stratagem for 0 CP, and can do so even if you have already targeted a different unit with that Stratagem that phase."
  },
  {
    "Id": "cfa9-7475-9b27-f8f7",
    "Name": "Tarsis Buckler",
    "Type": "Faction",
    "Description": "The bearer has a Wounds characteristic of 4."
  },
  {
    "Id": "50d4-136a-4e2a-d234",
    "Name": "Galatus Shield",
    "Type": "Faction",
    "Description": "Each time a melee attack targets this model subtract 1 from the Wound roll."
  },
  {
    "Id": "b63c-74b0-7099-b509",
    "Name": "Dread Foe",
    "Type": "Faction",
    "Description": "Each time this model is selected to fight, you can select one enemy unit within Engagement Range of it and roll one D6, adding 2 to the result if it made a Charge move this turn: on 4-5, hat enemy unit suffers D3 mortal wounds; on a 6+, that enemy suffers 3 mortal wounds."
  },
  {
    "Id": "7636-6089-5b7c-d80a",
    "Name": "Merciless Hunter",
    "Type": "Faction",
    "Description": "In your Shooting phase, each time this model makes an attack that targets an enemy unit that is Below Half-strength, add 1 to the Wound roll."
  },
  {
    "Id": "60a4-507e-da36-683c",
    "Name": "Advanced Firepower",
    "Type": "Faction",
    "Description": "Each time this model makes an attack with its Twin iliastus accelerator cannon that targets an enemy unit (excluding MONSTERS and VEHICLES), that attack has the [LETHAL HITS] ability. Each time this model makes an attack with its Twin arachnus heavy blaze cannon that targets an enemy MONSTER or VEHICLE unit, that attack has the [LETHAL HITS] ability."
  },
  {
    "Id": "6070-91c7-6463-31cd",
    "Name": "Damaged: 1-5 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "47d3-771a-7668-fd15",
    "Name": "Guardian Eternal",
    "Type": "Faction",
    "Description": "Each time an attack is allocated to this model, subtract 1 from the Damage characteristic of that attack."
  },
  {
    "Id": "c0e2-de2c-19fb-6a94",
    "Name": "Damaged: 1-4 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "bad7-0704-956b-29e3",
    "Name": "Devoted to Destruction",
    "Type": "Faction",
    "Description": "If this model is equipped with 2 Telemon caestus weapons in addition to its armoured feet weapon, add 2 to the Attacks characteristic of those Telemon caestus weapons."
  },
  {
    "Id": "a331-3792-d689-fd1b",
    "Name": "Fire Support",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, each time a friendly model that disembarked from this ^^Transport^^ this turn makes an attack that targets that enemy unit, you can re-roll the Wound roll."
  },
  {
    "Id": "d4ab-7165-234f-e7fc",
    "Name": "Damaged: 1-5 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "95ab-e37b-58cb-a0a2",
    "Name": "Damaged: 1-7 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-7 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "44e8-6759-a126-ec2a",
    "Name": "Assault Dropship",
    "Type": "Faction",
    "Description": "If a unit disembarks from this TRANSPORT before it moves, until the end of the turn, that unit is eligibile to charge in a turn in which it Advanced."
  },
  {
    "Id": "24b5-43b5-1537-2bd2",
    "Name": "Infernus Firebomb",
    "Type": "Faction",
    "Description": "Each time this model ends a Normal move, you can select one enemy unit it moved over during that move. Until the end of the turn, models in that unit cannot have the Benefit of Cover. In addition, roll one D6 for eah model in that unit: for each 6, that unit suffers 1 mortal wound."
  },
  {
    "Id": "2eb0-f0e2-258d-8fbb",
    "Name": "Damaged: 1-7 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-7 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "8c82-5364-20d8-6dd6",
    "Name": "Raptor Blade",
    "Type": "Faction",
    "Description": "Add 1 to the Attacks, Strength and Damage characteristics of the bearer's melee weapons. While the bearer is within Engagement Range of one or more enemy PSYKER units that are Battle-shocked, add 2 to the Attacks, Strength and Damage characteristics of the bearer's melee weapons instead."
  },
  {
    "Id": "4d4a-a2b5-f20e-d74b",
    "Name": "Castellan's Mark",
    "Type": "Faction",
    "Description": "After both players have deployed their armies, you can select up to two ADEPTUS CUSTODES units from your army (excluding ANATHEMA PSYKANA units) and redeploy all of those units. When doing so, any of those units can be placed into Strategic Reserves, regardless of how  any units are already in Strategic Reserves."
  },
  {
    "Id": "690b-3e5a-80a2-3c33",
    "Name": "Panoptispex",
    "Type": "Faction",
    "Description": "While the bearer is leading a unit, ranged weapons equipped by models in that unit have the [IGNORES COVER] ability."
  },
  {
    "Id": "cb8c-5cc8-a3f2-30e1",
    "Name": "From the Hall of Armouries",
    "Type": "Faction",
    "Description": "Add 1 to the Strength and Damage characteristics of the bearer's melee weapons."
  },
  {
    "Id": "1500-653e-b902-c024",
    "Name": "Radiant Mantle",
    "Type": "Faction",
    "Description": "Each time an attack targets the bearer's unit, if the attacking model is within 12\", subtract 1 from the Hit roll."
  },
  {
    "Id": "ba26-b8dd-9fb6-ca44",
    "Name": "Aegis Projector",
    "Type": "Faction",
    "Description": "Once per turn, the first time a saving throw is failed for the bearer's unit, change the Damage characteristic of that attack to 0."
  },
  {
    "Id": "1849-7422-6368-81f9",
    "Name": "Gift of Terran Artifice",
    "Type": "Faction",
    "Description": "Each time the bearer makes a melee attack, add 1 to the Wound roll."
  },
  {
    "Id": "aacf-9d19-3f49-2a7a",
    "Name": "Champion of the Imperium",
    "Type": "Faction",
    "Description": "The range of the bearer’s Null Aegis or Deadly Unity ability (see left) is increased to 9\"."
  },
  {
    "Id": "9618-808b-3363-3fe7",
    "Name": "Auric Mantle",
    "Type": "Faction",
    "Description": "Add 2 to the bearer's Wounds characteristic."
  },
  {
    "Id": "bc7d-a1eb-3a91-608f",
    "Name": "Enhanced Voidsheen Cloak",
    "Type": "Faction",
    "Description": "Each time an attack is allocated to the bearer, subtract 1 from the Damage characteristic of that attack. If that attack was made by a PSYKER or Battle-shocked model, change the Damage characteristic of that attack to 1 instead."
  },
  {
    "Id": "6e2f-3fa3-dbf1-9c39",
    "Name": "Huntress' Eye",
    "Type": "Faction",
    "Description": "In your Command phase, select one enemy unit within 12\" of the bearer. That unit must take a Battle-shock test."
  },
  {
    "Id": "79-a1ca-49b1-29b5",
    "Name": "Oblivion Knight",
    "Type": "Faction",
    "Description": "While the bearer is leading a unit, each time a model in that unit makes an attack, add 1 to the Hit roll. If that attack targeted an enemy PSYKER unit, add 1 to the Wound roll as well."
  },
  {
    "Id": "a57f-54ef-d2d7-805b",
    "Name": "Blade Imperator",
    "Type": "Faction",
    "Description": "Each time the bearer's unit ends a Charge move, select one enemy unit within Engagement Range of the bearer and roll one D6: on a 4+, that enemy unit suffers D3 mortal wounds. Once per battle, when the bearer's unit ends a Charge move, all enemy units within 6\" of the bearer must take a Battle-shock test."
  },
  {
    "Id": "ab64-ebf-157e-d1a8",
    "Name": "Inspirational Exemplar",
    "Type": "Faction",
    "Description": "The bearer has a Leadership characteristic of 5+. Once per battle, at the start of any phase, you can select one friendly ADEPTUS CUSTODES unit that is Battle-shocked and within 12\" of the bearer: that unit is no longer Battle-shocked."
  },
  {
    "Id": "1742-9392-d2c3-f2e4",
    "Name": "Veiled Blade",
    "Type": "Faction",
    "Description": "Add 2 to the Attacks characteristic of the bearer's melee weapons. Once per battle, at the start of any Command phase, triple the bearer's Objective Control characteristic until the end of the turn."
  },
  {
    "Id": "eea-c794-78ec-c6b4",
    "Name": "Martial Philosopher",
    "Type": "Faction",
    "Description": "The bearer's unit is eligible to shoot and/or declare a charge in a turn in which it Fell Back. Once per battle, when an enemy unit ends a Normal, Advance or Charge move within 9\" of the bearer, if the bearer's unit is not within Engagement Range of one or more enemy units, it can make a Normal move of up to 6\"."
  },
  {
    "Id": "6f06-3ae3-ddd5-4968",
    "Name": "Honoured Fallen",
    "Type": "Faction",
    "Description": "ADEPTUS CUSTODES VEHICLE model only. While a friendly ADEPTUS CUSTODES INFANTRY or ADEPTUS CUSTODES MOUNTED unit is within 6\" of the bearer, each time a model in that unit makes  an attack, re‑roll a Hit roll of 1."
  },
  {
    "Id": "965b-4958-ea90-342d",
    "Name": "Augury Uplink",
    "Type": "Faction",
    "Description": "ADEPTUS CUSTODES model only. The bearer has the Feel No Pain 5+ ability."
  },
  {
    "Id": "e674-bd35-3644-f7e0",
    "Name": "Adamantine Talisman",
    "Type": "Faction",
    "Description": "ADEPTUS CUSTODES model only. Improve the Attacks, Strength and Damage characteristics of melee weapons equipped by the bearer by 1."
  },
  {
    "Id": "b084-fb47-cee0-d538",
    "Name": "Veteran of the Kataphraktoi",
    "Type": "Faction",
    "Description": "ADEPTUS CUSTODES INFANTRY or ADEPTUS CUSTODES MOUNTED model only. In your Command phase, select one ADEPTUS CUSTODES VEHICLE or ADEPTUS CUSTODES MOUNTED unit within 6\" of the bearer. Until the start of your next Command phase, that unit is eligible to shoot in a turn in which it Fell Back."
  },
  {
    "Id": "e771-0d0c-4e40-e8ff",
    "Name": "Superior Creation",
    "Type": "Faction",
    "Description": "Adeptus Custodes Infantry model only. The first time the bearer is destroyed, roll one D6 at the end of the phase. On a 2+, set the bearer back up on the battlefield, as close as possible to where it was destroyed and not within Engagement Range of one or more enemy units, with its full wounds remaining."
  },
  {
    "Id": "a9cd-ad2a-b39d-4d07",
    "Name": "Praesidius",
    "Type": "Faction",
    "Description": "The bearer has the Lone Operative and Stealth abilities."
  },
  {
    "Id": "64a9-585f-a4c7-2b08",
    "Name": "Fierce Conqueror",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, until the end of the phase, add 2 to the Attacks characteristic of melee weapons equipped by the bearer for every 5 enemy models within 6\" of the bearer (rounding  down)."
  },
  {
    "Id": "9495-e52a-e24f-8910",
    "Name": "Admonimortis",
    "Type": "Faction",
    "Description": "Shield‑Captain model only. Improve the Strength characteristic of melee weapons equipped by the bearer by 3, and improve the Armour Penetration and Damage characteristics of those weapons by  1."
  },
  {
    "Id": "b95d-04e9-97fd-4125",
    "Name": "Daughter of the Abyss",
    "Type": "Faction",
    "Description": "Description: This model has the Feel No Pain 3+ ability against Psychic Attacks and mortal wounds."
  },
  {
    "Id": "e3cf-4870-44cf-74da",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Description: This model has a 5+ invulnerable save."
  },
  {
    "Id": "4042-b2c1-d581-dbe7",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Description: This model has a 4+ invulnerable save."
  },
  {
    "Id": "2184-10e8-fe1e-9731",
    "Name": "Praesidium Shield",
    "Type": "Faction",
    "Description": "Description: Add 1 to the bearer's Wounds characteristic."
  },
  {
    "Id": "ac43-e2b3-63cb-ecb2",
    "Name": "Vexilla",
    "Type": "Faction",
    "Description": "Description: Add 1 to the Objective Control characteristic of models in the bearer's unit."
  },
  {
    "Id": "5a38-d608-89c4-6377",
    "Name": "Strategic Mastery",
    "Type": "Faction",
    "Description": "Description: Once per battle round, one unit from your army with this ability can use it when its unit is targeted with a Stratagem. If it does, reduce the CP cost of that use of that Stratagem by 1CP."
  },
  {
    "Id": "0300-84b9-69cf-b64f",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Description: Models in this unit have a 4+ invulnerable save."
  },
  {
    "Id": "2048-15a2-ecb8-1709",
    "Name": "Null Aegis (Aura)",
    "Type": "Faction",
    "Description": "While an ^^**Adeptus Custodes^^** unit is within 6\" of this unit, models in that unit have the Feel No Pain 5+ ability against Psychic Attacks and mortal wounds."
  },
  {
    "Id": "5678-aeb6-f682-8a75",
    "Name": "Deadly Unity (Aura)",
    "Type": "Faction",
    "Description": "While an **^Anathema Psykana^^** unit is within 6\" of this unit, each time a model in that ^^**Anathema Psykana^^** unit makes an attack, add 1 to the Hit roll."
  },
  {
    "Id": "e348-7090-3aff-ee2c",
    "Name": "Martial Ka'tah",
    "Type": "Faction",
    "Description": "Each time a unit with this ability is selected to fight, select one of the Ka'tah stances below. Until that unit has finished making its attacks, the selected Stance is active for it and it gains the relevant ability.\n\n■ DACATARAI STANCE\nMelee weapons equipped by models in this unit have the [SUSTAINED HITS 1] ability.\n■ RENDAX STANCE\nMelee weapons equipped by models in this unit have the [LETHAL HITS] ability."
  },
  {
    "Id": "134a-950c-df71-1a76",
    "Name": "Veil of Darkness",
    "Type": "Faction",
    "Description": "NECRONS model only. Once per battle, at the end of your opponent’s turn, if the bearer’s unit is not within Engagement Range of one or more enemy units, the bearer can use this Enhancement. If it does, remove that unit from the battlefield. Then, in the Reinforcements step of your next Movement phase, set up that unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models."
  },
  {
    "Id": "471d-7d60-1f1d-f7e1",
    "Name": "Nether-realm Casket",
    "Type": "Faction",
    "Description": "NECRONS model only. While the bearer is leading a unit, models in that unit have the Stealth ability."
  },
  {
    "Id": "32de-35c9-8e2f-72",
    "Name": "Phasal Subjugator (Aura)",
    "Type": "Faction",
    "Description": "NECRONS model only. While a friendly NECRONS unit (excluding CHARACTER units) is within 6\" of the bearer, each time a model in that unit makes an attack, add 1 to the hit roll."
  },
  {
    "Id": "d2be-fc47-cd4e-92a4",
    "Name": "Dimensional Overseer",
    "Type": "Faction",
    "Description": "NECRONS model only. While the bearer is on the battlefield or in Strategic Reserves, add 1 to the number of units from your army that you can select for the Hyperphasing rule."
  },
  {
    "Id": "90c3-4762-cc9b-34dc",
    "Name": "Eternal Madness",
    "Type": "Faction",
    "Description": "NECRONS model only. In the Fight phase, each time a model in the bearer's unit is destroyed, if that model had not fought this phase, roll one D6. On a 4+, do not remove the destroyed model from play; it can fight after the attacking model's unit has finished making its attacks, and is then removed from play."
  },
  {
    "Id": "572a-806f-52a7-36e6",
    "Name": "Ingrained Superiority",
    "Type": "Faction",
    "Description": "NECRONS model only. Each time a model in the bearer's unit makes an attack, on a Critical Wound, improve the Armour Penetration characteristic of that attack by 1."
  },
  {
    "Id": "a148-5cca-37f2-764a",
    "Name": "Soulless Reaper",
    "Type": "Faction",
    "Description": "DESTROYER CULT model only. Each time an enemy unit within Engagement Range of the bearer's unit is selected to Fall Back, roll one D6. On a 3+, that unit cannot Fall Back and must Remain Stationary."
  },
  {
    "Id": "9553-37b3-1dfc-fef5",
    "Name": "Eldritch Nightmare",
    "Type": "Faction",
    "Description": "DESTROYER CULT model only. At the start of the Fight phase, each enemy unit within Engagement Range of the bearer must take a Battle-shock test."
  },
  {
    "Id": "6012-9e87-6e69-8a7b",
    "Name": "Dimensional Sanctum",
    "Type": "Faction",
    "Description": "CRYPTEK model only. Models in the bearer's unit have the Infiltrators ability."
  },
  {
    "Id": "aba5-2733-6f8-21c3",
    "Name": "Hyperphasic Fulcrum",
    "Type": "Faction",
    "Description": "CRYPTEK model only. While the bearer is leading a unit, if that unit is wholly within your army's Power Matrix, each time a model in that unit makes an attack, re-roll a Wound roll of 1."
  },
  {
    "Id": "58c9-70f7-6e21-8031",
    "Name": "Autodivinator",
    "Type": "Faction",
    "Description": "CRYPTEK model only. Each time your opponent gains a CP as a result of an ability, roll one D6: on a 2+, you also gain 1CP."
  },
  {
    "Id": "3899-6b21-3566-a998",
    "Name": "Metalodermal Tesla Weave",
    "Type": "Faction",
    "Description": "CRYPTEK model only. Once per phase, when an enemy unit selects the bearer's unit as a target of a charge, roll one D6: on a 2-5, that enemy unit suffers D3 mortal wounds, on a 6, that enemy unit suffers 3 mortal wounds."
  },
  {
    "Id": "2695-8fb-ef38-9535",
    "Name": "Honourable Combatant",
    "Type": "Faction",
    "Description": "OVERLORD model only. Each time the bearer's unit destroys an enemy CHARACTER unit, your opponent loses 1CP if they have any."
  },
  {
    "Id": "2cac-9b4b-a8d4-7b76",
    "Name": "Unflinching Will",
    "Type": "Faction",
    "Description": "OVERLORD model only. The bearer's melee weapons have the [PRECISION] and [ANTI-INFANTRY 5+] abilities."
  },
  {
    "Id": "4d66-d140-3901-6bf",
    "Name": "Warrior Noble",
    "Type": "Faction",
    "Description": "OVERLORD model only. Each time a melee attack targets the bearer's unit, subtract 1 from the Hit roll."
  },
  {
    "Id": "7a4d-f2b7-34a5-8d8d",
    "Name": "Eternal Conqueror",
    "Type": "Faction",
    "Description": "OVERLORD model only. Each time a model in the bearer's unit makes an attack that targets an enemy unit within range of an objective marker, you can re-roll the Hit roll."
  },
  {
    "Id": "1f5-2b97-2b2c-60dc",
    "Name": "Enaegic Dermal Bond",
    "Type": "Faction",
    "Description": "NECRONS model only. The bearer has the Feel No Pain 4+ ability."
  },
  {
    "Id": "65b7-8f59-2648-ae5f",
    "Name": "Arisen Tyrant",
    "Type": "Faction",
    "Description": "NECRONS model only. Each time a model in the bearer's unit makes an attack, re-roll a Hit roll of 1. If the bearer's unit was set up on the battlefield this turn, you can re-roll the Hit roll instead."
  },
  {
    "Id": "e845-c3a1-38e0-bfb9",
    "Name": "Hyperspatial Transfer Node",
    "Type": "Faction",
    "Description": "NECRONS model only. Each time the bearer's unit Advances, do not make an Advance roll for it. Instead, until the end of the phase, add 6\" to the Move characteristic of models in the bearer's unit."
  },
  {
    "Id": "b2e-c6a4-6252-9699",
    "Name": "Osteoclave Fulcrum",
    "Type": "Faction",
    "Description": "NECRONS model only. Models in the bearer's unit have the Deep Strike ability."
  },
  {
    "Id": "0379-3e19-803c-5ecb",
    "Name": "Dread Majesty (Aura)",
    "Type": "Faction",
    "Description": "While a friendly NECRONS unit (excluding TITANIC units) is within 6\" of the bearer, each time a model in that unit makes an attack, re‑roll a Hit roll of 1 and re‑roll a Wound roll of 1."
  },
  {
    "Id": "bd49-399b-926c-936d",
    "Name": "Minaturised Nebuloscope",
    "Type": "Faction",
    "Description": "Ranged weapons equipped by models in the bearer’s unit have the [IGNORES COVER] ability."
  },
  {
    "Id": "91f5-bbc1-8ec9-68cc",
    "Name": "Demanding Leader",
    "Type": "Faction",
    "Description": "In your Command phase, select one friendly NECRONS VEHICLE or NECRONS MOUNTED unit (excluding TITANIC units) within 6\" of the bearer. Until the start of your next Command phase, that unit is eligible to shoot in a turn in which it Fell Back."
  },
  {
    "Id": "0ce9-aaa0-f90b-2d7e",
    "Name": "Chrono-impedance Fields",
    "Type": "Faction",
    "Description": "In your Command phase, select one friendly NECRONS VEHICLE or NECRONS MOUNTED unit (excluding Titanic units) within 6\" of the bearer. Until the start of your next Command phase, each time an attack is allocated to a model in that unit, subtract 1 from the Damage characteristic of that attack."
  },
  {
    "Id": "e4bd-02a6-6c13-fc0f",
    "Name": "Autocratic Avarice",
    "Type": "Faction",
    "Description": "At the start of the battle, select one objective marker in No Man's Land. While this model is within range of that objective marker, change its Objective Control characteristic to 4."
  },
  {
    "Id": "9f37-2936-02ea-8ffe",
    "Name": "Martial Apotheosis",
    "Type": "Faction",
    "Description": "Each time this model makes an attack, re-roll a Hit roll of 1 and re-roll a Wound roll of 1."
  },
  {
    "Id": "6ae2-06a1-50e3-a3d8",
    "Name": "Endless Legions",
    "Type": "Faction",
    "Description": "At the end of the battle of the battle, if this model is part of your Crusade army and it gained 3 or more XP (excluding XP gained from Marked for Greatness), you gain 1RP."
  },
  {
    "Id": "4b65-81d6-dcc1-b6b5",
    "Name": "The Will To Serve",
    "Type": "Faction",
    "Description": "Out of Action tests taken for this unit are automatically passed."
  },
  {
    "Id": "9b2e-521f-cfcc-542e",
    "Name": "Hypergrav Field Manipulation",
    "Type": "Faction",
    "Description": "Add 2\" to the Move characteristic of models in this unit."
  },
  {
    "Id": "60dd-11ed-c7f5-8d9c",
    "Name": "Engrammatic Imprinting",
    "Type": "Faction",
    "Description": "While this unit is within 6\" of one or more **^^Character^^** models from your Crusade army, each time a model in this unit makes an attack, re-roll a Hit roll of 1."
  },
  {
    "Id": "09d8-b47d-c3c3-0e05",
    "Name": "Undying Revenants",
    "Type": "Faction",
    "Description": "Each time you make a Reanimation Protocols roll for this unit, add 1 to the result."
  },
  {
    "Id": "21ab-9f38-7657-0496",
    "Name": "Spectral Disassembly Targeters",
    "Type": "Faction",
    "Description": "Ranged weapons equipped by models in this unit have the **[IGNORES COVER]** ability."
  },
  {
    "Id": "ed90-b51e-d219-0d32",
    "Name": "Subdual Protocols",
    "Type": "Faction",
    "Description": "While this unit is Battle-shocked, halve the Objective Control characteristic of models in this unit instead of changing it to 0."
  },
  {
    "Id": "62b8-04c8-a4a2-d6ec",
    "Name": "Self-replicator Nodes",
    "Type": "Faction",
    "Description": "Once per turn, one unit from your Crusade army with this Battle Trait can change the result of its Reanimation Protocols roll to 3."
  },
  {
    "Id": "d723-5652-3f58-a2c4",
    "Name": "Guardian Constructs",
    "Type": "Faction",
    "Description": "While a friendly ^^**Cryptek**^^ unit is on the battlefield, each time a model in this unit makes a melee attack, re-roll a Wound roll of 1."
  },
  {
    "Id": "d613-7683-2f67-3b92",
    "Name": "Optimised Aggressors",
    "Type": "Faction",
    "Description": "You can re-roll Advance and Charge rolls made for this unit."
  },
  {
    "Id": "2a98-bf22-f0af-4a1e",
    "Name": "Tachyon Field Phase Inducer",
    "Type": "Faction",
    "Description": "The bearer has the Deadly Demise D3 ability. In addition, select one of the bearer's melee weapons; add 2 to the Strength and Attacks characteristic of that weapon, and that weapon has the **[LETHAL HITS]** ability."
  },
  {
    "Id": "33c7-e11c-0019-5435",
    "Name": "Orb of Eternity",
    "Type": "Faction",
    "Description": "While the bearer is leading a unit, each time that unit's Reanimation Protocols activate, it reanimates 3 wounds instead of D3 wounds."
  },
  {
    "Id": "8545-2084-8eb8-39f3",
    "Name": "Casket of Heshkefnet",
    "Type": "Faction",
    "Description": "Once per battle, at the start of your Command phase, select one unit of your opponent's army. Until the start of your next Command phase, each time a model from your Crusade army makes an attack that targets that enemy unit, you can re-roll the Hit roll."
  },
  {
    "Id": "4875-3021-6838-95b5",
    "Name": "Godpyre Mantle",
    "Type": "Faction",
    "Description": "Models in the bearer's unit have the Stealth ability."
  },
  {
    "Id": "20e8-7393-ab52-c9f6",
    "Name": "Destroyer Madness",
    "Type": "Faction",
    "Description": "Each time this model makes an attack, you can re-roll the Hit roll."
  },
  {
    "Id": "ea31-2582-622a-52fe",
    "Name": "Creeping Madness",
    "Type": "Faction",
    "Description": "- Add 1 to the Strength and Attacks characteristic of melee weapons equipped by this unit.\n- This unit has the Lone Operative ability and loses the Leader ability."
  },
  {
    "Id": "5930-9630-6b27-3f78",
    "Name": "Mindless Reaper",
    "Type": "Faction",
    "Description": "- Each time a model in this unit makes an attack, you can re-roll the Hit roll.\n- Worsen the Leadership and Objective Control characteristics of this unit by 1."
  },
  {
    "Id": "3d2a-ad86-2223-f911",
    "Name": "Engrammatic Degradation",
    "Type": "Faction",
    "Description": "- Each time you target this unit with a Stratagem, reduce that Stratagem's cost by 1CP for that usage.\n- This cannot Fall Back or Advance."
  },
  {
    "Id": "271e-3791-de91-b1ec",
    "Name": "Depleted Transmaterial Reserves",
    "Type": "Faction",
    "Description": "- Add 1 to the Attacks characteristic of melee weapons equipped by models in this unit.\n- This unit cannot use its Reanimation Protocols ability."
  },
  {
    "Id": "e9f1-5c72-01f8-64e6",
    "Name": "Rapid Reanimation",
    "Type": "Faction",
    "Description": "Once per battle round, you can re-roll the roll for one unit in your Crusade army's Reanimation Protocols ability."
  },
  {
    "Id": "dd02-9468-e232-e878",
    "Name": "Resurrection Flux",
    "Type": "Faction",
    "Description": "While a unit is Below Half-strength, add 1 to the result of that unit's Reanimation Protocols roll."
  },
  {
    "Id": "be82-970f-fcac-0e56",
    "Name": "Anastasic Contingency",
    "Type": "Faction",
    "Description": "Once per battle, after an enemy unit has caused a unit from your Crusade army to go below its Starting Strength, that unit can use its Reanimation Protocols ability."
  },
  {
    "Id": "9591-dea2-46c1-fce4",
    "Name": "Harmonised Dynastic Hyperdermis",
    "Type": "Faction",
    "Description": "At the start of the battle, select one ^^**Character^^** unit and add 1 to the Toughness characteristic of models in that unit until the end of the battle."
  },
  {
    "Id": "605b-ae70-86a3-9ba0",
    "Name": "Servile Preservation Protocols",
    "Type": "Faction",
    "Description": "At the start of the battle, select one ^^**Character^^** unit. Each time a Bodyguard model in that unit is destroyed by a melee attack, if that model has not fought that phase, roll one D6: on a 3+, do not remove it from play. The destroyed model can fight after the attacking model's unit has finished making its attacks, and is then removed from play."
  },
  {
    "Id": "bde4-b623-4e36-9529",
    "Name": "Remastered Deficiency",
    "Type": "Faction",
    "Description": "Once per battle round, you can target a **^^Necrons Character^^** unit from your army with the Command Re-roll Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase."
  },
  {
    "Id": "01c3-ee26-6917-3af8",
    "Name": "Astromantic Perception Portal",
    "Type": "Faction",
    "Description": "Once per turn, select one **^^Necrons^^** unit that was set up on the battlefield using the Deep Strike ability this turn. Until the end of the turn, each time a model in that unit makes an attack, you can re-roll the Hit roll."
  },
  {
    "Id": "fbdf-93b0-0f7e-a518",
    "Name": "Dimensional Catacombs",
    "Type": "Faction",
    "Description": "Before the start of the battle, select up to three **^^Necrons Infantry^^** units from your Crusade army. Those units have the Scouts 6\" ability, and while using that ability, they can **^^Fly^^**."
  },
  {
    "Id": "8989-e8a0-0b97-4447",
    "Name": "Transtemporal Acceleration",
    "Type": "Faction",
    "Description": "Once per battle, in your Command phase, select one **^^Necrons^^** unit from your Crusade army. Until the end of the turn, add 2 to Advance and Charge roll made for that unit."
  },
  {
    "Id": "4c02-411-e9be-6773",
    "Name": "Master Chronomancer",
    "Type": "Faction",
    "Description": "While this model is leading a unit, models in that unit have a 4+ invulnerable save."
  },
  {
    "Id": "f817-4f10-91dd-cf9d",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "7003-283b-1b84-c602",
    "Name": "The Stars Are Right",
    "Type": "Faction",
    "Description": "Once per battle, at the start of the Fight phase, this model can use this ability. If it does, until the end of the phase, triple the Attacks and Strength characteristics of this model’s Staff of Tomorrow and every successful Wound roll made for this model’s attacks scores a Critical Wound."
  },
  {
    "Id": "b567-98ec-597b-f8c9",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ NECRON WARRIORS\nYou can attach this model to one of the above units even if one ROYAL WARDEN or NOBLE model has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths."
  },
  {
    "Id": "1a66-1b2-dfd6-b5b4",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "1ac3-6f6-b9a4-2496",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ LYCHGUARD\n■ NECRON WARRIORS"
  },
  {
    "Id": "2547-8479-5963-9153",
    "Name": "Grand Strategist",
    "Type": "Faction",
    "Description": "At the start of your Command phase, if this model is on the battlefield, you gain 1CP."
  },
  {
    "Id": "608f-b219-23b8-5568",
    "Name": "Lord of the Storm",
    "Type": "Faction",
    "Description": "Once per battle, at the end of your Command phase, this model can use this ability. If it does, roll one D6 for each enemy unit within 12\" of this model: on a 2-5, that enemy unit suffers D3 mortal wounds; on a 6, that enemy unit suffers D3+3 mortal wounds."
  },
  {
    "Id": "99f0-b4b4-4c25-a7a8",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS"
  },
  {
    "Id": "5ca8-661e-aaef-e4f0",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "6809-73fc-986d-8110",
    "Name": "Lord of the Pyrrhian Eternals",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a model in that unit makes an attack, add 1 to the Wound roll."
  },
  {
    "Id": "db0b-31e9-f3d7-bc67",
    "Name": "Mind in the Machine",
    "Type": "Faction",
    "Description": "At the start of your opponent’s Shooting phase, select one enemy VEHICLE unit within 12\" of and visible to this model. That unit must take a Leadership test. If that test is passed, until the end of the phase, each time a model in that unit makes an attack, subtract 1 from the Hit roll; if that test is failed, that unit is not eligible to shoot this phase."
  },
  {
    "Id": "6c1-e306-7422-f026",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ LYCHGUARD\n■ NECRON WARRIORS\nYou can attach this model to one of the above units even if NEMESOR ZAHNDREKH has already been attached to it. If it is, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths."
  },
  {
    "Id": "d6ff-586b-5829-295b",
    "Name": "Ghostwalk Mantle",
    "Type": "Faction",
    "Description": "While this model is leading a unit, models in that unit have the Fights First ability."
  },
  {
    "Id": "bcff-d655-2af7-c51a",
    "Name": "The Vargard’s Duty",
    "Type": "Faction",
    "Description": "While this model is in the same unit as NEMESOR ZAHNDREKH, CHARACTER models in that unit have the Feel No Pain 4+ ability."
  },
  {
    "Id": "f88e-2214-effd-21cb",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "9eba-43aa-5b0b-38e7",
    "Name": "Illuminor",
    "Type": "Faction",
    "Description": "While this model is within 3\" of one or more other friendly NECRONS units, this model has the Lone Operative ability."
  },
  {
    "Id": "42e3-ad7-3b46-8fa8",
    "Name": "Mechanical Augmentation (Aura)",
    "Type": "Faction",
    "Description": "While a friendly NECRONS BATTLELINE unit is within 3\" of this model, each time a model in that unit makes an attack, improve the Armour Penetration characteristic of that attack by 1, and each time an attack targets that unit, worsen the Armour Penetration characteristic of that attack by 1."
  },
  {
    "Id": "4164-8dc9-421-f281",
    "Name": "Atomic Energy Manipulator",
    "Type": "Faction",
    "Description": "At the end of the Fight phase, if this model destroyed one or more models this phase, until the end of the battle, add 3\" to the range of its Mechanical Augmentation ability (to a maximum of 12\")."
  },
  {
    "Id": "4998-fa4a-8055-e811",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ LYCHGUARD\n■ NECRON WARRIORS"
  },
  {
    "Id": "1dd5-d775-2e42-5051",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "62a8-d797-4bb6-c406",
    "Name": "Transient Madness",
    "Type": "Faction",
    "Description": "While this model is leading a unit, at the start of your Command phase, roll one D6: until the start of your next Command phase, weapons equipped by models in that unit gain the ability below that corresponds with that roll:\n■ 1-2: [SUSTAINED HITS 1]\n■ 3-4: [LETHAL HITS]\n■ 5-6: [DEVASTATING WOUNDS]"
  },
  {
    "Id": "42fd-7e9a-3a34-ab24",
    "Name": "Counter-tactics",
    "Type": "Faction",
    "Description": "Once per battle, after your opponent uses a Stratagem, if this model is on the battlefield, it can use this ability. If it does, until the end of the battle, the CP cost your opponent must pay to use that Stratagem again is increased by 1CP."
  },
  {
    "Id": "4c30-fc2d-b7f7-fed1",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ LYCHGUARD\n■ NECRON WARRIORS"
  },
  {
    "Id": "a75-b831-8fca-7904",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "2c95-7ec0-b887-a2ec",
    "Name": "Ancient Collector",
    "Type": "Faction",
    "Description": "While this model is leading a unit, at the end of your Command phase, if that unit is within range of an objective marker you control, that objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at start or end of any turn."
  },
  {
    "Id": "4bc-1a26-267-ad58",
    "Name": "Surrogate Hosts",
    "Type": "Faction",
    "Description": "At the start of your Command phase, if this model is on the battlefield, you can select one other friendly NECRONS INFANTRY CHARACTER model on the battlefield (excluding SKORPEKH LORD or EPIC HERO models). The selected model is destroyed (ignoring any rules that are triggered when a model is destroyed) and this model is put\nin its place, with all of its wounds remaining (if the selected model was leading a unit, this model now attaches to that unit as its Leader)."
  },
  {
    "Id": "5fcf-6a9e-f8d1-6d6f",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ NECRON WARRIORS"
  },
  {
    "Id": "9e6-fefc-3bb1-80ba",
    "Name": "Adaptive Strategy",
    "Type": "Faction",
    "Description": "This model's unit is eligible to shoot and declare a charge in a turn in which it Fell Back."
  },
  {
    "Id": "154b-abc2-af76-a8dc",
    "Name": "Engrammatic Logic",
    "Type": "Faction",
    "Description": "Once per battle, at the start of any phase, you can select one friendly NECRONS unit that is Battle-shocked and within 12\" of this model. That unit is no longer Battle-shocked."
  },
  {
    "Id": "5b79-8-18b5-51d0",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ SKORPEKH DESTROYERS"
  },
  {
    "Id": "34b3-af3e-2476-eaae",
    "Name": "United In Destruction",
    "Type": "Faction",
    "Description": "While this model is leading a unit, melee weapons equipped by models in that unit have the [LETHAL HITS] ability."
  },
  {
    "Id": "cf05-2e44-6e86-f2e3",
    "Name": "Crimson Harvest",
    "Type": "Faction",
    "Description": "Each time this model ends a Charge move, select one enemy unit within Engagement Range of this model and roll one D6: on a 2-5, that unit suffers D3 mortal wounds; on a 6, that unit suffers D3+3 mortal wounds."
  },
  {
    "Id": "fae1-b4ef-7e00-1eb8",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "e7ff-8e68-9766-247f",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ LOKHUST DESTROYERS\n■ LOKHUST HEAVY DESTROYERS"
  },
  {
    "Id": "d401-20b-8958-5aeb",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "9b1c-a931-479e-7222",
    "Name": "Destroyer Cult",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a model in that unit makes a ranged attack, a successful unmodifed Hit roll of 5+ scores a Critical Hit."
  },
  {
    "Id": "dab3-3e69-8bde-aed6",
    "Name": "Driven by Hatred",
    "Type": "Faction",
    "Description": "Each time this model makes an attack that targets an enemy unit that is Below Half-strength, you can re-roll the Hit roll and you can re-roll the Wound roll."
  },
  {
    "Id": "df4c-f512-dc01-b78a",
    "Name": "Nanoscarab amulet",
    "Type": "Faction",
    "Description": "The bearer has the Feel No Pain 5+ ability."
  },
  {
    "Id": "3999-26f9-630-9c4a",
    "Name": "Relentless March",
    "Type": "Faction",
    "Description": "While this model is leading a unit, add 1\" to the Move characteristic of models in that unit."
  },
  {
    "Id": "5ebc-3ae5-e0ea-b8ac",
    "Name": "The Lord’s Will",
    "Type": "Faction",
    "Description": "While this model is leading a unit, you can target that unit with Stratagems even when it is Battle-shocked."
  },
  {
    "Id": "2192-eee-9c40-fb31",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ LYCHGUARD\n■ NECRON WARRIORS"
  },
  {
    "Id": "c20d-dbc0-c38d-f255",
    "Name": "Resurrection orb",
    "Type": "Faction",
    "Description": "Once per battle, while the bearer is leading a unit, at the end of any phase, it can resurrect that unit if it is on the battlefield. When you do, that unit’s Reanimation Protocols are activated reanimating D6 wounds instead of D3 when doing so. You cannot resurrect more than one unit per turn."
  },
  {
    "Id": "ba3e-93f7-2a8d-6c14",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "23f9-a017-6911-33d3",
    "Name": "Carrier Wave (Aura)",
    "Type": "Faction",
    "Description": "While a friendly NECRONS unit is within 6\" of this model, add 1 to the Objective Control characteristic of models in that unit."
  },
  {
    "Id": "8024-526b-d055-1551",
    "Name": "Advanced Quantum Shielding",
    "Type": "Faction",
    "Description": "Each time an attack targets this model, if the Strength characteristic of that attack is greater than this model’s Toughness characteristic, subtract 1 from the Wound roll."
  },
  {
    "Id": "50db-a36b-f520-5afa",
    "Name": "Resurrection orb",
    "Type": "Faction",
    "Description": "Once per battle, at the end of any phase, select one friendly NECRONS INFANTRY or NECRONS MOUNTED unit with 6\" of the bearer and resurrect that unit. When you do, that unit’s Reanimation Protocols are activated reanimating D6 wounds instead of D3 when doing so. You cannot resurrect more than one unit per turn."
  },
  {
    "Id": "7eaa-f4a5-901d-2420",
    "Name": "Implacable Resilience",
    "Type": "Faction",
    "Description": "Each time an attack is allocated to this model, subtract 1 from that attack’s Damage characteristic."
  },
  {
    "Id": "70b4-8797-3592-64d",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "a39f-6d97-5dac-8f37",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ LYCHGUARD\n■ NECRON WARRIORS"
  },
  {
    "Id": "df30-5340-9681-8ed5",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ CANOPTEK WRAITHS\n■ IMMORTALS\n■ NECRON WARRIORS\nYou can attach this model to one of the above units even if one ROYAL WARDEN or NOBLE model has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths."
  },
  {
    "Id": "ff0b-8063-e5bc-1646",
    "Name": "Rites of Reanimation",
    "Type": "Faction",
    "Description": "While this model is leading a unit, models in that unit have the Feel No Pain 5+ ability."
  },
  {
    "Id": "760c-f4f5-c2b9-7ebc",
    "Name": "Technomancer",
    "Type": "Faction",
    "Description": "At the end of your Movement phase, select one friendly NECRONS model within 6\" of the bearer. That model regains up to D3 lost wounds. Each model can only be selected for this ability once per turn."
  },
  {
    "Id": "38bf-e8c8-1df1-1f0f",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ NECRON WARRIORS\nYou can attach this model to one of the above units even if one ROYAL WARDEN or NOBLE model has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths."
  },
  {
    "Id": "b1f0-60f5-c9a0-aeae",
    "Name": "Nightmare Shroud (Aura)",
    "Type": "Faction",
    "Description": "In the Battle-shock step of your opponent's Command phase, if an enemy unit that is below its Starting Strength is within 6\" of this model, that enemy unit must take a Battle-shock test, subtracting 1 from the roll when it does so."
  },
  {
    "Id": "88bf-1fe6-205b-272e",
    "Name": "Harbinger of Despair",
    "Type": "Faction",
    "Description": "Once per turn, at the start of your Command, Movement, Shooting, Charge or Fight phase, you can select one enemy unit within 18\" of this model. That unit must take a Battle-shock test, subtracting 1 from the roll when it does so."
  },
  {
    "Id": "62a7-3930-9c4b-1e98",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ NECRON WARRIORS\nYou can attach this model to one of the above units even if one ROYAL WARDEN or NOBLE model has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths."
  },
  {
    "Id": "5d95-fc94-f268-c2ac",
    "Name": "Timesplinter Mantle",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time an attack targets that unit, subtract 1 from the Hit roll."
  },
  {
    "Id": "eb1e-dd99-1745-54b2",
    "Name": "Chronometron",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model’s unit has shot, if it is not within Engagement Range of any enemy units, that unit can make a Normal move of up to 5\". If it does, until the end of the turn, that unit is not eligible to declare a charge."
  },
  {
    "Id": "d972-5e2-b478-f439",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "336-3705-cbf1-676a",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ NECRON WARRIORS\nYou can attach this model to one of the above units even if one ROYAL WARDEN or NOBLE model has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths."
  },
  {
    "Id": "b56-d882-46c2-f3f1",
    "Name": "Harbinger of Destruction",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a model in that unit makes a ranged attack, a successful unmodifed Hit roll of 5+ scores a Critical Hit."
  },
  {
    "Id": "b23c-448a-ac40-33f6",
    "Name": "Living Lightning",
    "Type": "Faction",
    "Description": "In your Shooting phase, select one enemy unit within 18\" of and visible to this model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of this model) and roll four D6: for each 4+, that enemy unit suffers 1 mortal wound."
  },
  {
    "Id": "a7f5-b25d-40f2-e927",
    "Name": "Their Number is Legion",
    "Type": "Faction",
    "Description": "Each time this unit’s Reanimation Protocols activate, you can re-roll the dice to see how many wounds are regenerated."
  },
  {
    "Id": "a1de-4afc-f922-ff9f",
    "Name": "Implacable Eradication",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes an attack, re-roll a Wound roll of 1. If the target of that attack is an enemy unit within range of an objective marker, you can re-roll the Wound roll instead."
  },
  {
    "Id": "20e1-eb82-bf57-db38",
    "Name": "Nanoscarab Reanimation Beam (Aura)",
    "Type": "Faction",
    "Description": "While a friendly NECRONS unit is within 3\" of this model, each time that unit’s Reanimation Protocols activate, that unit reanimates an additional D3 wounds."
  },
  {
    "Id": "3ba1-9027-f91a-8436",
    "Name": "Inescapable Death",
    "Type": "Faction",
    "Description": "Once per turn, one unit from your army with this ability can be targeted with the Fire Overwatch Stratagem for 0CP, even if you have already used that Stratagem on a different unit this phase. In addition, each time you target this unit with the Fire Overwatch Stratagem, while resolving that Stratagem, hits are scored on unmodified Hit rolls of 2+."
  },
  {
    "Id": "5fb0-75f-103d-6ab9",
    "Name": "Multi-threat Eliminator",
    "Type": "Faction",
    "Description": "Once per turn, in your opponent's Shooting phase, when an enemy unit makes a ranged attack that targets a friendly NECRONS unit within 3\" of a model with this ability, after that enemy has shot, one model with this ability that is within 3\" of that target can shoot as if it were your Shooting phase, but must target that enemy unit when doing so, and can only do so if that enemy unit is an eligible target."
  },
  {
    "Id": "3154-b43-deb7-ce47",
    "Name": "Dispersion Shield",
    "Type": "Faction",
    "Description": "The bearer has a 4+ invulnerable save."
  },
  {
    "Id": "e0c6-979e-6276-84d3",
    "Name": "Guardian Protocols",
    "Type": "Faction",
    "Description": "While a NOBLE model is leading this unit, each time an attack targets this unit, if the Strength characteristic of that attack is greater than the Toughness characteristic of this unit, subtract 1 from the Wound roll."
  },
  {
    "Id": "ae04-1c6f-bc7b-fe8",
    "Name": "Hyperspace Hunters",
    "Type": "Faction",
    "Description": "Once per turn, in the Reinforcements step of your opponent’s Movement phase, when an enemy unit is set up on the battlefield from Reserves within 18\" of and visible to this unit, this unit can shoot as if it were your Shooting phase, but must only target that enemy unit when doing so, and can only do so if that enemy unit is an eligible target."
  },
  {
    "Id": "bd6a-144a-e94-92ae",
    "Name": "Flesh Hunger",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes a melee attack, if the target of that attack is Below Half-strength, a successful Hit roll scores a Critical Hit."
  },
  {
    "Id": "fed9-4f4c-13cd-6663",
    "Name": "Bound Creation",
    "Type": "Faction",
    "Description": "While this unit is in the same unit as a CRYPTEK model, that CRYPTEK model has the Feel No Pain 4+ ability."
  },
  {
    "Id": "7d1b-80ba-7c17-e8a7",
    "Name": "Systematic Vigour",
    "Type": "Faction",
    "Description": "Each time a CRYPTOTHRALL model in this unit is destroyed by a melee attack, if that model has not fought this phase, roll one D6: on a 2+, do not remove it from play. The destroyed model can fight after the attacking model’s unit has finished making its attacks, and it is then removed from play."
  },
  {
    "Id": "af59-a206-8db4-f4eb",
    "Name": "Cryptek Retinue",
    "Type": "Faction",
    "Description": "At the start of the Declare Battle Formations step, this unit can join one other unit from your army that is being led by a CRYPTEK model (a unit cannot have more than one CRYPTOTHRALLS unit joined to it). If it does, until the end of the battle, every model in this unit counts as being part of that Bodyguard unit, and that  Bodyguard unit’s Starting Strength is increased accordingly."
  },
  {
    "Id": "ba2f-e69c-95b4-cc4d",
    "Name": "Whirling Onslaught",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes a melee attack, re-roll a Hit roll of 1. If this unit made a Charge move this turn, you can re-roll the Hit roll instead."
  },
  {
    "Id": "8228-4fe8-9a3b-fae6",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "7b32-dc36-258c-1b9c",
    "Name": "Targeting Relay",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, that unit cannot have the Benefit of Cover."
  },
  {
    "Id": "c14c-12b1-1df9-d9f",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "eb12-6f85-4791-9a9e",
    "Name": "Grand Illusion",
    "Type": "Faction",
    "Description": "If your army includes this model, after both players have deployed their armies, select up to three NECRONS units from your army and redeploy them. When doing so, any of those units can be placed in Strategic Reserves, regardless of how many units are already in Strategic Reserves."
  },
  {
    "Id": "7e93-58b3-238-f2e1",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "dfac-c392-eb70-34b8",
    "Name": "Drain Life",
    "Type": "Faction",
    "Description": "At the end of the Fight phase, roll one D6 for each enemy unit within 6\" of this model: on a 4+, that enemy unit suffers D3 mortal wounds."
  },
  {
    "Id": "efb8-d673-a67a-4c99",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "2d35-82e1-a1b4-850b",
    "Name": "Matter Absorption",
    "Type": "Faction",
    "Description": "At the start of your Shooting phase, select one enemy VEHICLE unit within 12\" of this model and roll one D6: on a 2+, that enemy unit suffers D3 mortal wounds and this model regains up to that many lost wounds."
  },
  {
    "Id": "4af5-1499-6342-9da3",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "e55c-f2ef-d3d0-a41a",
    "Name": "Transdimensional Displacement",
    "Type": "Faction",
    "Description": "Each time this model is selected to Advance, you can remove it from the battlefield and set it up again anywhere on the battlefield that is more than 9\" horizontally away from all enemy models."
  },
  {
    "Id": "e3b7-d666-dd22-7d60",
    "Name": "C'tan Shard",
    "Type": "Faction",
    "Description": "This model cannot be given Enhancements."
  },
  {
    "Id": "486c-f4fd-5ec1-38e3",
    "Name": "Fabricator Claw Array (Aura)",
    "Type": "Faction",
    "Description": "While a friendly NECRONS VEHICLE unit is within 6\" of the bearer, models in that unit have the Feel No Pain 6+ ability."
  },
  {
    "Id": "1dff-4e6e-f50a-4a18",
    "Name": "Canoptek Swarm",
    "Type": "Faction",
    "Description": "In your Command phase, select one friendly CANOPTEK SCARAB SWARM unit within 6\" of this unit. One destroyed model is returned to that CANOPTEK SCARAB SWARM unit for each SPYDER model in this unit."
  },
  {
    "Id": "cd1b-54d7-820c-cd0b",
    "Name": "Self-destruction",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, if this unit is within Engagement Range of one or more enemy units, you can select one model in this unit to destroy. If you do, select one enemy unit within Engagement Range of that model and roll one D6, adding 1 to the result if that unit is a VEHICLE. On a 2-5, that unit suffers D3 mortal wounds; on a 6+, that unit suffers 3 mortal wounds."
  },
  {
    "Id": "91c6-fc89-f3ab-c7e2",
    "Name": "Chittering Swarm",
    "Type": "Faction",
    "Description": "While an enemy unit is within Engagement Range of this unit, subtract 1 from the Objective Control  characteristic of models in that enemy unit (to a minimum of 1). While this unit is within 6\" of one or more friendly CRYPTEK models, the Objective Control characteristic of models in this unit is 1."
  },
  {
    "Id": "94fa-32fb-d0d5-fc8d",
    "Name": "Tunnelling Horrors",
    "Type": "Faction",
    "Description": "At the end of your opponent’s turn, if this unit is not within Engagement Range of one or more enemy units, you can remove this unit from the battlefield. In the Reinforcements step of your next Movement phase, set it up anywhere on the battlefield that is more than 9\" horizontally away from all enemy models."
  },
  {
    "Id": "890e-3ea5-7d83-e665",
    "Name": "Plasmacyte",
    "Type": "Faction",
    "Description": "Once per battle for each Plasmacyte this unit has, when this unit is selected to fight, you can use this ability. If you do, until the end of the phase, melee weapons equipped by models in this unit have the [DEVASTATING WOUNDS] ability."
  },
  {
    "Id": "6659-892-f296-90ef",
    "Name": "Evasion Engrams",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this unit has shot, it can make a Normal Move of up to 6\". If it does, until the end of the turn, this unit is not eligible to declare a charge."
  },
  {
    "Id": "3816-f555-728b-9a3b",
    "Name": "Shadowloom",
    "Type": "Faction",
    "Description": "The bearer has the Stealth ability."
  },
  {
    "Id": "32c-463b-ec70-ebc2",
    "Name": "Nebuloscope",
    "Type": "Faction",
    "Description": "Ranged weapons equipped by the bearer have the [IGNORES COVER] ability."
  },
  {
    "Id": "d6d-bb49-bf4c-d1d",
    "Name": "Shieldvanes",
    "Type": "Faction",
    "Description": "The bearer has a Save characteristic of 3+ and a Move characteristic of 8\"."
  },
  {
    "Id": "c070-2782-440f-5647",
    "Name": "Relentless Combatants",
    "Type": "Faction",
    "Description": "You can re-roll Charge rolls made for this unit, and this unit is eligible to declare a charge in a turn in which it Fell Back."
  },
  {
    "Id": "b3e0-9cd2-735c-91f1",
    "Name": "Wraith Form",
    "Type": "Faction",
    "Description": "Each time this unit ends a Normal move, you can select one enemy unit it moved over during that move and roll one D6 for each model in this unit: for each 4+, that enemy unit suffers 1 mortal wound."
  },
  {
    "Id": "a6dd-2eb2-3b5a-c6a4",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 4+ invulnerable save."
  },
  {
    "Id": "af48-1639-cfd1-b199",
    "Name": "Malevolent Arcing",
    "Type": "Faction",
    "Description": "In your Shooting phase, each time you select a target for this model’s twin tesla destructor, roll one D6 for the target unit and one D6 for every other enemy unit within 3\" of the target unit. On a 5+, the unit being rolled for is struck by arcing energies; after resolving all of this model’s attacks against the target unit, each unit struck by arcing energies suffers D3 mortal wounds."
  },
  {
    "Id": "2e32-4a45-813f-7e1d",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "3426-2c7f-e59e-354f",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "7237-d974-c99b-df40",
    "Name": "Damaged: 1-5 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "8e12-af7c-5f2c-50d5",
    "Name": "Overwhelming Obliteration",
    "Type": "Faction",
    "Description": "In your Movement phase, if this model Remains Stationary, until the end of the turn, its doomsday cannon has the [DEVASTATING WOUNDS] ability."
  },
  {
    "Id": "1c5f-64ca-b1cf-d514",
    "Name": "Hard-wired for Destruction",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes a ranged attack that targets the closest eligible enemy unit, re-roll a Hit roll of 1. If the target of that attack is within range of an objective marker your opponent controls, you can re-roll the Hit roll instead."
  },
  {
    "Id": "627-120b-3ae8-df3b",
    "Name": "Optimised for Slaughter",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes an attack with an enmitic exterminator that targets a unit (excluding MONSTERS and VEHICLES), re-roll a Wound roll of 1. Each time a model in this unit makes an attack with a gauss destructor against a MONSTER or VEHICLE unit, re-roll a Wound roll of 1."
  },
  {
    "Id": "79a5-8e09-eeae-e5b2",
    "Name": "Damaged: 1-4 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "7ed5-5030-b90e-4626",
    "Name": "Sentinel Construct",
    "Type": "Faction",
    "Description": "Each time you target this unit with the Fire Overwatch Stratagem, while resolving that Stratagem, hits are scored on unmodified Hit rolls of 5+."
  },
  {
    "Id": "827d-cdf3-3f28-3106",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "baa5-30ae-549d-3e5",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "76a2-8b8e-dc0a-889c",
    "Name": "Repair Barge",
    "Type": "Faction",
    "Description": "Once per turn, just after an enemy unit finishes making its attacks, if one or more friendly NECRON WARRIORS units within 3\" of this model lost one or more wounds as a result of those attacks, this model can use this ability. If it does, select one of those NECRON WARRIORS units; that unit’s Reanimation Protocols activate. The same NECRON WARRIORS unit cannot be selected for this ability more than once per turn."
  },
  {
    "Id": "7d3b-c221-6f25-e32a",
    "Name": "Invasion Beams",
    "Type": "Faction",
    "Description": "At the end of the Fight phase, if there are no models currently embarked within this TRANSPORT, you can select one friendly NECRONS INFANTRY unit wholly within 6\" of this TRANSPORT. Unless that unit is within Engagement Range of one or more enemy units, it can embark within this TRANSPORT."
  },
  {
    "Id": "3ee1-5d44-8794-827e",
    "Name": "Damaged: 1-4 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "1111-a91-fad5-a9ab",
    "Name": "Quantum Invader",
    "Type": "Faction",
    "Description": "This model can be set up in the Reinforcements step of your first, second or third Movement phase, regardless of any mission rules."
  },
  {
    "Id": "cbe7-5f04-88ae-4900",
    "Name": "Atavistic Instigation",
    "Type": "Faction",
    "Description": "Each time this model targets an enemy unit with its heavy death ray, your opponent must declare if that unit will stand firm or duck for cover:\n■ If it stands firm, when resolving attacks against that unit this phase, a successful unmodified Hit roll of 5+ scores a Critical Hit.\n■ If it ducks for cover, until the start of your next Shooting phase, each time a model in that unit makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "ec8b-fd4f-8fdc-7873",
    "Name": "Damaged: 1-4 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "2ec0-29f0-9fb3-dfc3",
    "Name": "Damaged: 1-8 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-8 wounds remaining, subtract 4 from its Objective Control characteristic and each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "4997-7da8-34d2-6efa",
    "Name": "Gravitic Pulse",
    "Type": "Faction",
    "Description": "At the start of your opponent’s Movement phase, you can select one enemy unit within 18\" of and visible to this model. Until the end of the turn, halve the Move characteristic of models in that unit and halve Advance and Charge rolls made for that unit. In addition, if that unit can FLY, until the start of your next Movement phase, roll one D6 each time that unit ends any type of move: on a 4+, that unit suffers D3 mortal wounds."
  },
  {
    "Id": "fb71-ce0a-b73c-cd9d",
    "Name": "Damaged: 1-8 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-8 wounds remaining, subtract 4 from its Objective Control characteristic and you can only select one of the C'tan Powers weapons in your Shooting phase, instead of two."
  },
  {
    "Id": "e526-90ef-5531-526f",
    "Name": "Powers of the C’tan",
    "Type": "Faction",
    "Description": "In your Shooting phase, when this model is selected to shoot, first select up to 2 different C’tan Powers weapons. Until the end of the phase, this model is equipped with those weapons in addition to its other weapons (this model cannot make attacks with any other C’tan Powers weapon you did not select in this way this phase)."
  },
  {
    "Id": "c2a6-f36c-8147-5971",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "6dd8-33d2-6527-401e",
    "Name": "Damaged: 1-7 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-7 wounds remaining, subtract 4 from its Objective Control characteristic and each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "35bb-28ec-497-5cff",
    "Name": "Eternity Gate",
    "Type": "Faction",
    "Description": "In the Reinforcements step of your Movement phase, you can select one NECRONS INFANTRY unit from your army that is either in Reserves or on the battlefield (if you select the latter, remove that unit from the battlefield and place it into Reserves). That unit is then set up anywhere on the battlefield that is wholly within 6\" of this model and not within Engagement Range of any enemy models. That unit cannot declare a charge this turn."
  },
  {
    "Id": "6bc2-17c8-cdd7-1505",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 4+ invulnerable save."
  },
  {
    "Id": "ba94-15fe-27b1-fe9",
    "Name": "Damaged: 1-6 wounds remaining",
    "Type": "Faction",
    "Description": "While this unit’s Szarekh model has 1-6 wounds remaining, halve the Attacks characteristic of that model’s weapons, and each time this unit makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "2be5-77b0-af86-2bd0",
    "Name": "Voice of the Triarch",
    "Type": "Faction",
    "Description": "At the start of the battle round, select one Triarch ability. Until the start of the next battle round, this unit has that ability."
  },
  {
    "Id": "a7b-b3f0-3fa3-85a",
    "Name": "The Silent King (Aura)",
    "Type": "Faction",
    "Description": "While a friendly NECRONS unit is within 6\" of this unit's Szarekh model, improve that unit's Leadership characteristic by 1."
  },
  {
    "Id": "426d-33c9-9649-f01e",
    "Name": "Triarchal Menhirs",
    "Type": "Faction",
    "Description": "If this unit’s Szarekh model is destroyed, all of this unit’s remaining Triarchal Menhir models are also destroyed."
  },
  {
    "Id": "e1-9726-a4fc-c9ae",
    "Name": "Reanimation Nodes (Aura)",
    "Type": "Faction",
    "Description": "While a friendly NECRONS INFANTRY unit is within 6” of this FORTIFICATION, models in that unit have the Feel No Pain 6+ ability."
  },
  {
    "Id": "e969-204a-7adb-7aa9",
    "Name": "Ancient Cover",
    "Type": "Faction",
    "Description": "Each time a ranged attack is allocated to a model, if that model is not fully visible to every model in the attacking unit because of this FORTIFICATION, that model has the Benefit of Cover against that attack."
  },
  {
    "Id": "729d-b06e-ad2b-f6ff",
    "Name": "Deployment",
    "Type": "Faction",
    "Description": "When this unit is first set up on the battlefield, its models do not have to be set up in Unit Coherency. Instead, each model must be set up wholly within 12\" of one other model from its unit. From that point on, each model in this unit is treated as a separate unit."
  },
  {
    "Id": "2374-9577-9f56-29e7",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "40eb-6985-aac6-1086",
    "Name": "Snaking Ambush",
    "Type": "Faction",
    "Description": "You can target this unit with the Heroic Intervention Stratagem for 0CP, and can do so even if you have already used that Stratagem on a different unit this phase."
  },
  {
    "Id": "832c-6bc6-82cb-22c3",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "9379-cb84-2ddf-7e47",
    "Name": "Aggressor Guardian",
    "Type": "Faction",
    "Description": "Each time an attack targets this model, if this model is within range of an objective marker, worsen the Armour Penetration characteristic of that attack by 1. In addition, each time this model makes an attack that targets a unit within range of an objective marker, improve the Armour Penetration characteristic of that attack by 1."
  },
  {
    "Id": "9320-4c37-14b9-d6e3",
    "Name": "Gloom Prism (Aura)",
    "Type": "Faction",
    "Description": "While a friendly NECRONS unit is within 6\" of the bearer, models in that unit have the Feel No Pain 5+ ability against mortal wounds and Psychic Attacks."
  },
  {
    "Id": "2e26-ee50-c66b-6b0e",
    "Name": "Damaged Armour",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this unit has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, each time a friendly NECRONS model makes an attack that targets that unit, on a Critical Wound, improve the Armour Penetration characteristic of that attack by 1."
  },
  {
    "Id": "9c7d-1793-8f4b-2dd4",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 4+ invulnerable save."
  },
  {
    "Id": "ab0a-e989-4fab-f66c",
    "Name": "Gravitational Field",
    "Type": "Faction",
    "Description": "Each time an enemy unit selects this model as the target of a charge, subtract 2 from the Charge roll (this is not cumulative with any other reductions to that Charge roll)."
  },
  {
    "Id": "ff7-5985-34db-4f48",
    "Name": "Terrifying Monstrosity",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, each enemy unit within Engagement Range of one or more units with this ability must take a Battle-shock test."
  },
  {
    "Id": "e496-2e4a-e286-ab98",
    "Name": "Damaged: 1-9 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-9 wounds remaining, subtract 5 from this model’s Objective Control characteristic and each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "45c-afd6-3d15-bf3e",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "a0a0-e859-3d2e-1921",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "c6d3-ff20-7a9f-7fa9",
    "Name": "Phase Shift Generator (Aura)",
    "Type": "Faction",
    "Description": "While a friendly NECRONS unit is within 3\" of this Fortification, models in that unit have a 5+ invulnerable save against ranged attacks."
  },
  {
    "Id": "d441-6f10-fc92-80f3",
    "Name": "Phase-shifted Cover",
    "Type": "Faction",
    "Description": "Each time a ranged attack is allocated to a model, if that model is not fully visible to every model in the attacking unit because of this Fortification, that model has the Benefit of Cover against that attack."
  },
  {
    "Id": "a375-dc94-e838-aa",
    "Name": "Damaged: 1-7 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-7 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "5646-8d87-8186-7872",
    "Name": "Teleportation Matrix",
    "Type": "Faction",
    "Description": "Once per battle, at the end of your opponent’s turn, if this FORTIFICATION is not within Engagement Range of one or more enemy units, you can remove it from the battlefield. In the Reinforcements step of your next Movement phase, set it up anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If the battle ends and this FORTIFICATION is not on the battlefield, it is destroyed."
  },
  {
    "Id": "d167-8f2e-101f-f228",
    "Name": "Phase-shifted Cover",
    "Type": "Faction",
    "Description": "Each time a ranged attack is allocated to a model, if that model is not fully visible to every model in the attacking unit because of this FORTIFICATION, that model has the Benefit of Cover against that attack."
  },
  {
    "Id": "5e4e-69ab-3c9e-f953",
    "Name": "Death Sphere Bombardment",
    "Type": "Faction",
    "Description": "Each time this model ends a Normal move, you can select one enemy unit it moved over during that move and roll six D6: for each 3+, that unit suffers 1 mortal wound."
  },
  {
    "Id": "fd7c-c09d-f836-c06a",
    "Name": "Damaged: 1-5 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "3131-c5e7-912d-7c9b",
    "Name": "Translocation Shroud",
    "Type": "Faction",
    "Description": "Each time this model's unit Advances, do not make an Advance roll for it. Instead, until the end of the phase, add 6\" to the Move characteristic of models in that unit. In addition, each time a model in that unit makes a Normal, Advance or Fall Back move, until that move is finished, it can move horizontally through models and terrain features (it cannot finish a move on top of another model or its base)."
  },
  {
    "Id": "70d5-9a58-6ff2-b4a3",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "28b0-a7ad-6aaa-8032",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ IMMORTALS\n■ LYCHGUARD\n■ NECRON WARRIORS"
  },
  {
    "Id": "6e01-88f9-87f0-d595",
    "Name": "Gloom Prism (Aura)",
    "Type": "Faction",
    "Description": "While a friendly NECRONS unit is within 6\" of the bearer, models in that unit have the Feel No Pain 4+ ability against Psychic Attacks."
  },
  {
    "Id": "61c9-1b37-b067-44ba",
    "Name": "Necrodermis",
    "Type": "Faction",
    "Description": "Description: Each time an attack is allocated to this model, halve the Damage characteristic of that attack."
  },
  {
    "Id": "3eeb-1140-c828-a4c5",
    "Name": "Enslaved Star God",
    "Type": "Faction",
    "Description": "Description: This model cannot be your WARLORD."
  },
  {
    "Id": "95f2-8c65-7342-354d",
    "Name": "My Will Be Done",
    "Type": "Faction",
    "Description": "Description: Once per battle round, one unit from your army with this ability can use it when its unit is targeted with a Stratagem. If it does, reduce the CP cost of that use of that Stratagem by 1CP."
  },
  {
    "Id": "20c2-d3b0-78a7-e025",
    "Name": "Command Master System Ability - Directive Override",
    "Type": "Faction",
    "Description": "Description: If you have access to this Master System ability, you can use it in one of the following ways:\n\n- Once per battle, at the start of your Command phase, you can use this ability. If you do, until the end of the phase, you can re-roll Battle-shock tests taken for **^^Necrons^^** units from your Crusade army.\n***OR***\n- Once per battle, at the start of your Command phase, you can use this ability. If you do, until the end of the phase, add 1 to the Objective Control characteristic of **^^Necrons^^** units from your Crusade army."
  },
  {
    "Id": "ae48-c326-c13c-8442",
    "Name": "Reanimation Master System Ability - Contra-mortis Protocol",
    "Type": "Faction",
    "Description": "Description: If you have access to this Master System ability, you can use it in one of the following ways:\n\n- Once per battle, when a **^^Necrons^^** unit uses its Reanimation Protocols ability, you can use this ability. If you do, that **^^Necrons^^** unit can immediately use its Reanimation Protocols ability a second time.\n***OR***\n- Once per battle, at the start of your Command phase, you can use this ability. If you do, until the end of the phase, each time a **^^Necrons^^** unit from your Crusade army uses its Reanimation Protocols ability, add 1 to the result."
  },
  {
    "Id": "90f4-f767-7647-b9cc",
    "Name": "Translocation Master System Ability - Special Relocation",
    "Type": "Faction",
    "Description": "Description: If you have access to this Master System ability, you can use it in one of the following ways:\n\n- Once per battle, at the end of your Movement phase, select one **^^Necrons^^** units from your Crusade army and remove it from the battlefield and place it into Reserves. You can select another **^^Necrons Infantry^^** unit from your Crusade army that is in Reserves and set it up as close as possible to where the previous unit was and not within Engagement Range of any enemy units. Until the end of the battle, the unit placed into Reserves has the Deep Strike ability if it did not already have it..\n***OR***\n- Once per battle, after both players have deployed their armies and determined who has the first turn, you can select up to three **^^Necrons Infantry^^** units from your Crusade army and redeploy all of those units. When doing so, any of those units can be placed into Strategic Reserves, regardless of how many units are already in Strategic Reserves."
  },
  {
    "Id": "a511-d9ca-17d0-42c5",
    "Name": "Reanimation Protocols",
    "Type": "Faction",
    "Description": "If your Army Faction is NECRONS, at the end of your Command phase, each unit from your army with this ability that is on the battlefield activates its Reanimation Protocols and reanimates D3 wounds. Each time such a unit reanimates a wound:\n■ If that unit contains one or more models with fewer than their starting number of wounds remaining, select one of those models; that model regains one lost wound.\n■ If all models in that unit have their starting number of wounds, but that unit is not at its Starting Strength, one destroyed model is returned to that unit with one wound remaining.\nOnce such a unit is at its Starting Strength and all of its models have their starting number of wounds, nothing further happens."
  },
  {
    "Id": "cb2f-c68b-f66e-93ae",
    "Name": "Annihilation Protocol",
    "Type": "Faction",
    "Description": "Each time a DESTROYER CULT or FLAYED ONES unit from your army declares a charge, you can re-roll the Charge roll. If one or more targets of that charge are Below Half-strength, add 1 to the charge roll as well.\nEach time a DESTROYER CULT unit from your army makes a ranged attack that targets the closest eligible target, add 1 to the Armour Penetration characteristic of that attack."
  },
  {
    "Id": "388f-814a-df25-c988",
    "Name": "Command Protocols",
    "Type": "Faction",
    "Description": "While a NECRONS CHARACTER model is leading this unit, each time a model in this unit makes an attack, add 1 to the Hit roll."
  },
  {
    "Id": "bf08-bb20-d69d-1063",
    "Name": "Hyperphasing",
    "Type": "Faction",
    "Description": "At the end of your opponent's turn, you can select a number of NECRONS units from your army (excluding units that are within Engagement Range of one or more enemy units). The maximum number of units you can select depends on the battle size, as follows:\nIncursion - Up to 1 unit.\nStrike Force - Up to 2 units\nOnslaught - Up to 3 units\nOnce you have made your selection, remove those units from the battlefield and place them into Strategic Reserves."
  },
  {
    "Id": "5aff-abb1-f06d-23a5",
    "Name": "Power Matrix",
    "Type": "Faction",
    "Description": "Certain areas of the battlefield are considered to be within your army's Power Matrix, as follows:\n- Your deployment zone is always within your army's Power Matrix.\n- At the start of any phase, if you control at least half of the objective markers within No Man's Land, until the end of that phase, No Man's Land is within your army's Power Matrix.\n- At the start of any phase, if you control at least half of the objective markers within your opponent's deployment zone, until the end of that phase, your opponent's deployment zone is within your army's Power Matrix.\nEach time a model in a CRYPTEK or CANOPTEK unit from your army makes an attack, re-roll a Hit roll of 1. If such a unit is wholly within your Power Matrix, you can re-roll the Hit roll instead."
  },
  {
    "Id": "a0f8-2836-4418-50a4",
    "Name": "Worthy Foes",
    "Type": "Faction",
    "Description": "In your Command phase, select one enemy unit. Until the start of your next Command phase, each time an NOBLE, LYCHGUARD or TRIARCH unit from your army makes an attack against that unit, add 1 to the Wound roll."
  },
  {
    "Id": "1dfc-5377-99ac-a700",
    "Name": "Relentless Onslaught",
    "Type": "Faction",
    "Description": "Each time a NECRONS model from your army makes an attack that targets a unit within range of one or more objective markers, add 1 to the Hit roll. In addition, ranged weapons equipped by NECRONS VEHICLE and NECRONS MOUNTED models (excluding TITANIC models) from your army have the [ASSAULT] ability."
  },
  {
    "Id": "fee7-90a8-24a2-79ef",
    "Name": "Paroxysm (Psychic)",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, you can select one enemy unit within 12\" of and visible to this model and roll one D6: on a 1, this Psyker suffers D3 mortal wounds; on a 2+, until the end of the phase, subtract 1 from the Attacks characteristic of weapons equipped by models in that unit."
  },
  {
    "Id": "c13f-316a-bbdf-74fd",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following unit:\n- TYRANT GUARD"
  },
  {
    "Id": "d038-2f3d-1c4a-a15",
    "Name": "Onslaught (Aura, Psychic)",
    "Type": "Faction",
    "Description": "While a friendly TYRANIDS unit is within 6\" of this model, ranged weapons equipped by models in that unit have the [ASSAULT] and [LETHAL HITS] abilities."
  },
  {
    "Id": "3ae7-6f89-23de-3cca",
    "Name": "Spawn Termagants",
    "Type": "Faction",
    "Description": "In your Command phase, you can select one friendly TERMAGANTS unit within 6\" of this model and return up to D3+3 destroyed TERMAGANT models to that unit. A TERMAGANTS unit cannot be selected for this ability more than once per phase."
  },
  {
    "Id": "7697-fdc6-4658-3f1c",
    "Name": "Brood Progenitor (Aura, Psychic)",
    "Type": "Faction",
    "Description": "While a friendly TERMAGANTS unit is within 6\" of this model, ranged weapons equipped by models in that unit have the [LETHAL HITS] ability."
  },
  {
    "Id": "ba65-9542-51dd-8200",
    "Name": "Hive Commander",
    "Type": "Faction",
    "Description": "At the start of your Command phase, if this model is on the battlefield, you gain 1CP"
  },
  {
    "Id": "4b18-f7de-620b-3b73",
    "Name": "Malign Presence (Aura)",
    "Type": "Faction",
    "Description": "If this model is your Warlord, each time your opponent targets a unit from their army with a Stratagem, if that unit is within 12\" of this model, increase the cost of that use of that Stratagem by 1CP."
  },
  {
    "Id": "b3b4-4208-4997-9506",
    "Name": "Domination of the Hive Mind (Aura)",
    "Type": "Faction",
    "Description": "While a friendly TYRANIDS unit is within 9\" of this model, that unit is within your army’s Synapse Range."
  },
  {
    "Id": "99ef-a339-35c2-ec3",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following unit:\n■ TYRANT GUARD"
  },
  {
    "Id": "a5e1-ca7f-aaef-7fda",
    "Name": "Vicious Insight",
    "Type": "Faction",
    "Description": "While this model is leading a unit, weapons equipped by models in that unit have the [DEVASTATING WOUNDS] ability."
  },
  {
    "Id": "75d5-d9e0-5f01-60bf",
    "Name": "Hypnotic Gaze (Psychic)",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, select one enemy unit within Engagement Range of this model. Until the end of the phase, each time a model in that unit makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "78d5-4fce-3f26-7817",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following unit:\n- GENESTEALERS"
  },
  {
    "Id": "a4ec-5941-e494-6ed0",
    "Name": "Alpha Warrior",
    "Type": "Faction",
    "Description": "While this model is leading a unit, weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability."
  },
  {
    "Id": "5689-b058-225b-88d9",
    "Name": "Death Blow",
    "Type": "Faction",
    "Description": "If this model is destroyed by a melee attack, if it has not fought this phase, roll one D6: on a 4+, do not remove it from play. The destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play."
  },
  {
    "Id": "bdac-5b09-9843-5aed",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n- GARGOYLES\n- TYRANID WARRIORS WITH MELEE BIO-WEAPONS\n- TYRANID WARRIORS WITH RANGED BIO-WEAPONS"
  },
  {
    "Id": "3125-a7a9-2716-8a9f",
    "Name": "Alpha Leader",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a model in that unit makes an attack, you can re-roll the Hit roll."
  },
  {
    "Id": "2c91-cffe-25ce-bd74",
    "Name": "Unstoppable Monster",
    "Type": "Faction",
    "Description": "At the start of each player’s Command phase, this model regains up to D3 lost wounds."
  },
  {
    "Id": "e546-54e1-550a-a1d9",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following unit:\n- CARNIFEXES"
  },
  {
    "Id": "334d-297-9ce7-a555",
    "Name": "Adaptable Predators",
    "Type": "Faction",
    "Description": "This unit is eligible to shoot and declare a charge in a turn in which it Fell Back."
  },
  {
    "Id": "1be5-8ccf-3d43-2b32",
    "Name": "Adaptive Instincts",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, select one of the following:\n- Aggression Imperative: Until the end of the phase, each time a model in this unit makes a melee attack, re-roll a Hit roll of 1.\n- Bioregeneration: Until the end of the phase, each time a saving throw if made for a model in this unit, re-roll a saving throw of 1."
  },
  {
    "Id": "c28c-89a4-5758-10b7",
    "Name": "Skulking Horrors",
    "Type": "Faction",
    "Description": "Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9\" of this unit, if this unit is not within Engagement Range of one or more enemy units, it can make a Normal move of up to D6\"."
  },
  {
    "Id": "4b14-20d3-145b-5ff8",
    "Name": "Bounding Leap",
    "Type": "Faction",
    "Description": "This unit is eligible to declare a charge in a turn in which it Advanced."
  },
  {
    "Id": "c1f2-5d1a-e044-fba8",
    "Name": "Winged Swarm",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this unit has shot, if it is not within Engagement Range of any enemy units, it can make a Normal move of up to 6\". If it does, until the end of the turn, this unit is not eligible to declare a charge."
  },
  {
    "Id": "097a-e5ac-6ab9-4d1d",
    "Name": "Grasping Tendrils",
    "Type": "Faction",
    "Description": "Each time an enemy unit (excluding Titanic units) within Engagement Range of one or more units from your army with this ability is selected to Fall Back, you can roll one D6: on a 3+, that enemy unit must Remain Stationary instead."
  },
  {
    "Id": "a599-0bf5-3022-ecc6",
    "Name": "Hypertoxic Miasma (Aura)",
    "Type": "Faction",
    "Description": "At the end of your Movement phase, roll one D6 for each enemy unit within 6\" of this model: on a 2-3, that unit suffers 1 mortal wound; on a 4-5, that unit suffers D3 mortal wounds; on a 6, that unit suffers D6 mortal wounds."
  },
  {
    "Id": "f47f-6b2a-77db-863e",
    "Name": "Guardian Organism",
    "Type": "Faction",
    "Description": "While a CHARACTER model is leading this unit, that Character has the Feel No Pain 5+ ability"
  },
  {
    "Id": "3431-c2fc-bb66-b5f3",
    "Name": "Node Lash (Psychic)",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a model in that unit makes an attack, add 1 to the Hit roll. If the target is Battle-shocked, add 1 to the Wound roll as well."
  },
  {
    "Id": "0f27-7f4d-4bd3-43f1",
    "Name": "Psychic Terror (Psychic)",
    "Type": "Faction",
    "Description": "If one or more Neurotyrants from your army are on the battlefield when you unleash the Shadow in the Warp, subtract 1 from the Battle-shock test each enemy unit on the battlefield must take as a result."
  },
  {
    "Id": "808e-ed23-9487-8b66",
    "Name": "Synaptic Relays",
    "Type": "Faction",
    "Description": "In your Command phase, you can select up to two friendly Tyranids units within 18\" of this model’s unit. Until the start of your next Command phase, the selected units are always considered to be within Synapse Range of your army."
  },
  {
    "Id": "f6b2-d409-9b06-a66b",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n- NEUROGAUNT\n- TYRANT GUARD\n- ZOANTHROPES"
  },
  {
    "Id": "5e16-936-6e44-955c",
    "Name": "Pheromone Trail",
    "Type": "Faction",
    "Description": "Once per battle round, you can target one model with this ability with the Rapid Ingress Stratagem for 0CP."
  },
  {
    "Id": "5bd7-b7c-42a4-3055",
    "Name": "Fear of the Unseen (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit is within 6\" of this model, worsen the Leadership characteristic of models in that unit by 1. In addition, in the Battle-shock step of your opponent’s Command phase, if such an enemy unit is below its Starting Strength, it must take a Battle-shock test."
  },
  {
    "Id": "e3fa-da84-9809-3099",
    "Name": "Hunter Organism",
    "Type": "Faction",
    "Description": "This model cannot be your Warlord"
  },
  {
    "Id": "a372-8f4-cc33-ec1c",
    "Name": "Encephalic Diffusion (Aura, Psychic)",
    "Type": "Faction",
    "Description": "While an enemy unit is within 6\" of this model, each time a model in that unit makes an attack, subtract 1 from the Hit roll, and, if that enemy unit is Below Half-strength, subtract 1 from the Wound roll as well."
  },
  {
    "Id": "f6a1-151a-9d0d-37d2",
    "Name": "Burning Spray",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this unit has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, that enemy unit cannot have the Benefit of Cover."
  },
  {
    "Id": "bad8-3f0b-a255-140",
    "Name": "Grisly Spectacle",
    "Type": "Faction",
    "Description": "Each time this model is selected to fight, after resolving its attacks, if one or more enemy units were destroyed by those attacks, each enemy unit within 6\" of this model must take a Battle-shock test."
  },
  {
    "Id": "a29d-56f5-8a83-57d0",
    "Name": "Foul Spores (Aura)",
    "Type": "Faction",
    "Description": "While a friendly TYRANIDS unit is within 6\" of this unit, each time a ranged attack targets that unit, models in that unit have the Benefit of Cover against that attack. In addition, while a friendly TYRANIDS unit (excluding MONSTERS) is within 6\" of this unit, models in that unit have the Stealth ability"
  },
  {
    "Id": "8fab-3b8c-1342-cfed",
    "Name": "Pouncing Leap",
    "Type": "Faction",
    "Description": "You can target this unit with the Heroic Intervention Stratagem for 0CP, and can do so even if you have already used that Stratagem on a different unit this phase."
  },
  {
    "Id": "3a53-28b0-3c8e-6108",
    "Name": "Neurocytes",
    "Type": "Faction",
    "Description": "While this unit is within Synapse Range of your army, it has the SYNAPSE keyword."
  },
  {
    "Id": "36f5-a5b7-9e6-9f40",
    "Name": "Spirit Leech (Aura, Psychic)",
    "Type": "Faction",
    "Description": "While an enemy unit is within 6\" of this unit, if it contains a Neurothrope, each time that enemy unit fails a Battle-shock test, it suffers D3 mortal wounds and one model in this unit regains up to D3 lost wounds."
  },
  {
    "Id": "6356-2345-a0cf-9555",
    "Name": "Warp Field (Aura, Psychic)",
    "Type": "Faction",
    "Description": "While a friendly TYRANIDS unit is within 6\" of this unit, models in that unit have a 6+ invulnerable save."
  },
  {
    "Id": "533-9226-7e51-ee0",
    "Name": "Chitinous Horrors (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit is within Engagement Range of this unit, halve the Objective Control characteristic of models in that enemy unit."
  },
  {
    "Id": "e63a-3205-566f-57d8",
    "Name": "Parasitic Infection",
    "Type": "Faction",
    "Description": "Each time an INFANTRY model is destroyed by an attack made with this model’s barbed ovipositor, after this model has finished making its attacks, you can add one new RIPPER SWARMS unit to your army consisting of D3 models and set it up within 3\" of this model. If you do, that RIPPER SWARMS unit can be set up within Engagement Range of the destroyed model’s unit (but not within Engagement Range of any other enemy units)."
  },
  {
    "Id": "738b-7257-a0b0-6cda",
    "Name": "It Itches!",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, select one enemy unit within Engagement Range of this model. That enemy unit must take a Battle-shock test."
  },
  {
    "Id": "5b71-bc6f-68c5-a06a",
    "Name": "Terror from the Deep",
    "Type": "Faction",
    "Description": "Each time this unit is set up on the battlefield using the Deep Strike ability, roll one D6 for each enemy unit within 12\" of this model: on a 2-4, that unit suffers D3 mortal wounds; on a 5+, that unit suffers 3 mortal wounds and must take a Battle-shock test."
  },
  {
    "Id": "ca9b-8e0-47fa-32ed",
    "Name": "Subterranean Tunnels",
    "Type": "Faction",
    "Description": "In your Movement phase, when this model is set up on the battlefield using the Deep Strike ability, it can use a subterranean tunnel. If it does, this model can be set up anywhere on the battlefield that is more than 6\" horizontally away from all enemy units, but until the end of the turn, it is not eligible to declare a charge."
  },
  {
    "Id": "6050-289d-eb2b-989a",
    "Name": "Floating Death",
    "Type": "Faction",
    "Description": "Each time this unit or an enemy unit ends a move, for each model in this unit that is within 3\" of one or more enemy units, select one of those enemy units. That model in this unit is destroyed, then roll one D6: on a 2-5, that enemy unit suffers 1 mortal wound; on a 6, that enemy unit suffers D3 mortal wounds."
  },
  {
    "Id": "e00d-271e-a667-e79f",
    "Name": "Symbiotic Targeting",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, each time a friendly TYRANIDS model makes an attack that targets that unit, re-roll a Hit roll of 1."
  },
  {
    "Id": "487e-7acf-a416-11a0",
    "Name": "Seed Spore Mines",
    "Type": "Faction",
    "Description": "Once per turn, in your Shooting Phase, when selected to shoot, one unit with this ability can use it instead of making any attacks with its ranged weapons. If it does, you can add one new SPORE MINES unit to your army and set it up anywhere on the battlefield that is wholly within 48\" of this unit and more than 9\" horizontally away from all enemy units. That SPORE MINES unit contains 1 model for each model in this unit."
  },
  {
    "Id": "c938-60e9-2b21-17fb",
    "Name": "Blistering Assault",
    "Type": "Faction",
    "Description": "Each time an enemy unit is selected to shoot, after that unit has shot, if any models from this unit lost one or more wounds as a result of those attacks, this unit can make a Blistering Assault move. If it does, roll one D6, adding 2 to the result: each model in this unit can be moved a distance in inches up to the result, but this unit must finish that move as close as possible to the closest enemy unit. When doing so, those models can be moved within Engagement Range of that enemy unit. Each unit can only make one Blistering Assault move per phase."
  },
  {
    "Id": "9989-4ee6-2244-2805",
    "Name": "Death Scream",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one unit hit by one or more of those attacks. That unit must take a Battle-shock test, subtracting 1 from that test."
  },
  {
    "Id": "a0c-34d4-cdc0-6e62",
    "Name": "Defensive Stance",
    "Type": "Faction",
    "Description": "Each time you target this unit with the Fire Overwatch Stratagem, while resolving that Stratagem, hits are scored on unmodified Hit rolls of 5+, or unmodified Hit rolls of 4+ instead if this unit is within range of an objective marker that you control."
  },
  {
    "Id": "9a87-bb69-19da-2528",
    "Name": "Resilient Organism",
    "Type": "Faction",
    "Description": "Once per battle, when an attack is allocated to this model, you can change the Damage characteristic of that attack to 0."
  },
  {
    "Id": "ceb3-c557-c854-8883",
    "Name": "Aerial Seeding",
    "Type": "Faction",
    "Description": "This model must start the battle in Reserves, but neither it nor any units embarked within it are counted towards any limits placed on the maximum number of Reserves units you can start the battle with. This model can be set up in the Reinforcements step of your first, second or third Movement phase, regardless of any mission rules. Any units embarked within this model must immediately disembark after it has been set up on the battlefield, and they must be set up more than 9\" away from all enemy models. After this model has been set up on the battlefield, no units can embark within it."
  },
  {
    "Id": "aaf-ca1a-79f3-94c3",
    "Name": "Airborne Predator",
    "Type": "Faction",
    "Description": "Each time this model makes a ranged attack that targets a unit that can FLY, add 1 to the Hit roll."
  },
  {
    "Id": "ad40-62a4-c6ff-6036",
    "Name": "Spore Mine Cysts",
    "Type": "Faction",
    "Description": "Each time this model ends a Normal move, you can do one of the following:\n- Select one enemy unit it moved over during that move and roll six D6: for each 3+, that unit suffers 1 mortal wound.\n- Add a new SPORE MINES unit containing D3 models to your army and set it up anywhere on the battlefield that is within 6\" of this model and more than 9\" horizontally away from all enemy units. You cannot select this option for more than one model per turn."
  },
  {
    "Id": "1fbb-7493-b68-98a3",
    "Name": "Seed Mucolids",
    "Type": "Faction",
    "Description": "Once per turn, in your shooting phase, when selected to shoot, one unit with this ability can use it instead of making any attacks with it's ranged weapons. If it does, you can add one new MUCOLID SPORES containing 1 model to your army and set it up anywhere on the battlefield that is wholly within 18\" of this model and more than 9\" horizontally away from all enemy units."
  },
  {
    "Id": "d8c3-9917-c6c8-7b77",
    "Name": "Hive Defences",
    "Type": "Faction",
    "Description": "You can target this model with the Fire Overwatch stratagem for 0CP, and can do so even if you have already targeted a different unit with that stratagem this turn. This model can only be targeted with that Stratagem once per turn"
  },
  {
    "Id": "5171-dc2c-e7b0-2d4",
    "Name": "Bio-stimulus",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the turn, each time a friendly **^^Tyranids^^** unit makes a melee attack that targets that enemy unit, improve the Armour Penetration characteristic of that attack by 1. The same enemy unit can only be affected by this ability once per turn."
  },
  {
    "Id": "34b3-35ff-995a-560d",
    "Name": "Feeding Frenzy",
    "Type": "Faction",
    "Description": "Each time this model makes a melee attack that targets a unit that is below its Starting Strength, add 1 to the Hit roll. If that target is also Below Half strength, add 1 to the Wound roll as well."
  },
  {
    "Id": "1c11-4ca1-8dae-1971",
    "Name": "Disruption Bombardment",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this unit has shot, select one enemy INFANTRY unit hit by one or more of those attacks. Until the end of your opponent’s next turn, that enemy unit is disrupted. While a unit is disrupted, subtract 2 from its Move characteristic, and subtract 2 from Advance and Charge rolls made for it."
  },
  {
    "Id": "a1bc-d961-dde5-52c4",
    "Name": "Overgrown Barbs",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy unit (excluding Titanic units) that was hit by one or more of those attacks. Until the start of your next turn, while this model is on the battlefield, that enemy unit is suppressed. While a unit is suppressed, each time a model in that unit makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "4510-7130-a4d1-7da2",
    "Name": "Irresistible Force",
    "Type": "Faction",
    "Description": "This model is eligible to declare a charge in a turn in which it Fell Back."
  },
  {
    "Id": "6db6-76da-f8c0-7bfb",
    "Name": "Damaged: 1-10 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-10 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "ffbc-add5-8823-38f1",
    "Name": "Frenzied Metabolism",
    "Type": "Faction",
    "Description": "Each time this model is selected to shoot, you can use this ability. If you do, until the end of the phase, each time this model makes an attack, add 1 to the Wound roll. After resolving those attacks, roll one D6: on a 2+, this model suffers D3 mortal wounds."
  },
  {
    "Id": "e1fc-f768-9ec6-be50",
    "Name": "Damaged: 1-10 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-10 wounds remaining, subtract 6 from this model’s Objective Control characteristic and each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "cda-47a4-2046-4c2c",
    "Name": "Apex-beast",
    "Type": "Faction",
    "Description": "Each time this model makes an attack that targets a unit that is Battle-shocked, add 1 to the Hit roll."
  },
  {
    "Id": "9746-a65-6ca-1ead",
    "Name": "Stalking Forward",
    "Type": "Faction",
    "Description": "Each time this model makes a Normal, Advance or Fall Back move, it can move over models (excluding TITANIC models) and terrain features that are 4\" or less in height as if they were not there."
  },
  {
    "Id": "96f0-f77f-527d-7554",
    "Name": "Vanguard Predator",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes an attack, re-roll a Hit roll of 1. If the target is within range of one or more objective markers, re-roll a Wound roll 1 as well."
  },
  {
    "Id": "e078-a1cc-7896-7443",
    "Name": "Death From Below",
    "Type": "Faction",
    "Description": "At the end of your opponent’s turn, if this unit is not within Engagement Range of one or more enemy units, you can remove it from the battlefield and place it into Strategic Reserves."
  },
  {
    "Id": "a205-6bf5-658a-a9c6",
    "Name": "Digestion Spine",
    "Type": "Faction",
    "Description": "Each time this model fights, after it has resolved its attacks, if one or more enemy models (excluding Vehicle models) were destroyed as the result of those attacks, this model regains up to D3 mortal wounds."
  },
  {
    "Id": "b9cf-6189-5e16-a81a",
    "Name": "Chitinous Horrors",
    "Type": "Faction",
    "Description": "While an enemy unit is within Engagement Range of one or more units with this ability, halve the Objective Control characteristic of models in that enemy unit."
  },
  {
    "Id": "31d0-c053-ceb2-e8eb",
    "Name": "Enhanced Toxic Miasma",
    "Type": "Faction",
    "Description": "While this model is leading a unit, the range of that unit's Foul Spores Aura ability is increased to 9\"."
  },
  {
    "Id": "b3e2-5880-7bec-cc20",
    "Name": "Prey Adaptation",
    "Type": "Faction",
    "Description": "Each time this model's unit is selected to fight, select one of the following abilities to apply to all melee weapons equipped by models in that unit until the end of the phase:\n- **[SUSTAINED HITS 1]**\n- **[LANCE]**\n- **[LETHAL HITS]**"
  },
  {
    "Id": "4f4b-61cc-6bb1-1c97",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following unit: \n- **^^Venomthropes^^**"
  },
  {
    "Id": "d06d-869e-b2-ff95",
    "Name": "Feeder Tendrils",
    "Type": "Faction",
    "Description": "Each time this model destroys an enemy CHARACTER model, you gain 1CP"
  },
  {
    "Id": "e348-1799-4ccc-f1e3",
    "Name": "Neural Disruption",
    "Type": "Faction",
    "Description": "In your Command phase, select one enemy unit within 12\" of this model. That unit must take a Battle-shock test"
  },
  {
    "Id": "f420-4c72-dafd-6998",
    "Name": "Psychological Saboteur (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit is with 12\" of this model, if that unit is Battle-shocked:\n\n- Each time a model in that unit makes an attack, subtract 1 from the Hit roll\n- Each time a friendly TYRANIDS model makes an attack that targets that unit, add 1 to the Wound roll."
  },
  {
    "Id": "b8e7-5d35-cbdb-fc5f",
    "Name": "Singular Purpose",
    "Type": "Faction",
    "Description": "At the start of the First battle round, select one of the following: \n\n- Select one enemy unit. Until the end of the battle, each time this model makes an attack that targets that unit you can re-roll the Hit roll and you can re-roll the Wound roll\n\n\n-Select one objective marker. Until the end of the battle, while this model is within range of that objective marker, it has the Feel No Pain 5+ ability and an Objective Control characteristic of 15."
  },
  {
    "Id": "5808-f5eb-b2d5-65d7",
    "Name": "Harpoon Barbs",
    "Type": "Faction",
    "Description": "Once per turn, when an enemy unit within Engagement Range of this unit is chosen to Fall Back, roll one D6; on a 2+, that unit suffers D6 mortal wounds."
  },
  {
    "Id": "286e-4c57-b171-2344",
    "Name": "Singular Purpose",
    "Type": "Faction",
    "Description": "At the start of the first battle round, select one of the following: \n\n- Select one enemy unit. Until the end of the battle, each time this model makes an attack that targets that unit you can re-roll the Hit roll and you can re-roll the Wound roll\n\n-Select one objective marker. Until the end of the battle, while this model is within range of that objective marker, it has the Feel No Pain 5+ ability and an Objective Control characteristic of 15."
  },
  {
    "Id": "365e-a0cc-81f6-c188",
    "Name": "Unnatural Resistance",
    "Type": "Faction",
    "Description": "This model has the Feel No Pain 4+ ability against Mortal Wounds."
  },
  {
    "Id": "1d40-48ae-593b-19fb",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This unit can be attached to the following units: **^^Raveners^^**"
  },
  {
    "Id": "5021-8bf2-f214-c0ad",
    "Name": "Alpha Invader",
    "Type": "Faction",
    "Description": "Weapons equipped by models in this unit have the **[SUSTAINED HITS 1]** ability."
  },
  {
    "Id": "c630-ebc4-f48c-6eba",
    "Name": "Hypersensory Array",
    "Type": "Faction",
    "Description": "Once per battle round, you can target this unit with the Rapid Ingress or Heroic Intervention Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this turn."
  },
  {
    "Id": "cbd6-8e0f-412a-b9c8",
    "Name": "Hyper Adaptions",
    "Type": "Faction",
    "Description": "At the start of the first battle round, select one of the following Hyper-adaptations to be active for Tyranids units from your army until the end of the battle:\n\nSWARMING INSTINCTS\nEach time a Tyranids model with this Hyper-adaptation makes an attack that targets an enemy Infantry or Swarm unit, that attack has the [SUSTAINED HITS 1] ability.\n\n\nHYPER-AGGRESSION \nEach time a Tyranids model with this Hyper-adaptation makes an attack that targets an enemy Monster or Vehicle unit, that attack has the [LETHAL HITS] ability.\n\nHIVE PREDATORS \nEach time a Tyranids model with this Hyper-adaptation makes an attack that targets an enemy Character unit, if a Critical Hit is scored, that attack has the [PRECISION] ability."
  },
  {
    "Id": "6b5a-5109-2eea-a35b",
    "Name": "Feed the Swarm",
    "Type": "Faction",
    "Description": "In your Command phase, each HARVESTER unit from your army can Regenerate one friendly TYRANIDS unit that is within 6\" of it. A unit can only be regenerated once per phase. Each time a unit regenerates do one of the following:\n\n- One model in that unit regains up to D3+1 lost wounds\n- One destroyed INFANTRY model (excluding CHARACTERS) is returned to that unit with its full wounds. If that unit is an ENDLESS MULTITUDE unit, return up to 3 destroyed models are returned instead."
  },
  {
    "Id": "2bb9-e5dd-1201-30a4",
    "Name": "Enraged Behemoths",
    "Type": "Faction",
    "Description": "Each time a TYRANIDS MONSTER model from your army makes an attack, add 1 to the Hit roll if that model’s unit is below its Starting Strength, and add 1 to the Wound roll as well if that model’s unit is Below Half-strength. In addition, while a TYRANIDS MONSTER unit from your army (excluding Battle-shocked units) is at its Starting Strength, add 2 to the Objective Control characteristic of models in that unit."
  },
  {
    "Id": "6749-413-7b91-ae20",
    "Name": "Synaptic Imperitives",
    "Type": "Faction",
    "Description": "At the start of the battle round, you can select one of the Synaptic Imperatives shown below. Until the end of the battle round, that Synaptic Imperative is active for your army and while a TYRANIDS unit from your army is within Synapse Range of your army, it will benefit from it. Each Synaptic Imperative can only be selected once per battle.\n\n\n- Synaptic Augmentation: While this unit is within Synapse Range of your army, models in this unit have a 5+ invulnerable save.\n- Surging Vitality: While this unit is within Synapse Range of your army, add 1 to Advance and Charge rolls made for this unit.\n- Goaded to Slaughter: While this unit is within Synapse Range of your army, each time a model in this unit makes a melee attack, add 1 to the Hit roll"
  },
  {
    "Id": "9c3f-24e7-ee10-bc76",
    "Name": "Insurmountable Odds",
    "Type": "Faction",
    "Description": "Each time an enemy unit is selected to shoot, after that unit has finished making its attacks, if one or more models from one or more ENDLESS MULTITUDE units from your army were destroyed as a result of those attacks, each such unit can make a Surge move. To do so, roll one D6: that unit can be moved a distance in inches up to the result, but that unit must end that move as close as possible to the closest enemy unit (excluding AIRCRAFT). When doing so, those models can be moved within Engagement Range of enemy units. A unit cannot make a Surge Move while Battle-shocked"
  },
  {
    "Id": "14cd-ab40-a29b-d7c9",
    "Name": "Questing Tendrils",
    "Type": "Faction",
    "Description": "TYRANIDS units with this ability are eligible to charge in a turn in which they Fell Back. Vanguard Invader units with this ability are eligible to charge in a turn in which they Advanced."
  },
  {
    "Id": "4f1a-3e43-334c-4250",
    "Name": "Vanguard Prime",
    "Type": "Faction",
    "Description": "DEATHLEAPER loses Hunter Organism rule and can be your WARLORD"
  },
  {
    "Id": "2fad-3a56-b66f-a0e6",
    "Name": "Leader-beasts",
    "Type": "Faction",
    "Description": "TYRANID WARRIORS and WINGED TYRANID PRIME units from your army have a 5+ invulnerable save."
  },
  {
    "Id": "11a9-1ff2-8c17-d848",
    "Name": "Keywords",
    "Type": "Faction",
    "Description": "TYRANID WARRIORS WITH RANGED BIO‑WEAPONS and TYRANID WARRIORS WITH MELEE BIO‑WEAPONS units from your army gain the TYRANID WARRIORS and BATTLELINE keywords, and while such a unit is not Battle‑shocked, TYRANID WARRIORS models in that unit have an Objective Control characteristic of 3."
  },
  {
    "Id": "1b6b-2641-e3c2-4b48",
    "Name": "Surprise Assault",
    "Type": "Faction",
    "Description": "Each time a **^^Tyranids^^** model from your army makes an attack, re-roll a Hit roll of 1.\n\nEach time a **^^Burrower^^** unit from your army is set up on the battlefield from Reserves, place a circular 40mm Tunnel Marker anywhere on the battlefield within 1\" of that unit and more than 3\" horizontally away from all enemy units.\n\nIn the Reinforcements step of your Movement phase, when you set up a unit on the battlefield from Reserves, you can set that unit up wholly within 9\" of one of your Tunnel Markers and more than 6\" horizontally away from any enemy units.\n\nIf an enemy model (excluding **^^Aircraft^^**) ends any kind of move within 3\" of one of your Tunnel Markers, that Tunnel Marker is removed from the battlefield."
  },
  {
    "Id": "f420-b708-a973-1ada",
    "Name": "Keywords",
    "Type": "Faction",
    "Description": "**^^Mawloc^^** and **^^Trygon^^** units from your army have the Burrower keyword.\n\n\nIn the Muster Armies step, you can select up to 2 **^^Trygon^^** models from your army. The selected units gain the **^^Character^^** keyword.\n\n\n**Designer’s Note:** *This means that the selected models can be given Enhancements and one of them can be selected as your **^^Warlord^^**.*"
  },
  {
    "Id": "61a5-80cd-a46-38b5",
    "Name": "Alien Cunning",
    "Type": "Faction",
    "Description": "Tyranids model only. After both players have deployed their armies, select up to three Tyranids units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves if you wish, regardless of how many units are already in Strategic Reserves."
  },
  {
    "Id": "3ffd-af3b-fe75-e013",
    "Name": "Perfectly Adapted",
    "Type": "Faction",
    "Description": "Tyranids model only. Once per turn, you can re-roll one Hit roll, one Wound roll, one Damage roll, one Advance roll, one Charge roll or one saving throw made for the bearer"
  },
  {
    "Id": "877c-8a93-2907-cf90",
    "Name": "Synaptic Linchpin",
    "Type": "Faction",
    "Description": "Tyranids model only. While a friendly Tyranids unit is within 9\" of the bearer, that unit is within Synapse Range of your army."
  },
  {
    "Id": "808c-6c15-dd55-c5b",
    "Name": "Adaptive Biology",
    "Type": "Faction",
    "Description": "Tyranids model only. The bearer has the Feel No Pain 5+ ability. At the start of any turn, if the bearer has fewer than its starting number of wounds remaining, until the end of the battle, it has the Feel No Pain 4+ ability instead."
  },
  {
    "Id": "c664-fd7d-1b66-2780",
    "Name": "Instinctive Defense",
    "Type": "Faction",
    "Description": "Tyranids model only. While the bearer is within 6\" of one or more HARVESTER units, you can target the bearer's unit with the Heroic Intervention Stratagem for 0CP. In addition, while the bearer is within 6\" of one or more friendly HARVESTER units, models in the bearer's unit have the Fights First ability."
  },
  {
    "Id": "68ef-4d8f-7fc-994f",
    "Name": "Parasitic Biomorphology",
    "Type": "Faction",
    "Description": "Tyranids model only. Add 1 to the Strength characteristic of melee weapons equipped by models in the bearer's unit. The first time the bearer's unit destroys an enemy unit in the Fight phase while the bearer is within 6\" of one or more HARVESTER units, until the end of battle, add 1 to the Attacks characteristic of melee weapons equipped by models in the bearer's unit."
  },
  {
    "Id": "6b1f-a920-8ec5-c77a",
    "Name": "Regenerating Monstrosity",
    "Type": "Faction",
    "Description": "Tyranids model only (excluding MONSTERS models) The bearer's unit can be regenerated up to twice per phase, instead of once."
  },
  {
    "Id": "9211-8584-f894-b756",
    "Name": "Biophagic Flow (Aura)",
    "Type": "Faction",
    "Description": "Tyranids model only. While a friendly HARVERSTER model is within 12\" of the bearer, when using the Feed the Swarm ability, that HARVESTER model can Regenerate one friendly Tyranids unit that is within 9\" instead of one within 6\"."
  },
  {
    "Id": "92f3-f963-1008-10a5",
    "Name": "Monstrous Nemesis",
    "Type": "Faction",
    "Description": "Tyranids Monster only. Each time the bearer makes a melee attack that targets a MONSTER or VEHICLE unit, add 1 to the Wound Roll"
  },
  {
    "Id": "9ea8-c4dd-d536-1929",
    "Name": "Null Nodules",
    "Type": "Faction",
    "Description": "Tyranids Monster only. Once per battle, when a Psychic Attack is allocated to the bearer, it can use this ability. If it does, until the end of the phase, the bearer has the Feel No Pain 5+ ability against Psychic Attacks."
  },
  {
    "Id": "6726-4259-4b8a-41ac",
    "Name": "Ominous Presence",
    "Type": "Faction",
    "Description": "Tyranids MONSTER only. Add 3 to the bearer's Objective Control"
  },
  {
    "Id": "e43b-68a7-4d07-e707",
    "Name": "Enraged Reserves",
    "Type": "Faction",
    "Description": "Tyranids  MONSTER only. If the bearer is destroyed by a melee attack, if it has not fought this phase, roll one D6: on a 3+, do not remove it from play. It can fight after the attacking model's unit has finished making its attacks, and is then removed from play."
  },
  {
    "Id": "bb92-1121-d089-3082",
    "Name": "Psychostatic Disruption",
    "Type": "Faction",
    "Description": "**^^Tyranids Synapse^^** model only. Enemy units that arrive on the battlefield from Reserves cannot be set up with 12\" of the bearer. In addition, once per battle, during the first or battle round, when your opponent declares that a unit will arrive on the battlefield from Strategic Reserves, the bearer can use this enhancement. If it does, roll one D6: on a 4+, that enemy cannot arrive on the battlefield this turn."
  },
  {
    "Id": "f64f-279-e67c-f70b",
    "Name": "Synaptic Control",
    "Type": "Faction",
    "Description": "**^^Tyranids Synapse^^** model only. Each time an attack is allocated to the bearer, subtract 1 from the Damage characteristic of the attack."
  },
  {
    "Id": "774b-3731-c69e-ad2",
    "Name": "The Dirgeheart of Kharis",
    "Type": "Faction",
    "Description": "**^^Tyranids Synapse^^** model only. While an enemy unit is within 9\" of the bearer, worse that unit's Leadership characteristic by 1."
  },
  {
    "Id": "f276-7f7a-d2e8-39da",
    "Name": "Power of the Hive Mind",
    "Type": "Faction",
    "Description": "**^^Tyranids Psyker^^** model only. Improve the Strength and Armour Penetration characteristic of psychic weapons equipped by the wearer of 1."
  },
  {
    "Id": "d687-22aa-c30e-ca79",
    "Name": "Naturalised Camoflage",
    "Type": "Faction",
    "Description": "Tyranids model only. At the start of the first battle round, select up to three friendly ENDLESS MULTITUDE units within 9\" of the bearer. Until the end of the battle round, each time a ranged attack targets one of those units, models in that unit have the Benefit of Cover against that attack."
  },
  {
    "Id": "23b8-bd02-3e27-712c",
    "Name": "Piercing Talons",
    "Type": "Faction",
    "Description": "Tyranids model only. Each time a model in the Bearer's unit makes an attack, on a Critical Wound, improve the Armour Penetration characteristic of that attack by 1."
  },
  {
    "Id": "12a-454-494d-5253",
    "Name": "Relentless Hunger",
    "Type": "Faction",
    "Description": "Tyranids model only. Add 2\" to the Move characteristic of models in the bearer's unit."
  },
  {
    "Id": "988a-bbc8-5714-63bd",
    "Name": "Adrenalised Onslaught",
    "Type": "Faction",
    "Description": "Tyranids model only. Each time the bearer's unit makes a Pile In or Consolidation, models in this unit can move an additional 3\""
  },
  {
    "Id": "9003-322e-7a1c-70bd",
    "Name": "Hunting Grounds",
    "Type": "Faction",
    "Description": "Tyranids model only. While the bearer is on the battlefield, each time your opponent sets up a Reserves unit on the battlefield, roll one D6: on a 2+ that unit must make a Battle-shock test."
  },
  {
    "Id": "a260-81c2-7cda-a6ae",
    "Name": "Neuronode",
    "Type": "Faction",
    "Description": "TYRANIDS model only. After both players have deployed their armies, you can select up to three VANGUARD INVADER units from your army and redeploy all of those units. When doing so, any of those units can be placed into Strategic Reserves, regardless of how many units are already in Strategic Reserves."
  },
  {
    "Id": "5bd3-8be8-76c3-fab9",
    "Name": "Stalker",
    "Type": "Faction",
    "Description": "Vanguard Invader Model only. At the start of the battle, select one enemy unit. Each time the bearer makes an attack that targets that enemy unit, add 1 to the Hit roll and Wound roll."
  },
  {
    "Id": "816c-af4d-ac5e-d3f7",
    "Name": "Chameleonic",
    "Type": "Faction",
    "Description": "VANGUARD INVADER only. The bearer has the Stealth ability and each time a ranged attack targets the bearer's unit, models in that unit have the Benefit of Cover against that attack."
  },
  {
    "Id": "66c6-4d4b-8198-1813",
    "Name": "Sensory Assimilation",
    "Type": "Faction",
    "Description": "WINGED TYRANID PRIME model only. Each time an attack targets the bearer’s unit, subtract 1 from the Hit roll."
  },
  {
    "Id": "b079-93cd-5595-103b",
    "Name": "Elevated Might",
    "Type": "Faction",
    "Description": "TYRANIDS model only. The bearer’s unit is eligible to declare a charge in a turn in which it Advanced."
  },
  {
    "Id": "f43e-c42a-e09c-73af",
    "Name": "Ocular Adaptation",
    "Type": "Faction",
    "Description": "WINGED TYRANID PRIME model only. Each time a model in the bearer’s unit makes an attack, add 1 to the Hit roll."
  },
  {
    "Id": "dbfc-5831-8950-b277",
    "Name": "Synaptic Tyrant",
    "Type": "Faction",
    "Description": "NEUROTYRANT model only. During the Declare Battle Formations step, the bearer can be attached to a TYRANID WARRIORS unit."
  },
  {
    "Id": "8dbe-516b-3e46-9a45",
    "Name": "Vanguard Intellect",
    "Type": "Faction",
    "Description": "**^^Tyranids^^** model with the Deep Strike ability only. The bearer’s unit can be set up using the Deep Strike ability in the Reinforcements step of your first, second or third Movement phase, regardless of any mission rules."
  },
  {
    "Id": "7598-f5d0-f953-0acb",
    "Name": "Trygon Prime",
    "Type": "Faction",
    "Description": "**^^Trygon^^** model only. The bearer gains the **^^Synapse^^** keyword. Improve the Strength and Weapon Skill characteristics of melee weapons equipped by the bearer by 1."
  },
  {
    "Id": "dff7-ef91-6ed8-3cdd",
    "Name": "Synaptic Strategy",
    "Type": "Faction",
    "Description": "**^^Tyranids^^** model only. Once per battle, you can target the bearer’s unit with the Rapid Ingress stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase."
  },
  {
    "Id": "d841-e46d-0ab4-3c2c",
    "Name": "Tremor Senses",
    "Type": "Faction",
    "Description": "**^^Tyranids^^** model only. After both players have deployed their armies, select up to three friendly **^^Tyranids^^** units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves, regardless of how many units are already in Strategic Reserves."
  },
  {
    "Id": "f43c-d2c6-adac-abf9",
    "Name": "Strength Born of Hunger",
    "Type": "Faction",
    "Description": "Add 1 to the Strength characteristic of melee weapons equipped by models in this unit."
  },
  {
    "Id": "625a-8155-9dbc-661e",
    "Name": "Enhanced Senses",
    "Type": "Faction",
    "Description": "- Each time a model in this unit makes a melee attack, you can ignore any or all Hit roll and Weapon Skill modifiers for that attack.\n- Each time a model in this unit makes a ranged attack, that attack has the **[IGNORES COVER]** ability."
  },
  {
    "Id": "8f67-6189-1e62-758e",
    "Name": "Instinctive Autonomy",
    "Type": "Faction",
    "Description": "While this unit is within 18\" of a friendly **^^Synapse^^** model, this unit counts as being within 6\" of that model for its Synapse ability."
  },
  {
    "Id": "cee1-00c3-f7b3-e9fc",
    "Name": "Ranged Resistance",
    "Type": "Faction",
    "Description": "Each time a ranged attack is allocated to a model in this unit, add 1 to any armour saving throw made against that attack."
  },
  {
    "Id": "7083-bb24-fb28-5525",
    "Name": "Fleet of Claw",
    "Type": "Faction",
    "Description": "Each time you make an Advance or Charge roll for this unit, you can re-roll the result."
  },
  {
    "Id": "d03f-7674-3564-5d99",
    "Name": "Onslaught Killers",
    "Type": "Faction",
    "Description": "Each time a model in this unit makes a melee attack, if this unit made a Charge move this turn, add 1 to the Hit roll."
  },
  {
    "Id": "fcb1-75a7-9c8d-3815",
    "Name": "Unfathomable Terror",
    "Type": "Faction",
    "Description": "At the end of your Movement phase, select one enemy unit within 6\" of and visible to this unit. That enemy unit must take a Leadership test, subtracting 1 from the roll. If failed, until the start of your next Movement phase, that enemy unit cannot be select to Advance and its Move characteristic is reduced by 2\"."
  },
  {
    "Id": "7ffd-04d2-3e99-1661",
    "Name": "Psychic Shadow",
    "Type": "Faction",
    "Description": "Each time a ranged Psychic Attack targets this unit, this unit has the Benefit of Cover and Feel No Pain 5+ ability against that attack."
  },
  {
    "Id": "2b58-a39a-07fb-b8b9",
    "Name": "Armoured Biomorph",
    "Type": "Faction",
    "Description": "Add 1 to the Toughness characteristic of models in this unit."
  },
  {
    "Id": "8aa1-4f2d-18ed-2923",
    "Name": "Psionic Resonance",
    "Type": "Faction",
    "Description": "Once per battle, this unit can be targeted with a Stratagem for 0CP, even if another unit from your Crusade army has already been targeted with that Stratagem this phase."
  },
  {
    "Id": "77f3-f50a-143f-98fc",
    "Name": "Alien Resilience",
    "Type": "Faction",
    "Description": "At the start of your Command phase, one model in this unit regains 1 lost wound."
  },
  {
    "Id": "129f-ac87-31ea-6321",
    "Name": "Psychic Aberration",
    "Type": "Faction",
    "Description": "Once per battle, at the start of any phase, you can select one **^^Tyranids^^** unit that is Battle-shocked and within 12\" of this model. That unit is no longer Battle-shocked."
  },
  {
    "Id": "86c1-cd9d-66fe-7125",
    "Name": "Mortrexite Implant Attack",
    "Type": "Faction",
    "Description": "- Melee weapons equipped by the bearer gain the **[DEVASTATING WOUNDS]]** ability.\n- Each time the bearer fights, if one or more enemy models (excluding **^^Vehicle^^** models) are destroyed when resolving those attacks, after that fight is resolved you can select one friendly **^^Ripper Swarms^^** unit within 12\" of the bearer. If any of those destroyed enemy models had the **^^Monster^^** keyword, add D3 Ripper Swarm models to that **^^Ripper Swarms^^** unit instead."
  },
  {
    "Id": "a353-bede-815f-e226",
    "Name": "Slayer Sabres",
    "Type": "Faction",
    "Description": "**^^Monster^^** model only. Select one of the bearer's melee weapons. That weapon gains the following ability:\n\n**Slayer Sabres:** Each time the bearer fights, after that fight is resolved, select one enemy unit hit by one or more attacks made with this weapon this phase, then roll one D6: on a 2+, that unit suffers D3 mortal wounds, or D6+1 mortal wounds instead if that unit has the **^^Psyker^^** keyword."
  },
  {
    "Id": "f239-1b0a-a3d1-3dee",
    "Name": "The Norn Crown",
    "Type": "Faction",
    "Description": "- While the bearer is on the battlefield, once per battle, you can use the Shadow in the Warp ability one additional time.\n- While the bearer is on the battlefield, increase the range of friendly **^^Synapse^^** units' Synapse ability to 9\"."
  },
  {
    "Id": "4c8f-5d71-2fee-d6c6",
    "Name": "Balemind Membrane",
    "Type": "Faction",
    "Description": "At the start of your Shooting phase, select one enemy unit within 12\" of the bearer that is not fully visible to the bearer due to intervening terrain or because it is within a terrain feature. Roll one D6, adding 2 to the result if the unit is on or within a RUINS terrain feature: on a 3-5, that unit suffers D3 mortal wounds; on a 6+, that unit suffers 3 mortal wounds."
  },
  {
    "Id": "3c65-fd4d-8330-cce3",
    "Name": "Spirit-leech Cortex",
    "Type": "Faction",
    "Description": "**^^Psyker^^** model only. Each time an enemy unit loses a wound as the result of a Psychic Attack made by the bearer:\n- The bearer regains 1 lost wound.\n- Until the start of your Command phase, add 1 to the Strength of the bearer's melee weapons."
  },
  {
    "Id": "f748-4102-5a8b-6547",
    "Name": "Bestial Rage",
    "Type": "Faction",
    "Description": "Each time this unit declares a charge, one of the targets of that charge must be the closest eligible enemy unit."
  },
  {
    "Id": "92e7-1013-f392-196a",
    "Name": "Uncontrollable",
    "Type": "Faction",
    "Description": "This unit is never considered to be within Synapse range of your army."
  },
  {
    "Id": "26a1-2e1c-79f1-4047",
    "Name": "By Instinct Alone",
    "Type": "Faction",
    "Description": "This unit cannot be targeted with Stratagems."
  },
  {
    "Id": "d131-e302-821d-7bf2",
    "Name": "Mindless Focus",
    "Type": "Faction",
    "Description": "Each time this unit is selected to shoot, models in this unit can only target the closest eligible enemy unit when resolving this unit's attacks."
  },
  {
    "Id": "81b7-301f-61dc-64db",
    "Name": "Lobe Impairment",
    "Type": "Faction",
    "Description": "While this unit has this Battle Scar, it loses the Synapse ability."
  },
  {
    "Id": "5950-ef0f-3adf-1afc",
    "Name": "Neural Dissonance",
    "Type": "Faction",
    "Description": "This unit cannot benefit from Stratagems or Detachment Rules that require the **^^Synapse^^** keyword."
  },
  {
    "Id": "8cff-cb8e-96bf-181f",
    "Name": "Synaptic Decay",
    "Type": "Faction",
    "Description": "Reduce the range of this model's Synapse ability to 3\"."
  },
  {
    "Id": "ceee-55f8-0cee-b05a",
    "Name": "Casts No Shadow",
    "Type": "Faction",
    "Description": "While this unit has this Battle Scar, it is affected by your army's Shadow in the Warp ability (and thus must take a Battle-shock test when it is used)."
  },
  {
    "Id": "a2fa-ebfd-7b32-9a75",
    "Name": "Invulnerable Save (4+)",
    "Type": "Faction",
    "Description": "Description: This model has a 4+ invulnerable save."
  },
  {
    "Id": "384f-e5ff-31a2-1295",
    "Name": "Damaged: 1-5 Wounds Remaining",
    "Type": "Faction",
    "Description": "Description: While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "57fe-61a-b993-2db0",
    "Name": "Invulnerable Save (5+)",
    "Type": "Faction",
    "Description": "Description: This model has a 5+ invulnerable save."
  },
  {
    "Id": "3f46-6dbb-d99b-4ae2",
    "Name": "Feeder Tendrils",
    "Type": "Faction",
    "Description": "Description: Each time this model destroys an enemy Character model, you gain 1CP."
  },
  {
    "Id": "9c62-16b6-ad61-163d",
    "Name": "Floating Death",
    "Type": "Faction",
    "Description": "Description: Each time this unit or an enemy unit ends a move, for each model in this unit within 3\" of one or more enemy units, select one of those enemy units. That model in this unit is destroyed, then roll one D6: on a 2-5, that enemy unit suffers D3 mortal wounds; on a 6 that enemy unit suffers D6 mortal wounds."
  },
  {
    "Id": "374e-ed33-a96f-a014",
    "Name": "Bio-minefield",
    "Type": "Faction",
    "Description": "Description: Enemy units cannot start or end an Advance move within 6\" of this unit."
  },
  {
    "Id": "b4a8-7659-cc29-b18e",
    "Name": "Damaged: 1-4 Wounds Remaining",
    "Type": "Faction",
    "Description": "Description: While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "50cc-aa66-ffc8-61c7",
    "Name": "Damaged: 1-6 Wounds Remaining",
    "Type": "Faction",
    "Description": "Description: While this model has 1-6 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "13-98c1-d481-eb95",
    "Name": "Will of the Hive Mind",
    "Type": "Faction",
    "Description": "Description: Once per battle round, one model from your army with this ability can use it when a friendly **^^Tyranids^^** unit within 12\" of that model is targeted with a Stratagem. If it does, reduce the CP cost of that usage of that Stratagem by 1CP."
  },
  {
    "Id": "3b8a-73e4-1389-b399",
    "Name": "Invulnerable Save (5+)",
    "Type": "Faction",
    "Description": "Description: Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "a3a6-1416-699f-386b",
    "Name": "Invulnerable Save (6+)",
    "Type": "Faction",
    "Description": "Description: Models in this unit have a 6+ invulnerable save."
  },
  {
    "Id": "395b-a159-b293-27aa",
    "Name": "Shadow in the Warp",
    "Type": "Faction",
    "Description": "If your Army Faction is **^^Tyranids^^**, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test."
  },
  {
    "Id": "6cdf-a79d-f979-75f5",
    "Name": "Tyranid Warrior",
    "Type": "Faction",
    "Description": "M: 6\"\nT: 5\nSV: 4+\nW: 3\nLD: 7+\nOC: 2"
  },
  {
    "Id": "2461-bee9-2afc-8776",
    "Name": "Termagants",
    "Type": "Faction",
    "Description": "M: 6\"\nT: 3\nSV: 5+\nW: 1\nLD: 8+\nOC: 2"
  },
  {
    "Id": "a62-2152-78a8-d7c8",
    "Name": "Death Guard Defenders",
    "Type": "Faction",
    "Description": "While this model is within 3\" of one or more friendly ^^**Death Guard Infantry^^** units, this model has the Lone Operative ability."
  },
  {
    "Id": "6e8c-70d5-2b8f-2b2c",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "0f8a-2008-862e-8af6",
    "Name": "Fevered Strategist",
    "Type": "Faction",
    "Description": "Once per Battle Round, one model from your army with this ability can use it when a friendly ^^**Death Guard^^** unit within 12\" of that model is targeted with a Stratagem. If it does, reduce the CP cost of that Stratagem by 1CP."
  },
  {
    "Id": "0c92-aa1c-c7e5-a527",
    "Name": "Miasma of Pestilence (Aura)",
    "Type": "Faction",
    "Description": "While a friendly ^^**Death Guard^^** unit is within 6\" of this model, each time a ranged attack targets that unit, models in that unit have the Benefit of Cover against that attack."
  },
  {
    "Id": "8ce2-6dec-6caf-3777",
    "Name": "Horrifying Visage",
    "Type": "Faction",
    "Description": "Each time this model ends a Charge move, select one enemy unit within Engagement Range of it. That unit must take a Battle-shock test, subtracting 1 from that test."
  },
  {
    "Id": "d376-c886-6c02-923f",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "e98-fdf-85f6-5c44",
    "Name": "Enfeebling Miasma (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit (excluding ^^*Monsters^^** and ^^**Vehicles^^**) is within 6\" of this model, each time that unit is selected to Fall Back, models in that enemy unit must take Desperate Escape tests. When doing so, if that enemy unit is Battle-shocked, subtract 1 from each of those Desperate Escape tests."
  },
  {
    "Id": "77d-6b50-56be-1c71",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ ^^**Blightlord Terminators^^**\n■ ^^**Deathshroud Terminators^^**\n■ ^^**Poxwalkers^^**"
  },
  {
    "Id": "2e89-e2c6-f499-e2b",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "e1de-40a6-c9a9-7316",
    "Name": "The Destroyer Hive",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a melee attack targets that unit, subtract 1 from the Hit roll."
  },
  {
    "Id": "595f-4a7d-3845-2131",
    "Name": "Eater Plague (Psychic)",
    "Type": "Faction",
    "Description": "In your Shooting phase, you can select one enemy unit within 18\" of and visible to this ^^**Psyker^^** (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of this ^^**Psyker^^** and roll one D6: on a 1, this ^^**Psyker^^**'s unit suffers D3 mortal wounds; on a 2-5, that enemy unit suffers D6 mortal wounds; on a 6, that enemy unit suffers D3+3 mortal wounds."
  },
  {
    "Id": "f34e-24da-8f79-a9c2",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "b29a-947-acbe-1eba",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following unit:\n■ PLAGUE MARINES"
  },
  {
    "Id": "fe5a-2fe9-242a-d7fb",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "90a2-1895-2e96-d987",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ BLIGHTLORD TERMINATORS\n■ DEATHSHROUD TERMINATORS"
  },
  {
    "Id": "e36d-3711-9601-488b",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "c011-8b42-c9f3-e3cc",
    "Name": "Virulent Aura",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a model in that unit makes a ranged attack, you can re-roll the Wound roll."
  },
  {
    "Id": "b-b5eb-2ac6-b6df",
    "Name": "Blight Bombardment",
    "Type": "Faction",
    "Description": "At the start of your Shooting phase, select one enemy unit within 30\" of and visible to this model. Until the end of the phase, each time a friendly ^^**Death Guard^^** unit makes a ranged attack that targets that unit, re-roll a Hit roll of 1 (if that attack is made with a Blast weapon, you can re-roll the Hit roll instead)."
  },
  {
    "Id": "e778-6ccb-2016-6cb5",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n- ^^**Blightlord Terminators^^**\n- ^^**Deathshroud Terminators^^**"
  },
  {
    "Id": "8af0-9fb3-8fa-a1e0",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "df3c-ad72-1ad5-4d0d",
    "Name": "Vector of Disease",
    "Type": "Faction",
    "Description": "While this model is leading a unit, melee weapons equipped by models in that unit have the **[Sustained Hits 1]** and **[Lance]** abilties."
  },
  {
    "Id": "e96b-953c-dbe9-f622",
    "Name": "Unholy Resilience",
    "Type": "Faction",
    "Description": "The first time a model with this ability is destroyed in a battle round, roll one D6 at the end of the phase. On a 2+, set that model back up on the battlefield, as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with 3 wounds remaining. Each model can only be set up in this way once per battle."
  },
  {
    "Id": "a73f-4b0f-de8f-e10e",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n- ^^**Blightlord Terminators^^**\n- ^^**Deathshroud Terminators^^**"
  },
  {
    "Id": "225b-dcc0-3a88-11bb",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "339e-1933-3dbf-e355",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ BLIGHTLORD TERMINATORS\n■ DEATHSHROUD TERMINATORS"
  },
  {
    "Id": "c9ea-1d59-9bf-bb00",
    "Name": "Putrescent Vitality (Psychic)",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, you can roll one D6: on a 1, this PSYKER’s unit suffers D3 mortal wounds; on a 2+, until the end of the phase, each time an attack is allocated to a model in this PSYKER’s unit, subtract 1 from the Damage characteristic of that attack."
  },
  {
    "Id": "6dc6-e465-e8ff-a4eb",
    "Name": "Pestilent Familiar (Psychic)",
    "Type": "Faction",
    "Description": "Once per battle, after selecting targets for a Psychic weapon equipped by this model, until the end of the phase, improve the Strength and Damage characteristics of that weapon by 2."
  },
  {
    "Id": "20c4-9b25-4f77-852e",
    "Name": "Gift of Contagion (Psychic)",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a model in that unit makes an attack which targets a unit which is Afflicted, that attack has the [Sustained Hits 1] ability."
  },
  {
    "Id": "4108-2036-c473-aa46",
    "Name": "Pestilent Fallout (Psychic)",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy ^^**Infantry^^** unit hit by one or more of those attacks made with its Plague Wind. Until the end of your opponent's next turn, that unit is enfeebled. While a unit is enfeebled, subtract 2\" from the Move characteristic of models in that unit."
  },
  {
    "Id": "290-e59f-d3bd-9a68",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n^^**Plague Marines^^**, ^^**Poxwalkers^^**"
  },
  {
    "Id": "90ad-b6be-844c-365d",
    "Name": "Infused with the Blessings of Nurgle",
    "Type": "Faction",
    "Description": "In your Shooting phase, each time this unit is selected to shoot, after this unit has shot, select one enemy unit hit by one or more of those attacks. Until the start of your next turn, that unit is Afflicted."
  },
  {
    "Id": "ad92-6478-18b8-6222",
    "Name": "Curse of the Walking Pox",
    "Type": "Faction",
    "Description": "Each time a ^^**Poxwalker^^** model in this unit makes an attack that destroys an enemy model (excluding ^^**Monster^^** and ^^**Vehicle^^** models), after this unit has resolved its attacks, you can return one destroyed ^^**Poxwalker^^** model to this unit.\n\nWhile ^^**Typhus^^** is leading this unit, enemy models destroyed as a result of ^^**Typhus^^**’ Eater Plague ability count as enemy models destroyed by an attack made by a ^^**Poxwalker^^** model in this unit for the purposes of this ability."
  },
  {
    "Id": "67fb-5245-68ef-56de",
    "Name": "Sickening Vitality",
    "Type": "Faction",
    "Description": "While this model is leading a unit, add 1\" to the Move characteristic of models in that unit and you can re-roll Advance and Charge rolls made for that unit."
  },
  {
    "Id": "617e-b283-8a90-df5a",
    "Name": "Tocsin of Misery (Aura)",
    "Type": "Faction",
    "Description": "In the Battle-shock step of your opponent's Command phase, if an enemy unit that is below its Starting Strength is within 9\" of this model, that enemy unit must take a Battle-shock test, subtracting 1 from that test if it is a ^^**Psyker^^** unit."
  },
  {
    "Id": "5df1-a522-e690-dddc",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units: ^^**Plague Marines^^**, ^^**Poxwalkers^^**\n*You can attach this model to a ^^**Plague Marines^^** or ^^**Poxwalkers^^** unit, even if one other Leader unit has already been attached to it (you cannot attach more than one of the same Leader to the same unit). If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths.*"
  },
  {
    "Id": "f33c-eeb8-429d-2a2f",
    "Name": "Putrefying Stink",
    "Type": "Faction",
    "Description": "Enemy models cannot start or end an Advance move within 9\" of this model."
  },
  {
    "Id": "be78-8c3d-c31a-67f5",
    "Name": "Blinding Spray",
    "Type": "Faction",
    "Description": "In the Fight phase, you can select one model from your army with this ability to use this ability. If you do, until the end of that phase, that model's unit has the Fights First ability. Each model can only be selected for this ability once per battle."
  },
  {
    "Id": "ebdf-6359-5f8e-4079",
    "Name": "Extraction of Fresh Disease",
    "Type": "Faction",
    "Description": "The first time this model's unit destroys an enemy unit as a result of a melee attack, until the end of the battle, add 6 to the Objective Control characteristic of this model."
  },
  {
    "Id": "a1e3-4ac3-299c-1417",
    "Name": "Foul Infusion",
    "Type": "Faction",
    "Description": "While this model is leading a unit, weapons equipped by models in that unit have the [Lethal Hits] ability. In addition, each time a model in that unit makes an attack, a Critical Hit is scored on an unmodified roll of 5+, instead of only on a 6."
  },
  {
    "Id": "4b43-4623-e0e1-f159",
    "Name": "Malicious Calculations",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a model in that unit makes an attack, you can ignore any or all modifiers to that attack's Ballistic Skill or Weapon Skill characteristics and/or any or all modifiers to the Hit roll."
  },
  {
    "Id": "a8a2-18de-801d-6470",
    "Name": "Seven-fold Chant",
    "Type": "Faction",
    "Description": "In your Command phase, if this model is on the battlefield, roll 2D6: on a 7+, you gain 1CP."
  },
  {
    "Id": "61c7-91ec-614-fa78",
    "Name": "Tainted Narthecium",
    "Type": "Faction",
    "Description": "While this model is leading a unit, in your Command phase, you can return 1 destroyed Bodyguard model to that unit."
  },
  {
    "Id": "96ee-97c4-3b67-e45",
    "Name": "Inflamed Infections",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, select one enemy unit within Engagement Range of this model. Until the end of the phase, each time this model makes an attack that targets that unit, an unmodified Hit roll of 5+ scores a Critical Hit. If that unit is below Half-strength, an unmodified Hit roll of 4+ scores a Critical Hit instead."
  },
  {
    "Id": "a4ac-68a4-3849-3695",
    "Name": "Silent Bodyguard",
    "Type": "Faction",
    "Description": "While a ^^**Character^^** model is leading this unit, that ^^**Character^^** model has the Feel No Pain 4+ ability."
  },
  {
    "Id": "71fc-4706-77d0-25e9",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 4+ invulnerable save."
  },
  {
    "Id": "4245-0a58-3995-1671",
    "Name": "Death Approaches",
    "Type": "Faction",
    "Description": "In your Movement phase, when this unit is set up on the battlefield using the Deep Strike ability, it can be set up anywhere on the battlefield that is more than 6\" horizontally away from all Afflicted enemy units, and more than 9\" horizontally away from any other enemy units."
  },
  {
    "Id": "39dd-f8e7-418a-a141",
    "Name": "Diseased Malice",
    "Type": "Faction",
    "Description": "Each time this model makes an attack that targets an Afflicted unit, add 1 to the Wound roll."
  },
  {
    "Id": "af7f-a1a3-d20e-9c",
    "Name": "Froth-spattered Frenzy",
    "Type": "Faction",
    "Description": "If this model is equipped with two melee weapons in addition to its close combat weapon, add 2 to the Attacks characteristic of those two weapons."
  },
  {
    "Id": "75a9-938d-b369-6d81",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 4+ invulnerable save."
  },
  {
    "Id": "c485-d6a6-8913-c29a",
    "Name": "Blistering Fusillade",
    "Type": "Faction",
    "Description": "If this unit has a Starting Strength of 5 or more, or if a ^^**Character^^** is leading this unit, then each time a model in this unit makes a ranged attack that targets an Afflicted unit, improve the Strength and Armour Penetration characteristics of that attack by 1."
  },
  {
    "Id": "345b-e060-85c4-3a04",
    "Name": "Lethal Ichor",
    "Type": "Faction",
    "Description": "Each time a melee attack is allocated to a model in this unit, after the attacking unit has finished making its attacks, roll one D6 (to a maximum of six D6 per attacking unit): for each 4+, the attacking unit suffers 1 mortal wound."
  },
  {
    "Id": "e47-254c-cdf9-7c5e",
    "Name": "Tank Hunters",
    "Type": "Faction",
    "Description": "In your Shooting phase, each time a model in this unit makes a attack that targets a ^^**Monster^^** or ^^**Vehicle^^** unit, add 1 to the Hit roll and add 1 to the Wound roll."
  },
  {
    "Id": "f24e-d919-2175-70bb",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "b2e1-4694-48b-7f46",
    "Name": "Hovering Death",
    "Type": "Faction",
    "Description": "This model is eligible to shoot and declare a charge in a turn in which it Fell Back."
  },
  {
    "Id": "57ad-7a0a-db8a-312e",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "51dd-7b91-7f32-bd8f",
    "Name": "Spore-laced Shock Waves",
    "Type": "Faction",
    "Description": "In your Shooting phase, each time you select a target for this model's Plagueburst mortar, roll one D6 for the target unit and every other enemy unit within 3\" of the target unit, adding 1 to that roll if the unit being rolled for is Afflicted. On a 6+, the unit being rolled for is struck by spores; after resolving all of this model's attacks against the target unit, each unit struck by spores suffers D3 mortal wounds."
  },
  {
    "Id": "85e5-391a-502b-3260",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "4fa1-d53f-feff-9180",
    "Name": "Assault Ramp",
    "Type": "Faction",
    "Description": "Each time a unit disembarks from this model after it has made a Normal move, that unit is still eligible to declare a charge this turn."
  },
  {
    "Id": "a5c8-bcd-15d5-32ae",
    "Name": "Metalophagic Infection",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy ^^**Monster^^** or ^^**Vehicle^^** unit hit by one or more of those attacks. Roll one D6, adding 1 to the result if that unit is Afflicted; on a 5+, that unit suffers D3 mortal wounds."
  },
  {
    "Id": "d42e-f8ea-a29a-2766",
    "Name": "Hail of Corrosive Disease",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy unit (excluding ^^**Monsters^^** and ^^**Vehicles^^**) hit by one or more of those attacks. Until the end of the phase, each time a friending ^^**Death Guard^^** unit makes a ranged attack that targets that enemy unit, improve the Armour Penetration characteristic of that attack by 1. The same enemy unit can only be affected by this ability once per phase."
  },
  {
    "Id": "747f-d87d-d9d9-c63e",
    "Name": "Scuttling Walker",
    "Type": "Faction",
    "Description": "Each time this model makes a Normal, Advance or Fall Back move, it can move through friendly ^^**Monster^^** and ^^**Vehicle^^** models and terrain features that are 4\" or less in height."
  },
  {
    "Id": "1d62-7fb5-d574-8046",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "d7ed-10cd-0209-0763",
    "Name": "Barrage of Filth",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, that enemy unit cannot have the Benefit of Cover."
  },
  {
    "Id": "c0c9-74ff-68a4-bbec",
    "Name": "Fire Support",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, each time a friendly model that disembarked from this ^^**Transport**^^ this turn makes an attack that targets that unit, you can re-roll the Wound roll."
  },
  {
    "Id": "f80d-c92e-8aa-d3d1",
    "Name": "Host of Plagues",
    "Type": "Faction",
    "Description": "At the end of your Movement phase, roll one D6 for each enemy unit within 6\" of this model, adding 1 to the result if that unit is Afflicted; on a 3+, that enemy unit suffers D3 mortal wounds."
  },
  {
    "Id": "5ab4-d691-93a8-3d21",
    "Name": "Lord of the Death Guard",
    "Type": "Faction",
    "Description": "Once per turn, this model can use one of the Lord of the Death Guard abilties."
  },
  {
    "Id": "518f-419c-f428-4fb9",
    "Name": "Damaged: 1-6 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-6 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "ec28-bdc7-e123-b319",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "b063-b5e6-8bb1-83ab",
    "Name": "Unclean Icon",
    "Type": "Faction",
    "Description": "While this model is leading a unit, add 1 to the Objective Control characteristic of models in that unit."
  },
  {
    "Id": "57f2-2abe-dcb7-2355",
    "Name": "Blessed Icon of Disease",
    "Type": "Faction",
    "Description": "Once per battle, at the start of any phase, you can select one friendly ^^**Death Guard^^** unit that is Battle-shocked and within 12\" of this model. That unit is no longer Battle-shocked."
  },
  {
    "Id": "f006-4a66-c5fb-edcd",
    "Name": "Putrescent Fog (Aura)",
    "Type": "Faction",
    "Description": "Enemy units that are set up on the battlefield as Reinforcements cannot be set up within 12\" of this model."
  },
  {
    "Id": "7d03-829f-56a1-940d",
    "Name": "Diseased Cover",
    "Type": "Faction",
    "Description": "Each time a ranged attack is allocated to a model, if that model is not fully visible to every model in the attacking unit because of this **^^Fortification^^**, that model has the Benefit of Cover against that attack."
  },
  {
    "Id": "2e2d-33de-e666-96f9",
    "Name": "Deployment",
    "Type": "Faction",
    "Description": "Both parts of this ^^**Fortification**^^ must be deployed within 1\" of each other. Both parts are then treated as a single model for all rules purposes."
  },
  {
    "Id": "4acd-b3e5-379b-bd38",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "eb81-795f-f750-12f7",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following unit:\n■ CHOSEN\n■ LEGIONARIES\n■ PLAGUE MARINES"
  },
  {
    "Id": "fb65-cd0-4944-7ac6",
    "Name": "Revolting Regeneration",
    "Type": "Faction",
    "Description": "At the start of your Command phase, this model regains up to D3 lost wounds."
  },
  {
    "Id": "afa3-246b-8181-9a00",
    "Name": "Lord of Chaos",
    "Type": "Faction",
    "Description": "Once per battle round, one unit from your army with this ability can use it when its unit is targeted with a Stratagem. If it does, reduce the CP cost of that use of that Stratagem by 1CP."
  },
  {
    "Id": "cced-5e5d-5eb4-2c2e",
    "Name": "Fearsome (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit is within 6\" of this unit, each time that enemy unit takes a Battle-shock or Leadership test, subtract 1 from the result."
  },
  {
    "Id": "df2a-e614-ef31-36b5",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "abbf-56ef-4bbb-e773",
    "Name": "Interceptor",
    "Type": "Faction",
    "Description": "Each time this model makes a ranged attack that targets a unit that can FLY, add 1 to the Hit roll."
  },
  {
    "Id": "c40f-f815-5f90-f1f3",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "9574-8920-9f24-b62b",
    "Name": "Bomb Rack",
    "Type": "Faction",
    "Description": "Each time this model ends a Normal move, you can select one enemy unit it moved across during that move and roll six D6: for each 3+, that unit suffers 1 mortal wound."
  },
  {
    "Id": "7bab-2277-35bc-d39a",
    "Name": "Mischief Makers (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit (excluding MONSTERS and VEHICLES) is within 6\" of this unit, each time a model in that unit makes a melee attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "517d-f73-5cd8-546f",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "af3c-4edc-36aa-59e8",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following unit:\n■ PLAGUE MARINES"
  },
  {
    "Id": "4bc3-6d49-d99d-ff2c",
    "Name": "Gift of Poxes (Psychic)",
    "Type": "Faction",
    "Description": "While this model is leading a unit, weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability."
  },
  {
    "Id": "7104-86cd-2534-e8ac",
    "Name": "Feculent Despair (Aura, Psychic)",
    "Type": "Faction",
    "Description": "While an enemy unit is within 6\" of this model, each time that unit takes a Battle-shock test, subtract 1 from that test."
  },
  {
    "Id": "b147-cef6-450f-b85e",
    "Name": "Infectious Bloodshed",
    "Type": "Faction",
    "Description": "Each time this unit makes a Charge move, until the end of the turn, weapons equipped by models in this unit have the [SUSTAINED HITS 1] ability."
  },
  {
    "Id": "75e4-8863-1d83-ea57",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "22b2-d9d0-69ed-4540",
    "Name": "Diseased icon",
    "Type": "Faction",
    "Description": "Melee weapons in the bearer's unit have the [LETHAL HITS] ability."
  },
  {
    "Id": "2299-52b3-c7dc-dcaa",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "f412-30f2-fadf-2a88",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n- ^^**Plague Marines^^**"
  },
  {
    "Id": "fdc4-152d-ed64-4ff7",
    "Name": "Gift of Poxes",
    "Type": "Faction",
    "Description": "Add 3\" to the range of this model's Contagion Range."
  },
  {
    "Id": "4acf-b450-25c4-fe66",
    "Name": "Shroud of Disease",
    "Type": "Faction",
    "Description": "While this model is leading a unit, that unit cannot be targeted by ranged attacks unless the attacking unit is within 18\"."
  },
  {
    "Id": "7f4f-bece-9a6f-8b55",
    "Name": "Icon of Despair (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit is within 6\" of the bearer, worsen the Leadership characteristic of models in that unit by 1."
  },
  {
    "Id": "7aed-4e14-3cab-0b68",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "5bca-e25c-b5a7-0670",
    "Name": "Daemon Lord of Nurgle (Aura)",
    "Type": "Faction",
    "Description": "While a friendly ^^Plague Legions^^ unit is within 6\" of this model, add 1 to the Toughness characteristic of models in that unit."
  },
  {
    "Id": "dbf3-eb68-32ee-5cac",
    "Name": "Nurgle’s Rot (Psychic)",
    "Type": "Faction",
    "Description": "At the end of your Movement phase, you can select one enemy unit within 12\" of this model. Until the start of your next Movement phase, that unit is rotted. While a unit is rotted, subtract 1 from the Toughness characteristic of models in that unit."
  },
  {
    "Id": "dad6-3637-d427-efee",
    "Name": "Damaged: 1-7 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-7 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "8f4b-540c-f945-eafa",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "2179-a9f0-2bbf-85a5",
    "Name": "Virulent Blessing (Psychic)",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, you can select one enemy unit within 24\" of and visible to this model. Until the end of the phase, each time an attack made by a ^^**Plague Legions^^** model is allocated to a model in that unit, add 1 to the Damage characteristic of that attack."
  },
  {
    "Id": "feaf-5fb0-18a5-2834",
    "Name": "Deluge of Nurgle (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit is within 6\" of this model, subtract 2 from the Move characteristic and subtract 1 from the Objective Control characteristic of models in that unit."
  },
  {
    "Id": "5b12-fe98-38b5-dc24",
    "Name": "Damaged: 1-7 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-7 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "0e97-eb55-217b-80da",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "96e0-4568-6c3f-47dc",
    "Name": "Infected Outbreak",
    "Type": "Faction",
    "Description": "If you control an objective marker at the end of your Command phase and this unit is within range of that objective marker, that objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn."
  },
  {
    "Id": "700d-3310-5e09-f754",
    "Name": "Daemonic Icon",
    "Type": "Faction",
    "Description": "Models in the bearer’s unit have a Leadership characteristic of 6+."
  },
  {
    "Id": "051c-0336-f156-ca63",
    "Name": "Instrument of Chaos",
    "Type": "Faction",
    "Description": "Add 1 to Charge rolls made for the bearer’s unit."
  },
  {
    "Id": "5a11-1380-7c06-d39b",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "8da3-6aff-8906-96b2",
    "Name": "Death’s Heads",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this unit has shot, select one enemy unit hit by one or more of those attacks. Until the end of the turn, each time a friendly NURGLE LEGIONES DAEMONICA unit makes an attack that targets that unit, you can re-roll the Wound roll."
  },
  {
    "Id": "96fc-d0b7-506d-6eec",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "fc0f-94b2-caf8-5c06",
    "Name": "Grotesque Regeneration",
    "Type": "Faction",
    "Description": "At the end of each phase, if a Beasts of Nurgle model in this unit has lost any wounds but is not destroyed, that model regains all of its lost wounds."
  },
  {
    "Id": "af2e-e08a-47af-6b32",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "d2a9-5017-31c5-378e",
    "Name": "Mischief Makers (Aura)",
    "Type": "Faction",
    "Description": "Each time an enemy unit (excluding ^^Titanic^^ units) within Engagement Range of one or more units with this ability is selected to fight, until the end of the phase, each time a model in that enemy unit makes a melee attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "2f84-c15e-e6e9-b7f8",
    "Name": "Explosive Blight",
    "Type": "Faction",
    "Description": "In your Shooting phase, each time this model makes an attack that destroys an enemy unit, before removing the last model in that unit from play, roll a D6, adding 1 to the result if that unit is Afflicted; on a 5+, each enemy unit within 6\" of that model is Afflicted until the start of your next turn."
  },
  {
    "Id": "4770-c987-e24d-7f8b",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "21cf-1329-2644-6007",
    "Name": "Droning Chorus",
    "Type": "Faction",
    "Description": "Ranged weapons equipped by models in the bearer’s unit have the [ASSAULT] ability."
  },
  {
    "Id": "1054-788a-d791-d9f2",
    "Name": "Insectile Murmuration",
    "Type": "Faction",
    "Description": "Each time a model in the bearer’s unit makes an attack that targets a unit that is within Contagion Range of one or more DEATH GUARD units from your army, re‑roll a Wound roll of 1."
  },
  {
    "Id": "e245-8e53-4eb5-b72f",
    "Name": "Rejuvenating Swarm",
    "Type": "Faction",
    "Description": "At the end of each phase, the bearer regains all of its lost wounds."
  },
  {
    "Id": "40cb-8e8d-0f78-1843",
    "Name": "Plagueveil",
    "Type": "Faction",
    "Description": "While the bearer’s unit is within range of one or more objective markers that you control, that unit can only be selected as the target of a ranged attack if the attacking model is within 18\"."
  },
  {
    "Id": "cd5a-0fc0-fe54-6b9d",
    "Name": "Daemon Weapon of Nurgle",
    "Type": "Faction",
    "Description": "Each time the bearer makes a melee attack, an unmodified Hit roll of 5+ scores a Critical Hit."
  },
  {
    "Id": "42cb-ad3c-fc75-34f2",
    "Name": "Furnace of Plagues",
    "Type": "Faction",
    "Description": "Add 1 to the Strength and Attacks characteristics of the bearer's melee weapons, and the bearer's melee weapons have the Devastating Wounds abilty."
  },
  {
    "Id": "ca20-9172-4038-5c01",
    "Name": "Lord of the Walking Pox",
    "Type": "Faction",
    "Description": "If the bearer is leading a ^^**Poxwalkers**^^ unit, and is in Strategic Reserves, for the purposes of setting up that unit on the battlefield, treat the current battle round as the third battle round."
  },
  {
    "Id": "4ab4-3b9c-be82-adce",
    "Name": "Revolting Regeneration",
    "Type": "Faction",
    "Description": "The bearer has the Feel No Pain 5+ ability."
  },
  {
    "Id": "7c3d-f406-1c82-3f2d",
    "Name": "Eye of Affliction",
    "Type": "Faction",
    "Description": "Ranged weapons equipped by model's in the bearer's unit have the [Ignores Cover] ability while targeting an Afflicted enemy unit."
  },
  {
    "Id": "3e63-c4f4-87ba-6edc",
    "Name": "Talisman of Burgeoning",
    "Type": "Faction",
    "Description": "While the bearer is leading a ^^**Poxwalkers**^^ unit, add 1 to the Toughness characteristic of ^^**Poxwalkers**^^ models in that unit."
  },
  {
    "Id": "a31b-3f7d-9eb5-423a",
    "Name": "Witherbone Pipes",
    "Type": "Faction",
    "Description": "While the bearer is leading a ^^**Poxwalkers**^^ unit, add 1 to the Objective Control characteristic of models in that unit, and each time that unit takes a Battle-shock or Leadership test, add 1 to that test."
  },
  {
    "Id": "f464-5e4d-63ab-9472",
    "Name": "Sorrowsyphon",
    "Type": "Faction",
    "Description": "While the bearer is leading a ^^**Poxwalkers**^^ unit, add 1 to the Damage characteristic of the bearer's Plague Wind weapon. Each time the bearer makes one or more attacks with a Plague Wind weapon, after the bearer's unit has resolved its attacks, D3 Bodyguard models from the bearer's unit are destroyed."
  },
  {
    "Id": "613e-8b3e-17e5-a710",
    "Name": "Face of Death",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, each enemy unit within Engagement Range of the bearer's unit must take a Battle-shock test."
  },
  {
    "Id": "2a65-6c5c-0861-eb9f",
    "Name": "Vile Vigour",
    "Type": "Faction",
    "Description": "While the bearer is leading a unit, add 1\" to the Movement characteristics of models in that unit and you can re-roll Advance rolls made for that unit."
  },
  {
    "Id": "2781-1569-1803-d365",
    "Name": "Warprot Talisman",
    "Type": "Faction",
    "Description": "Once per battle, at the end of your opponent's turn, if the bearer's unit is not within Engagement Range of one or more enemy units, you can remove it from the battle field and place it into Strategic Reserves."
  },
  {
    "Id": "8e08-188d-784c-917b",
    "Name": "Helm of the Fly King ",
    "Type": "Faction",
    "Description": "While the bearer is leading a unit, models in that unit cannot be targeted by ranged attacks unless the attacking model is within 18\"."
  },
  {
    "Id": "6a4d-7777-cded-5443",
    "Name": "Arch Contaminator",
    "Type": "Faction",
    "Description": "While the bearer's unit is within range of an objective marker you control, each time a model in the bearer's unit makes an attack, you can re-roll the Wound roll."
  },
  {
    "Id": "64d6-38d3-6aac-a57e",
    "Name": "Bilemaw Blight",
    "Type": "Faction",
    "Description": "At the start of your Shooting phase, until the end of the phase, add 12\" to the Range characteristics of the bearer's Plague Wind weapon."
  },
  {
    "Id": "7411-0241-44c2-3020",
    "Name": "Shriekworm Familiar",
    "Type": "Faction",
    "Description": "Once per battle round, you can target the bearer's unit with the Fire Overwatch Stratagem for 0CP."
  },
  {
    "Id": "b5ee-e208-d8bc-8fad",
    "Name": "Tendrilous Emissions",
    "Type": "Faction",
    "Description": "While the bearer is within 3\" of one or more friendly ^^**Death Guard Vehicle**^^ units, the bearer has the Lone Operative ability, and each time one of those ^^**Vehicle**^^ units makes a ranged attack that targets an enemy unit visible to the bearer, re-roll a Wound roll of 1."
  },
  {
    "Id": "ecc0-019a-6cf5-eb8c",
    "Name": "Final Ingredient",
    "Type": "Faction",
    "Description": "Once per battle, after the bearer's unit has fought, if one or more ^^**Character**^^ models were destroyed by those attacks, select one Plague. Until the end of the battle, if an enemy unit is Afflicted, that unit has the effect of the selected Plague in addition to any other."
  },
  {
    "Id": "0c30-5b86-c670-0830",
    "Name": "Visions of Virulence",
    "Type": "Faction",
    "Description": "While an enemy unit is enfeebled by the bearer's Pestilent Fallout ability, that unit is also Afflicted."
  },
  {
    "Id": "24a1-b435-231d-d5df",
    "Name": "Needle of Nurgle",
    "Type": "Faction",
    "Description": "Each time the bearer uses its Tainted Narthecium ability, you can return up to D3 destroyed models to the bearer's unit (instead of 1)."
  },
  {
    "Id": "ee05-1b1d-3465-53ae",
    "Name": "Cornucophagus",
    "Type": "Faction",
    "Description": "In the Declare Battle Formations step, select one Plague. Until the end of the battle, while an enemy is within Contagion Range of the bearer, that enemy unit has the effect of that Plague in addition to any other."
  },
  {
    "Id": "4e12-0cc8-e5d8-f248",
    "Name": "Beckoning Blight",
    "Type": "Faction",
    "Description": "Each time a ^^**Plague Legions^^** unit from your army is set up on the battle field using the Deep Strike ability, if it is set up wholly within 12\" of the bearer, it can be set up anywhere that is more than 6\" horizontally away from any enemy models, instead of more than 9\"."
  },
  {
    "Id": "4eeb-5bad-c9ef-cd9a",
    "Name": "Fell Harvester",
    "Type": "Faction",
    "Description": "Add 2 to the Attacks characteristic of the bearer's melee weapons."
  },
  {
    "Id": "5d0c-6610-28af-b290",
    "Name": "Entropic Knell",
    "Type": "Faction",
    "Description": "In the Battle-shock step of your opponent's Command phase, each enemy unit within 6\" of the bearer that is below its Starting Strength must take a Battle-shock test, subtracting 1 from that test."
  },
  {
    "Id": "b921-e12e-96d7-8ce4",
    "Name": "Tome of Bounteous Blessings",
    "Type": "Faction",
    "Description": "Each time a ^^**Plague Legions^^** unit within 12\" of the bearer takes a Battle-shock test, add 1 to that test and, if that test is passed, one model in that unit regains up to D3 lost wounds (if that unit is a ^^**Battleline^^** unit and that test is passed, up to D3 destroyed models can be returned to that unit instead)."
  },
  {
    "Id": "2e70-7085-af42-e162",
    "Name": "Chaos Lord",
    "Type": "Faction",
    "Description": "Description: While this model is leading a unit, each time a model in that unit makes an attack, re-roll a Hit roll of 1."
  },
  {
    "Id": "8e2-8f3e-c390-791a",
    "Name": "Dessication Conduit (Aura)",
    "Type": "Faction",
    "Description": "Description: While an enemy unit is within Contagion Range of this model, at the end of the turn, roll one D6: on a 4+, that enemy unit suffers D3 mortal wounds."
  },
  {
    "Id": "9af1-f954-9e43-747f",
    "Name": "Damaged: 1-5 wounds remaining",
    "Type": "Faction",
    "Description": "Description: While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "b102-6947-89c2-991f",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "Description: This model can be attached to the following unit: ^^**Plague Marines^^**\n*You can attach this model to a ^^**Plague Marines^^** unit, even if one other Leader unit has already been attached to it (you cannot attach more than one of the same Leader to the same unit). If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths.*"
  },
  {
    "Id": "ea42-7d15-fd81-73d6",
    "Name": "Nurgle's Gift (Aura)",
    "Type": "Faction",
    "Description": "If your Army Faction is DEATH GUARD, while an enemy unit is within Contagion Range of one or more ^^**Death Guard^^** units from your army, it is Afflicted.\n\nCONTAGION RANGE\n1st Battle Round: Contagion Range = 3\"\n2nd Battle Round: Contagion Range = 6\"\n3rd Battle Round Onwards: Contagion Range = 9\"\n\n\n**AFFLICTED**\n\n\nDuring the Declare Battle Formations step, select one of the Plagues below. Until the end of the battle, while an enemy unit is Afflicted, subtract 1 from the Toughness characteristic of models in that unit, and that unit has the effect of your chosen Plague.\n\n\n**Skullsquirm Blight**\nEach time a model in this unit makes an attack, subtract 1 from the Hit roll.\n\n\n**Rattlejoint Ague**\nWorsen the Save characteristic of models in this unit by 1.\n\n\n**Scabrous Soulrot**\nWorsen the Move, Leadership and Objective Control characteristics of models in this unit by 1 (this rule can only worsen a model's Objective Control characteristic to a minimum of 1)."
  },
  {
    "Id": "ef56-93b2-259a-b831",
    "Name": "Helbrute fist",
    "Type": "Faction",
    "Description": "Range: Melee\nA: 5\nWS: 3+\nS: 12\nAP: -2\nD: 3\nKeywords: -"
  },
  {
    "Id": "ea62-7fcf-189e-9b92",
    "Name": "Howling Horde",
    "Type": "Faction",
    "Description": "Each time an enemy unit has shot, if one or more models from this unit were destroyed as a result of those attacks, this unit can make a Horde move. To do so, roll one D6; this unit can move a number of inches up to the result, but this unit must finish that move as close as possible to the nearest enemy unit (excluding AIRCRAFT). When doing so, those models can be moved within Engagement Range of that enemy unit. This unit cannot make a Horde move while it is Battle-shocked."
  },
  {
    "Id": "e7fe-8395-4000-9dcd",
    "Name": "For the Dark Gods",
    "Type": "Faction",
    "Description": "At the end of your Command phase, if this unit is within range of an objective marker you control, that objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn."
  },
  {
    "Id": "0fee-292f-26f8-db25",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ ACCURSED CULTISTS\n■ CULTIST MOB"
  },
  {
    "Id": "535d-d041-9b3f-bed1",
    "Name": "Faithful Flock",
    "Type": "Faction",
    "Description": "While this unit is leading a unit and contains a CULT DEMAGOGUE model, models in that unit have a 5+ invulnerable save."
  },
  {
    "Id": "092f-e3f9-1143-96f7",
    "Name": "Dark Ritual",
    "Type": "Faction",
    "Description": "Once per battle, in your Command phase, if this unit contains a CULT DEMAGOGUE model, it can use this ability. If it does, until the end of the turn, this unit can declare a charge in a turn in which it Advanced and each time a model in this unit makes an attack, add 1 to the Hit roll and add 1 to the Wound roll."
  },
  {
    "Id": "156a-173b-6611-f9ad",
    "Name": "Chaos icon",
    "Type": "Faction",
    "Description": "Each time the bearer’s unit takes a Leadership test for the Dark Pacts ability, you can re-roll that test."
  },
  {
    "Id": "eb15-6894-696d-3d36",
    "Name": "Twisted Defence Force",
    "Type": "Faction",
    "Description": "While this unit is within range of an objective marker, each time a ranged attack targets this unit, models in this unit have the Benefit of Cover against that attack."
  },
  {
    "Id": "d7a6-f651-21d9-1732",
    "Name": "Bestial Raiders",
    "Type": "Faction",
    "Description": "If this unit begins the game in Strategic Reserves, it can be set up in the Reinforcements step of your first, second or third Movement phase, regardless of any mission rules. If this unit is in Strategic Reserves, for the purposes of setting it up on the battlefield, treat the current battle round number as being one higher than it actually is."
  },
  {
    "Id": "b8d1-dc1c-a3b8-58a2",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This unit can be attached to the following unit:\n■ TRAITOR GUARDSMAN SQUAD"
  },
  {
    "Id": "0c80-eeab-80a6-651e",
    "Name": "Brutal Example",
    "Type": "Faction",
    "Description": "Once per turn, while this unit is leading a unit and contains a TRAITOR ENFORCER model, you can target that unit with the Fire Overwatch Stratagem for 0CP, and can do so even if you have already targeted a different unit from your army with that Stratagem this phase. Each time you use this ability, one Bodyguard model in that unit is destroyed."
  },
  {
    "Id": "78ed-1f24-2794-4cb8",
    "Name": "Mutated Bodyguard",
    "Type": "Faction",
    "Description": "While this unit contains a Traitor Ogryn model, CHARACTER models in this unit have the Feel No Pain 4+ ability."
  },
  {
    "Id": "459b-0af2-1d01-bfd1",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This unit's TRAITOR ENFORCER model has a 5+ invulnerable save"
  },
  {
    "Id": "7449-2b99-da4f-d0d2",
    "Name": "Fiery Faith",
    "Type": "Faction",
    "Description": "While this model is leading a unit, you can re-roll Leadership tests taken for that unit."
  },
  {
    "Id": "f3d9-8358-aeef-e021",
    "Name": "Cursed Flames",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one enemy INFANTRY unit hit by one or more of those attacks. That unit must make a Battle-shock test."
  },
  {
    "Id": "a6d3-7f56-982b-5c98",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ ACCURSED CULTISTS\n■ CULTIST MOB"
  },
  {
    "Id": "69bc-8f74-5ef0-5717",
    "Name": "For the Dark Gods",
    "Type": "Faction",
    "Description": "At the end of your Command phase, if this unit is within range of an objective marker  you control, that objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn."
  },
  {
    "Id": "a77b-9ae3-87de-b9af",
    "Name": "Brutal Example",
    "Type": "Faction",
    "Description": "While this model is leading a unit, you can target that unit with the Insane Bravery Stratagem for 0CP, and can do so even if another unit from your army has already been targeted with that Stratagem this phase. Each time you use this ability, one Bodyguard model in that unit is destroyed."
  },
  {
    "Id": "1a03-feea-04f7-83ca",
    "Name": "Enforcer",
    "Type": "Faction",
    "Description": "This model's unit is eligible to declare a charge in a turn in which it Fell Back."
  },
  {
    "Id": "825d-1f96-099c-949e",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ TRAITOR GUARDSMEN SQUAD\n■ RENEGADE HEAVY WEAPONS SQUAD"
  },
  {
    "Id": "3897-bc30-2201-eb85",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "00ff-4dba-2b4b-ab5a",
    "Name": "Covering Fire",
    "Type": "Faction",
    "Description": "Each time you target this unit with the Fire Overwatch Stratagem, while resolving that Stratagem, hits are scored on unmodified Hit rolls of 5+."
  },
  {
    "Id": "b369-99cd-18af-71b0",
    "Name": "Beastmaster",
    "Type": "Faction",
    "Description": "While this unit contains an Ogryn Pack Master model, you can re-roll Charge rolls made for this unit, and each time a Chaos Mauler Hound model in this unit makes an attack, re-roll a Hit roll of 1."
  },
  {
    "Id": "5520-55bc-a753-668d",
    "Name": "Ogryn Combat Stimms",
    "Type": "Faction",
    "Description": "Each time a model in this unit is destroyed by a melee attack, if that model has not fought this phase, roll one D6. On a 4+, do not remove it from play; that destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play."
  },
  {
    "Id": "ca07-28e7-39c7-d97d",
    "Name": "Wall of Muscle",
    "Type": "Faction",
    "Description": "Each time an attack is allocated to a model in this unit, subtract 1 from the Damage characteristic of that attack."
  },
  {
    "Id": "3109-f3c1-b124-41e3",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n■ ACCURSED CULTISTS\n■ CULTIST MOB\n■ NEGAVOLT CULTISTS"
  },
  {
    "Id": "0a20-7eaa-5aac-0431",
    "Name": "Cursed Wardings (Psychic)",
    "Type": "Faction",
    "Description": "While this model is leading a unit, models in that unit have the Feel No Pain 4+ ability against Psychic Attacks."
  },
  {
    "Id": "e3bb-ec81-0a02-babf",
    "Name": "Psychic Barrier (Psychic)",
    "Type": "Faction",
    "Description": "At the start of your opponent’s Shooting phase, you can roll one D6: on a 1, this PSYKER’s unit suffers D3 mortal wounds; on a 2+, until the end of the phase, models in this PSYKER’s unit have a 4+ invulnerable save."
  },
  {
    "Id": "1682-2183-62c6-a85d",
    "Name": "Fearsome (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit is within 6\" of this unit, each time that enemy unit takes a Battle-shock or Leadership test, subtract 1 from the result."
  },
  {
    "Id": "b332-e451-1446-3e27",
    "Name": "Mischief Makers (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit (excluding MONSTERS and VEHICLES) is within 6\" of this unit, each time a model in that unit makes a melee attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "1b26-8985-6167-2e80",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "38e9-65f0-26f2-e134",
    "Name": "Voltagheist Field",
    "Type": "Faction",
    "Description": "Each time this unit ends a Charge move, select one enemy unit within Engagement Range of it and roll one D6 for each model in this unit: for each 4+, that enemy unit suffers 1 mortal wound."
  },
  {
    "Id": "5a5e-0a19-37d7-1802",
    "Name": "Servants of the Abyss",
    "Type": "Faction",
    "Description": "If a unit from your army with the Leader ability can be attached to a CULTIST MOB, it can be attached to this unit instead."
  },
  {
    "Id": "e9f3-32df-29b0-65f9",
    "Name": "Brutal assault weapon",
    "Type": "Faction",
    "Description": "Range: Melee\nA: 2\nWS: 4+\nS: 3\nAP: 0\nD: 1\nKeywords: -"
  },
  {
    "Id": "45ad-1ebf-4b69-61ea",
    "Name": "Close combat weapon",
    "Type": "Faction",
    "Description": "Range: Melee\nA: 1\nWS: 4+\nS: 3\nAP: 0\nD: 1\nKeywords: -"
  },
  {
    "Id": "9034-2462-6822-f020",
    "Name": "Autogun",
    "Type": "Faction",
    "Description": "Range: 24\"\nA: 1\nBS: 4+\nS: 3\nAP: 0\nD: 1\nKeywords: Rapid Fire 1"
  },
  {
    "Id": "68a4-911a-c03c-2cf4",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units:\n- **^^Flawless Blades^^**"
  },
  {
    "Id": "5909-fd1b-aabd-8cf6",
    "Name": "Duellist’s Hubris",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, if this model is not leading a unit, until the end of the phase, it has the Fights First ability."
  },
  {
    "Id": "a7c1-b492-fe9-85eb",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "01a5-5e86-b905-a68c",
    "Name": "A Challenge Worthy of Skill",
    "Type": "Faction",
    "Description": "Each time this model makes an attack that targets a **^^Character, Monster^^** or **^^Walker^^** unit, you can re-roll the Hit roll and re-roll the Wound roll."
  },
  {
    "Id": "93e3-f094-ef34-11e6",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "444e-1e09-a6c8-f8ec",
    "Name": "Daemonic Poisons",
    "Type": "Faction",
    "Description": "In your Shooting phase and the Fight phase, after this model has finished making its attacks, select one enemy unit hit by one or more of those attacks. Until the end of the battle, that enemy unit is poisoned. At the start of each player's Command phase, roll one D6 for each poisoned enemy unit on the battlefield: on a 4+, that enemy unit suffers D3 mortal wounds."
  },
  {
    "Id": "ca20-91b8-b9e8-c14d",
    "Name": "Daemon Prince of Slaanesh",
    "Type": "Faction",
    "Description": "At the start of your opponent's Command phase, select one of the abilities in the Daemon Prince of Slaanesh section. Until the start of your opponent's next Command phase, this model has that ability."
  },
  {
    "Id": "af1c-9f7a-30bf-7eb0",
    "Name": "Damaged: 1-6 Wounds Remaining",
    "Type": "Faction",
    "Description": "While this model has 1-6 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "498c-ad14-6e2b-bbfb",
    "Name": "Supreme Commander",
    "Type": "Faction",
    "Description": "If this model is in your army, it must be your **^^Warlord^^**."
  },
  {
    "Id": "3a41-f55f-c44f-9782",
    "Name": "Beguiling Form",
    "Type": "Faction",
    "Description": "Each time a model makes an attack that targets this unit, subtract 1 from the Hit roll."
  },
  {
    "Id": "62c3-70df-90c4-5136",
    "Name": "Daemonic Speed",
    "Type": "Faction",
    "Description": "This model has the Fights First ability."
  },
  {
    "Id": "24ce-3caf-5629-156e",
    "Name": "Enthralling Hypnosis (Aura)",
    "Type": "Faction",
    "Description": "While an enemy unit is within 6\" of this model, each time that unit is selected to Fall Back, it must take a Leadership test. If that test is failed, that unit must Remain Stationary this phase instead."
  },
  {
    "Id": "cdfd-857f-d981-a3b2",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "197e-a2ea-b468-48d9",
    "Name": "Perfectionists",
    "Type": "Faction",
    "Description": "While this model is leading a unit, weapons equipped by models in that unit have the **^^[LETHAL HITS]^^** ability."
  },
  {
    "Id": "828a-cdf4-e64a-cf75",
    "Name": "Euphoric Strikes",
    "Type": "Faction",
    "Description": "Once per battle, at the start of the Fight phase, this model can use this ability. If it does so, until the end of the phase, add 3 to the Attacks characteristic of melee weapons equipped by this model and improve the Armour Penetration characteristic of those weapons by 1."
  },
  {
    "Id": "3cf5-ff3c-e78d-51c8",
    "Name": "Lord of the Host",
    "Type": "Faction",
    "Description": "If this model is attached to an **^^Emperor's Children Battleline^^** unit during the Declare Battle Formations step, this model has the Infiltrators and Scouts 6\" ability."
  },
  {
    "Id": "8799-26c2-ca52-3969",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units: **^^Infractors; Tormentors^^**"
  },
  {
    "Id": "d91a-febf-366b-329d",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "7e47-d44e-0c0d-86d4",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units: **^^Emperor's Children Terminator Squad; Noise Marines^^**"
  },
  {
    "Id": "8fdb-0d21-37f4-ecca",
    "Name": "Obsessive Annunciation",
    "Type": "Faction",
    "Description": "While this model is leading a unit, ranged weapons equipped by that unit have the [SUSTAINED HITS 1] ability."
  },
  {
    "Id": "f8bf-39ff-4779-40f2",
    "Name": "Doom Siren",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model's unit has shot, select one enemy **^^Infantry^^** unit hit by one or more of those attacks and roll three D6: for each 4+, that enemy unit suffers 1 mortal wound. If an enemy suffers one or more mortal wounds as a result of this ability, it must take a Battle-shock test."
  },
  {
    "Id": "3d6e-dbc8-ccd2-cb3d",
    "Name": "Leader",
    "Type": "Faction",
    "Description": "This model can be attached to the following units: **^^Infractors; Noise Marines; Tormentors^^**"
  },
  {
    "Id": "cefa-0b6a-caf2-7790",
    "Name": "Warped Interference (Psychic)",
    "Type": "Faction",
    "Description": "While this model is leading a unit, each time a ranged attack targets that unit, models in it have the Benefit of Cover against that attack."
  },
  {
    "Id": "7485-ffb5-b729-f8b2",
    "Name": "Wracking Agonies (Psychic)",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this model has shot, select one INFANTRY unit hit by one or more of those attacks made with its Agonising Energies. Until the start of your next turn, that unit is wracked with agonies. While a unit is wracked with agonies, subtract 2\" from its Move characteristic and subtract 2 from charge rolls made for it."
  },
  {
    "Id": "4e7c-c6d1-7cdf-36f8",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "e6ea-7b81-ac62-18b5",
    "Name": "Lord of Excess",
    "Type": "Faction",
    "Description": "While this model is within 3\" of one or more friendly **^^Slaanesh Infantry^^**, this model has the Lone Operative ability."
  },
  {
    "Id": "222f-a01c-620b-a089",
    "Name": "Excessive Vigour (Aura)",
    "Type": "Faction",
    "Description": "While a friendly **^^Slaanesh^^** unit is within 6\" of this model, if that unit made a Charge move this turn, improve the Armour Penetration characteristic of melee weapons equipped by that unit by 1."
  },
  {
    "Id": "9a99-ab28-dcc6-bc4c",
    "Name": "Ecstatic Death",
    "Type": "Faction",
    "Description": "If this model is destroyed by a melee attack, if it has not fought this phase, roll one D6: on a 2+, do not remove it from play. This model can fight after the attacking unit has finished making its attacks, and is then removed from play."
  },
  {
    "Id": "f4c8-5276-aa27-6b2e",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "33de-9a37-baa6-5a99",
    "Name": "Daemonic Destruction",
    "Type": "Faction",
    "Description": "Each time this model ends a Charge move, select one enemy unit within Engagement Range of this model and roll one D6 for each of this model's remaining wounds: for each 4+, that enemy unit suffers 1 mortal wound (to a maximum of 6 mortal wounds)."
  },
  {
    "Id": "913e-136d-35d5-5c63",
    "Name": "Stimulated by Pain",
    "Type": "Faction",
    "Description": "Each time an attack is allocated to this model, subtract 1 from the Damage characteristic of that attack."
  },
  {
    "Id": "54b6-52b7-2959-e73b",
    "Name": "Icon of Excess",
    "Type": "Faction",
    "Description": "At the end of your Shooting phase or the Fight phase, if the bearer's unit destroyed one or more enemy units this phase, the bearer's unit takes a Leadership test. If that test is passed, you gain 1CP."
  },
  {
    "Id": "b7d5-8896-8643-e2a9",
    "Name": "Objective Defiled",
    "Type": "Faction",
    "Description": "At the end of your Command phase, if this unit is within range of an objective marker you control, that objective marker remains under your control until your opponent's Level of Control over that objective marker is greater than yours at the end of a phase."
  },
  {
    "Id": "c48a-62e2-8628-b37d",
    "Name": "Excessive Assault",
    "Type": "Faction",
    "Description": "Each time a model in this unit targets an enemy unit with a melee attack, re-roll a Wound roll of 1. If that enemy unit is within range of an objective marker, you can re-roll the Wound roll instead."
  },
  {
    "Id": "f61d-01f1-ace6-1243",
    "Name": "Icon of Excess",
    "Type": "Faction",
    "Description": "At the end of your Shooting phase or the Fight phase, if the bearer's unit destroyed one or more enemy units this phase, the bearer's unit takes a Leadership test. If that test is passed, you gain 1CP."
  },
  {
    "Id": "49c8-2d8a-5a03-49bb",
    "Name": "Daemonic Patrons",
    "Type": "Faction",
    "Description": "Each time this unit is selected to fight, it can call upon daemonic patrons. If it does, until the end of the phase, each time a model in this unit makes an attack. an unmodified Wound roll of 3+ scores a Critical Wound. At the end of the Fight phase, if this unit called upon daemonic patrons this phase and no enemy models were destroyed by attacks made by models in this unit this phase, one model in this unit is destroyed."
  },
  {
    "Id": "d841-9707-823f-515a",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "9123-44f5-7680-f937",
    "Name": "Lethal Obsession",
    "Type": "Faction",
    "Description": "In your Shooting phase, each time this unit is selected to shoot, if it makes one or more shooting attacks and all of those attacks target the same enemy unit, until the end of the turn, each time this unit declares a charge, if that enemy unit is a target of that charge, you can re-roll the Charge roll."
  },
  {
    "Id": "ef95-cb2b-c09f-06bc",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 4+ invulnerable save."
  },
  {
    "Id": "d63b-edb5-4839-ab4f",
    "Name": "Scuttling Horrors",
    "Type": "Faction",
    "Description": "Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9\" of this unit, this unit can make a Normal move of up to 6\"."
  },
  {
    "Id": "1e99-a2be-7d7b-1972",
    "Name": "Assault Ramp",
    "Type": "Faction",
    "Description": "Each time a unit disembarks from this model after it has made a Normal move, that unit is still eligible to declare a charge this turn."
  },
  {
    "Id": "b146-5f0b-e066-d4c4",
    "Name": "Damaged: 1-5 wounds remaining",
    "Type": "Faction",
    "Description": "While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll."
  },
  {
    "Id": "a254-9b52-cf64-eac2",
    "Name": "Terrifying Crescendo",
    "Type": "Faction",
    "Description": "In your Shooting phase, after this unit has shot, select one enemy unit hit by one or more of those attacks. Until the start of your next Shooting phase, each time a Battle-shock or Leadership test is taken for that enemy unit, subtract 1 from that test."
  },
  {
    "Id": "fce6-a633-eb26-3405",
    "Name": "Airborne Predator",
    "Type": "Faction",
    "Description": "Each time this model ends a Normal move, you can select one enemy unit that it moved over during that move and roll two D6, adding 1 to each result if that enemy unit can ^^FLY^^: for each 4+, that enemy unit suffers D3 mortal wounds."
  },
  {
    "Id": "4207-4a8e-73c2-9ffe",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "c3f4-464b-3d82-f42f",
    "Name": "Glutton for Punishment",
    "Type": "Faction",
    "Description": "Each time this model makes an attack, if it is below its Starting Strength, add 1 to the Hit roll. If this model is also Below Half-Strength, add 1 to the Wound roll as well."
  },
  {
    "Id": "bf88-bb12-1f57-4701",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 5+ invulnerable save."
  },
  {
    "Id": "629b-52e7-f21d-1c5f",
    "Name": "Assault Vehicle",
    "Type": "Faction",
    "Description": "Units can disembark from this **^^Vehicle**^^ after it has Advanced. Units that do so count as having made a Normal move that phase, and cannot declare a charge in the same turn, but can otherwise act normally."
  },
  {
    "Id": "800d-5ebc-fd66-97b0",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "3b35-7ada-515d-bafb",
    "Name": "No Prey Can Evade",
    "Type": "Faction",
    "Description": "You can re-roll Advance and Charge rolls made for this model."
  },
  {
    "Id": "712d-b14d-a795-ba99",
    "Name": "Monarch of the Hunt",
    "Type": "Faction",
    "Description": "At the start of the first battle round, select one enemy unit to be this model's quarry. Each time this model makes a melee attack that targets its quarry, you can re-roll the Hit roll and you can re-roll the Wound roll. Each time this model's quarry is destroyed, select one new enemy unit to be this model's quarry."
  },
  {
    "Id": "0b08-8e41-f334-df67",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "This model has a 4+ invulnerable save."
  },
  {
    "Id": "30a1-8f15-f406-fa7b",
    "Name": "Daemon Lord of Slaanesh (Aura)",
    "Type": "Faction",
    "Description": "While a friendly ^^**Legions of Excess**^^ unit is within 6\" of this model, improve the Armour Penetration of melee weapons in that unit by 1."
  },
  {
    "Id": "6b94-cd14-0032-418a",
    "Name": "Mesmerising Form",
    "Type": "Faction",
    "Description": "Each time an attack targets this model, subtract 1 from the Hit roll."
  },
  {
    "Id": "7c36-30a7-b3c1-e8a8",
    "Name": "Shining aegis",
    "Type": "Faction",
    "Description": "The bearer has a Save characteristic of 3+."
  },
  {
    "Id": "b21d-e2b2-9f2e-080f",
    "Name": "Horrifying Beauty",
    "Type": "Faction",
    "Description": "At the start of the Fight phase, each enemy unit in Engagement Range of one or more units from your army with this ability must take a Battle-shock test, subtracting 1 from that test if that enemy unit is Below Half-strength."
  },
  {
    "Id": "1ba2-081f-65ac-4077",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "dacf-941e-a9f5-1af2",
    "Name": "Daemonic Icon",
    "Type": "Faction",
    "Description": "Models in the bearer's unit have a Leadership characteristic of 6+."
  },
  {
    "Id": "8432-21e4-e194-f594",
    "Name": "Instrument of Chaos",
    "Type": "Faction",
    "Description": "Add 1 to Charge rolls made for the bearer's unit."
  },
  {
    "Id": "f7ef-dbef-61e8-93b5",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "a4c2-5801-31fa-8504",
    "Name": "Soporific Musk",
    "Type": "Faction",
    "Description": "Each time an enemy unit (excluding ^^**Monsters**^^ and **^^Vehicles**^^) within Engagement Range of one or more units from your army with this ability Falls Back, models in that unit must take Desperate Escape tests. When doing so, if that enemy unit is also Battle-shocked, subtract 1 from each of those Desperate Escape tests."
  },
  {
    "Id": "19ac-8b47-64c3-5543",
    "Name": "Unholy Speed",
    "Type": "Faction",
    "Description": "You can re-roll Advance and Charge rolls made for this unit."
  },
  {
    "Id": "c360-e39c-4d09-0222",
    "Name": "Invulnerable Save",
    "Type": "Faction",
    "Description": "Models in this unit have a 5+ invulnerable save."
  },
  {
    "Id": "2f44-0faf-9294-6a0d",
    "Name": "Daemonic Icon",
    "Type": "Faction",
    "Description": "Models in the bearer's unit have a Leadership characteristic of 6+."
  },
  {
    "Id": "50c4-326e-7b28-e07f",
    "Name": "Instrument of Chaos",
    "Type": "Faction",
    "Description": "Add 1 to Charge rolls made for the bearer's unit."
  },
  {
    "Id": "aa4b-4e4a-c3d3-0770",
    "Name": "Eager to Prove",
    "Type": "Faction",
    "Description": "You can re-roll Charge rolls made for the bearer's unit. While the bearer's unit is your army's Favoured Champions, add 2\" to the Move characteristic of models in that unit."
  },
  {
    "Id": "560a-e6f3-7d09-a9ff",
    "Name": "Repulsed by Weakness",
    "Type": "Faction",
    "Description": "Each time an enemy unit (excluding **^^Monster**^^ and ^^**Vehicle**^^ units) within Engagement Range of the bearer's unit Falls Back, models in that enemy unit must take Desperate Escape tests. When doing so, if the bearer's unit is your army's Favoured Champions, subtract 1 from each of those Desperate Escape tests."
  },
  {
    "Id": "32c0-de60-bd4e-2b51",
    "Name": "Proud and Vainglorious",
    "Type": "Faction",
    "Description": "You can re-roll Battle-shock and Leadership tests taken for the bearer's unit. While the bearer's unit is your army's Favoured Champions, add 1 to the Objective Control characteristics of models in that unit."
  },
  {
    "Id": "821f-8d85-9055-3676",
    "Name": "Slayer of Champions",
    "Type": "Faction",
    "Description": "The bearer's melee weapons have the [^^Precision^^] ability, and each time the bearer makes a melee attack that targets a ^^**Character**^^ unit, improve the Strength and Armour Penetration characteristics of that attack by 1."
  },
  {
    "Id": "4c56-4e2f-a7b2-3fc0",
    "Name": "Faultless Opportunist",
    "Type": "Faction",
    "Description": "You can target the bearer's unit with the Heroic Intervention Stratagem for 0CP; and can do so even if you have already targeted a different unit with that Stratagem this phase."
  },
  {
    "Id": "3cbd-8e1f-507c-08dd",
    "Name": "Blinding Speed",
    "Type": "Faction",
    "Description": "Once per battle, at the start of the Fight phase, the bearer can use this Enhancement. If it does so, until the end of the phase, models in the bearer's unit have the Fights First ability."
  },
  {
    "Id": "3ea6-ce2a-42a5-6f89",
    "Name": "Distortion",
    "Type": "Faction",
    "Description": "Add 1 to the Attacks and Damage characteristics of melee weapons equipped by the bearer."
  },
  {
    "Id": "b831-f86c-6cd2-96e1",
    "Name": "Rise to the Challenge",
    "Type": "Faction",
    "Description": "Once per battle, at the end of the Fight phase, if the bearer is within Engagement Range of three or more enemy models, it can use this Enhancement. If it does, the bearer can fight one additional time. When doing so, you can select one ability using the Exquisite Swordsmanship Detachment rule to apply to those attacks."
  },
  {
    "Id": "fc4e-4bea-0098-fee2",
    "Name": "Sublime Presence",
    "Type": "Faction",
    "Description": "Once per turn, in your Movement phase, the bearer can use this Enhancement. If it does, select one friendly **^^Emperor's Children Transport**^^ that is in Strategic Reserves. Until the end of the phase, for the purposes of setting up that **^^Transport**^^ on the battlefield, treat the current battle round number as being one higher than it actually is."
  },
  {
    "Id": "c223-7cd0-78f8-f484",
    "Name": "Spearhead Striker",
    "Type": "Faction",
    "Description": "Each time the bearer disembarks from a **^^Transport**^^, until the end of the turn, you can re-roll Charge rolls made for the bearer's unit and enemy units cannot use the Fire Overwatch Stratagem to shoot at the bearer's unit."
  },
  {
    "Id": "3855-dbae-4643-b25a",
    "Name": "Accomplished Tactician",
    "Type": "Faction",
    "Description": "Once per turn, in your opponent's Shooting phase, just after an enemy unit has shot, you can select one friendly **^^Emperor's Children**^^ unit within 9\" of the bearer that was hit by one or more of those attacks, then select one friendly **^^Transport**^^ that unit is wholly within 6\" of and is able to embark within. That **^^Emperor's Children**^^ unit can embark in that **^^Transport**^^."
  },
  {
    "Id": "0e1d-825c-7ea8-c0c0",
    "Name": "Heretek Adept",
    "Type": "Faction",
    "Description": "Once per battle round, when a saving throw is failed for a friendly **^^Emperor's Children Vehicle**^^ model within 6\" of the bearer, you can change the Damage characteristic of that attack to 0."
  },
  {
    "Id": "f318-a649-28bc-6e37",
    "Name": "Pledge of Eternal Servitude",
    "Type": "Faction",
    "Description": "The first time the bearer is destroyed, take a Leadership test for the bearer at the end of the phase. if that test is passed, set the bearer back up on the battlefield as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with D6 wounds remaining (up to its Wounds characteristic)."
  },
  {
    "Id": "411d-4f06-0881-a7a2",
    "Name": "Pledge of Dark Glory",
    "Type": "Faction",
    "Description": "While the bearer is leading a unit, improve the Leadership and Objective Control characteristics of models in that unit by 1."
  },
  {
    "Id": "eb20-1323-beb7-f512",
    "Name": "Pledge of Mortal Pain",
    "Type": "Faction",
    "Description": "At the start of your Shooting phase, select one enemy unit within 12\" of and visible to the bearer. That unit must take a Leadership test, subtracting 2 from the result if it is Battle-shocked: if failed, that enemy unit suffers 3 mortal wounds."
  },
  {
    "Id": "3392-de4e-e5a3-b5cb",
    "Name": "Pledge of Unholy Fortune",
    "Type": "Faction",
    "Description": "Once per turn, after making a Hit roll, a Wound roll or a saving throw for a model in the bearer's unit, if the bearer is not Battle-shocked, it can use this Enhancement. If it does, treat the result as an unmodified roll of 6 instead."
  },
  {
    "Id": "461a-e603-b852-5339",
    "Name": "Steeped in Suffering",
    "Type": "Faction",
    "Description": "Each time a model in the bearer's unit makes an attack that targets an enemy unit below its Starting Strength, add 1 to the Hit roll. If that target is also Below Half-Strength, add 1 to the Wound roll as well."
  },
  {
    "Id": "50c7-c357-0b3b-c9a8",
    "Name": "Intoxicating Musk",
    "Type": "Faction",
    "Description": "Each time a melee attack targets the bearer's unit, if the Strength characteristic of that attack is greater than the Toughness characteristic of that unit, subtract 1 from the Wound roll."
  },
  {
    "Id": "b265-7b4a-8766-3360",
    "Name": "Tactical Perfection",
    "Type": "Faction",
    "Description": "After both players have deployed their armies, select up to two **^^Emperor's Children**^^ units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves if you wish, regardless of how many units are already in Strategic Reserves."
  },
  {
    "Id": "0da3-ea21-5ed4-1656",
    "Name": "Loathsome Dexterity",
    "Type": "Faction",
    "Description": "Each time a model in the bearer's unit makes a Normal, Advance or Fall Back move, it can move through enemy models. When doing so, it can move within Engagement Range of such models, but cannot end that move within Engagement Range of them, and any Desperate Escape test is automatically passed."
  },
  {
    "Id": "1d1d-5de4-da76-55ec",
    "Name": "Empyric Suffusion",
    "Type": "Faction",
    "Description": "Once per battle round, you can target one friendly **^^Slaanesh**^^ unit within 6\" of the bearer with the Heroic Intervention Stratagem for 0CP."
  },
  {
    "Id": "f30b-24c9-671a-06ac",
    "Name": "Dark Blessings",
    "Type": "Faction",
    "Description": "Once per battle, just after an enemy unit has selected its targets, the bearer can use this Enhancement. If it does, until the end of the phase, the bearer has a 3+ invulnerable save."
  },
  {
    "Id": "a0cf-fc94-c5f2-83a0",
    "Name": "Possessed Blade",
    "Type": "Faction",
    "Description": "At the start of the battle, select one melee weapon equipped by the bearer; add 1 to the Attacks characteristic of that weapon. In addition, each time the bearer is selected to fight, it can use this Enhancement. If it does, when resolving those attacks add 1 to the Damage characteristic of that weapon and that weapon has the [^^Devastating Wounds^^] and [^^Hazardous^^] abilities."
  },
  {
    "Id": "167a-5a2a-63dd-acb9",
    "Name": "Warp Walker",
    "Type": "Faction",
    "Description": "Each time the bearer's unit Advances, do not make an Advance roll. Instead, until the end of the phase, add 6\" to the Movement characteristic of models in that unit. Each time a model in the bearer's unit makes a Normal, Advance or Fall Back move, it can move through enemy models. When doing so, it can move within Engagement Range of such models, but cannot end that move within Engagement Range of them, and any Desperate Escape test is automatically passed."
  },
  {
    "Id": "1674-23e6-eacf-9624",
    "Name": "Thrill Seekers",
    "Type": "Faction",
    "Description": "If your Army Faction is **^^Emperor's Children^^**, this unit is eligible to shoot and declare a charge in a turn in which it Advanced or Fell Back, but when doing so:\n- It cannot target a unit it was within Engagement Range of at the start of the turn\n- It cannot target a unit that was the target of another unit's charge or attack this phase."
  },
  {
    "Id": "bec5-9e9c-b187-c1c0",
    "Name": "Accursed weapon",
    "Type": "Faction",
    "Description": "Range: Melee\nA: 4\nWS: 3+\nS: 5\nAP: -2\nD: 1\nKeywords: -"
  },
  {
    "Id": "3600-24e5-672c-60e6",
    "Name": "Combi-bolter",
    "Type": "Faction",
    "Description": "Range: 24\"\nA: 2\nBS: 3+\nS: 4\nAP: 0\nD: 1\nKeywords: Rapid Fire 2"
  }
]