[
  {
    "Id": "e8e9-e956-786-d941",
    "Name": "Blessings of the Lady",
    "Type": "Global",
    "Description": "Description: Once deployment is complete, instead of rolling off to determine which player takes the first turn, the Kingdom of Bretonnia army may kneel and pray for the Blessings of the Lady. If it does so, the opposing player counts as having won the roll-off and the Lady’s Blessing is granted, giving all models in the Kingdom of Bretonnia army with this special rule:\n•A 6+ Ward save against any wounds suffered.\n•A 5+ Ward save against any wounds suffered that were caused by an attack with a Strength of 5 or higher.\nNote that if there is no roll-off to determine which player takes the first turn, the Kingdom of Bretonnia army cannot kneel and pray for the Blessing.\nNote also that, should two Kingdom of Bretonnia armies face one another, neither may kneel and pray for the Blessings of the Lady. The Lady will not give her blessings to those that wage internecine wars, and no knight would presume to ask! Losing The Blessing: Unlike other special rules, the Blessings of the Lady can be lost during a game. Any model or unit that flees, or any character that refuses a challenge, will immediately lose this special rule.\nNote that, for the purposes of this special rule, Falling Back in Good Order does not count as fleeing.\n"
  },
  {
    "Id": "23c4-bd19-2422-ad08",
    "Name": "Rallying Cry",
    "Type": "Global",
    "Description": "Description: During the Command sub-phase of their turn, if they are not engaged in combat, this character may nominate a single fleeing friendly unit that is within their Command range. The nominated unit immediately makes a Rally test. If this test is failed, the unit may attempt to rally again as normal during the Rally sub-phase.\n"
  },
  {
    "Id": "5df9-8493-b680-edd0",
    "Name": "The Exile’s Vow",
    "Type": "Global",
    "Description": "Description: The Exile’s Vow is a Chivalrous Vow. A model with this Chivalrous Vow has the Stubborn and Veteran special rules. In addition, a model with this Chivalrous Vow does not have to make a Panic test when a friendly unit with either the Levies or Peasantry special rule is destroyed whilst within 6\" of it, or when it is fled through by a friendly unit with either the Levies or Peasantry special rule.\n"
  },
  {
    "Id": "e0fd-c587-5727-5ad9",
    "Name": "The Wyrm Slayer",
    "Type": "Global",
    "Description": "Description: Should Sir Cecil Gastonne kill an enemy model whose troop type is ‘monstrous infantry’, ‘monstrous cavalry’, ‘monstrous creature’ or ‘behemoth’ during any Combat phase, he gains the Terror special rule for the remainder of the game.\n"
  },
  {
    "Id": "56ef-dedb-7199-3ab6",
    "Name": "Dragonhide Cloak",
    "Type": "Equipment",
    "Description": "Description: After slaying the dragon Norndrak the Tyrant, Sir Cecil had the creature’s hide fashioned into a cloak, which is said to be near-impervious to mundane weapons and can even ward off intense flame. The Armour Piercing characteristic of any non-magical weapon used to attack Sir Cecil is reduced by 2. In addition, Sir Cecil is immune to the Killing Blow and Multiple Wounds (X) special rules. If he suffers an unsaved wound from an attack with either of these special rules, he loses a single Wound. Finally, Sir Cecil has a 3+ Ward save against any wounds suffered that were caused by an attack that has the Flaming Attacks special rule. Sorrow’s End This enchanted axe has brought about the end of all manner of monsters, both man and beast alike. R S AP Special Rules Sorrow’s End Combat S+1 -1 Magical Attacks, Monster Slayer,Multiple Wounds (2).\n"
  },
  {
    "Id": "c56e-8d1b-bb4-de99",
    "Name": "Heavy Armour",
    "Type": "Equipment",
    "Description": "Description: Armour Value 5+\n"
  },
  {
    "Id": "8997-c74d-3a8d-ecf9",
    "Name": "Shield",
    "Type": "Equipment",
    "Description": "Description: A model that carries a shield improves its armour value by 1. For example, a model equipped with light armour has an armour value of 6+. Should that model also carry a shield, its armour value would be improved by 1 by lowering the target number from 6+ to 5+.\nNote that if a model uses a weapon that has the Requires Two Hands special rule in combat, it cannot also use a shield.\n"
  },
  {
    "Id": "7d0a-428d-8f17-c07e",
    "Name": "Sorrow’s End",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+1\nAP: -1\nSpecial Rules: Magical Attacks, Monster Slayer, Multiple Wounds (2)\nNotes: undefined\n"
  },
  {
    "Id": "3922-1014-8e75-a126",
    "Name": "Aura Of The Fay",
    "Type": "Global",
    "Description": "Description: The Green Knight is a supernatural being of great power. Should he be vanquished by a foe, he disappears into thin air, only to reappear once more and return to the fray. When the Green Knight loses his last Wound, he is removed from play as usual, but is not slain. His controlling player may attempt to awaken him again during any of their Start of Turn sub-phases in which he is not on the battlefield, using the Guardian of the Sacred Sites special rule (as described opposite). However, each time the Green Knight is slain, he is weakened, and suffers a -1 modifier to the dice roll when attempting to awaken him, and a -1 modifier to his Wounds characteristic (to a minimum of 1). Note that the enemy player can only win Victory Points for the Green Knight if he is not on the battlefield at the end of the game.\n"
  },
  {
    "Id": "5893-8820-e358-d20f",
    "Name": "Blessed Knight",
    "Type": "Global",
    "Description": "Description: The Green Knight has a 5+ Ward save against any wounds suffered.\n"
  },
  {
    "Id": "6561-8029-dac3-162",
    "Name": "Ethereal",
    "Type": "Global",
    "Description": "Description: Ethereal creatures treat all terrain as open ground for the purposes of movement. They cannot end their movement inside impassable terrain, though they can pass through it. In addition, Ethereal creatures can only be wounded by Magical attacks. Characters that are not Ethereal cannot join units that are, and vice versa.\n"
  },
  {
    "Id": "de36-314b-6886-b2ee",
    "Name": "Guardian Of The Sacred Sites",
    "Type": "Global",
    "Description": "Description: The Green Knight is not placed on the battlefield during deployment – he slumbers until he is awakened during the game. During any of your Start of Turn sub-phases in which the Green Knight is not on the battlefield (even if he was removed from play as a casualty during a previous turn), you may attempt to awaken him by rolling a D6. On a roll of 1-2, he continues to slumber until your next turn at least. On a roll of 3+, the Green Knight awakens. If the Green Knight has not yet been awakened by the start of round five, he awakens automatically.\n\nWhen the Green Knight awakens, he may be placed completely within any ‘natural’ terrain feature anywhere on the battlefield. For the purposes of this rule, a ‘natural’ terrain feature includes any woods, or any difficult or dangerous terrain. ‘It does not include magical vortexes, open ground or hills, or any constructions, such as walls or buildings. Before the game starts, the players should agree upon which terrain features are natural and which are not.\n\nIn addition, rather than moving normally during the Remaining Moves sub-phase, if the Green Knight is completely within a natural terrain feature and is not engaged in combat, you may remove him from the battlefield and replace him so that he is completely within a different natural terrain feature anywhere on the battlefield. The Green Knight cannot move again during this Movement phase.\n\nNote that when the Green Knight appears within a natural terrain feature, he must abide by the 1\" rule. In other words, the Green Knight cannot be placed within 1\" of an enemy unit.\n"
  },
  {
    "Id": "93d9-c75b-f655-30ac",
    "Name": "Immune To Psychology",
    "Type": "Global",
    "Description": "Description: If the majority of the models in a unit are Immune to Psychology, the unit automatically passes any Fear, Panic or Terror tests it is required to make. However, if the majority of the models in a unit have this special rule, the unit cannot choose to Flee as a charge reaction.\nNote that this special rule does not make a unit immune to any test made against Leadership not stated here.\n"
  },
  {
    "Id": "2ecd-c6b3-bd8b-864b",
    "Name": "Loner",
    "Type": "Global",
    "Description": "Description: A character with this special rule cannot be your General and cannot join a unit without this special rule. A unit with this special rule cannot be joined by a character without this special rule.\n"
  },
  {
    "Id": "e83e-f127-1904-3858",
    "Name": "Move Through Cover",
    "Type": "Global",
    "Description": "Description: Models with this special rule do not suffer any modifiers to their Movement characteristic for moving through difficult or dangerous terrain. In addition, a model with this special rule may re-roll any rolls of 1 when making Dangerous Terrain tests.\n"
  },
  {
    "Id": "c7a2-35bf-4313-f4f0",
    "Name": "Terror",
    "Type": "Global",
    "Description": "Description: Models with this special rule cause Terror. Models that cause Terror also cause Fear:\n\n• When a unit that causes Terror declares a charge, the charge target must immediately make a Leadership test. If this test is failed, it must Flee. If this test is passed, it can declare its charge reaction normally.\n\n• If the winning side of a combat includes one or more units that cause Terror, each unit that belongs to the losing side must apply a -1 modifier to its Leadership characteristic when making its Break test.\nNote that if a charged unit cannot choose to Flee, it does not make this Leadership test.\nModels with the Fear special rule Fear models that cause Terror. Models that cause Terror are immune to Terror. A unit that does not cause Terror does not become immune to Terror when joined by a character that does.\n"
  },
  {
    "Id": "d3eb-1fa0-bb19-f390",
    "Name": "Unbreakable",
    "Type": "Global",
    "Description": "Description: If a unit with this special rule loses a round of combat, it is not required to make a Break test. Instead, it will automatically Give Ground as it is pushed back by the enemy. Characters that are not Unbreakable cannot join units that are, and vice versa.\n"
  },
  {
    "Id": "a10e-13b7-e959-ab5",
    "Name": "Unstable",
    "Type": "Global",
    "Description": "Description: If a unit with this special rule loses a round of combat, it loses one additional Wound for every combat result point by which it lost. These Wounds are lost after combat results have been calculated but before Break tests are made.\nIf an Unstable unit contains any Unstable characters, allocate wounds to the unit until each model has been allocated one wound. Any remaining wounds are divided as equally as possible between the character(s) and the unit.\n"
  },
  {
    "Id": "b783-ab7e-dbf9-5b11",
    "Name": "The Dolorous Blade (Deadly blows)",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+2\nAP: -1\nSpecial Rules: Armour Bane (1), Magical Attacks, Multiple Wounds (2)\nNote: The Dolorous Blade has two profiles. You must choose which the wielder will use at the start of each round of combat.\n"
  },
  {
    "Id": "b1df-7321-f745-aee7",
    "Name": "The Dolorous Blade (Rapid strikes)",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -1\nSpecial Rules: Extra Attacks (D6), Magical Attacks\nNote: The Dolorous Blade has two profiles. You must choose which the wielder will use at the start of each round of combat.\n"
  },
  {
    "Id": "eb5d-bd8a-c75c-66d7",
    "Name": "Barding",
    "Type": "Equipment",
    "Description": "Description: A model that rides a barded mount improves its armour value by 1. For example, a cavalry model equipped with heavy armour has an armour value of 5+. Should that model’s mount be barded, its armour value would be improved by 1 by lowering the target number from 5+ to 4+.\n"
  },
  {
    "Id": "6d4a-7733-d725-a267",
    "Name": "Hand Weapon",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -\nSpecial Rules: -\nNotes: Unless specified otherwise, all models are assumed to be equipped with a hand weapon.\n"
  },
  {
    "Id": "5186-798d-69d-6545",
    "Name": "Counter Charge",
    "Type": "Global",
    "Description": "Description: This special rule can only be used by units that consist entirely of models with this special rule. When a unit with this special rule is charged in its front arc by an enemy unit whose troop type is ‘cavalry,’ ‘chariot’ or ‘monster’, it may declare a ‘Counter Charge’ charge reaction:\nCounter Charge: The unit surges forward to meet the enemy charge. Measure the distance between the two units. If the distance is less than the Movement characteristic of the charging unit, the charged unit has not enough time to meet the enemy charge and must either Hold or Flee instead.\nOtherwise, pivot the unit about its centre so that it is facing directly towards the centre of the charging enemy unit. After pivoting, the unit moves D3+1\" directly towards the enemy unit. Both units are considered to have charged during this turn.\nFleeing units and units already engaged in combat when charged cannot Counter Charge. A unit can only Counter Charge in response to one charge per turn, even if charged by multiple units. Once all charges have been declared, the inactive player can choose which charging unit to Counter Charge. The unit will then Hold against the other charging units.\n"
  },
  {
    "Id": "abb5-9813-5e95-1d94",
    "Name": "Finest Warhorses",
    "Type": "Global",
    "Description": "Description: When a unit with this special rule makes a Charge, Flee or Pursuit roll, it may re-roll any dice that roll a natural 1, before discarding any dice that are required to be discarded.\n"
  },
  {
    "Id": "785a-2886-af42-dce9",
    "Name": "First Charge",
    "Type": "Global",
    "Description": "Description: If this unit’s first charge of the game is successful (i.e., if the unit makes contact with the charge target), the charge target becomes Disrupted until the end of the Combat phase of that turn.\n"
  },
  {
    "Id": "dc91-48b3-3696-217",
    "Name": "Swiftstride",
    "Type": "Global",
    "Description": "Description: A unit which consists entirely of models with this special rule increases its maximum possible charge range by 3\" and, when it makes a Charge, Flee or Pursuit roll, may apply a +D6 modifier to the result.\n"
  },
  {
    "Id": "8ce9-c356-89db-b011",
    "Name": "The Knight's Vow",
    "Type": "Global",
    "Description": "Description: A model with this Vow does not have to make a Panic test when a friendly unit with the Peasantry special rule is destroyed whilst within 6\" of it, or when it is fled through by a friendly unit with a Peasantry special rule.\n"
  },
  {
    "Id": "2af0-975f-bb14-8b8f",
    "Name": "Armour Bane (1)",
    "Type": "Global",
    "Description": "Description: If a model with this special rule rolls a natural 6 when making a roll To Wound, the Armour Piercing characteristic of its weapon is improved by the amount shown in brackets after the name of this special rule.\nFor example, if a natural 6 is rolled when rolling To Wound with a weapon that has an AP of \"-\" and the Armour Bane (1) special rule its AP counts as being -1 when making an Armour Save roll against that wound.\n"
  },
  {
    "Id": "c557-6102-9a35-bbcd",
    "Name": "Fly (10)",
    "Type": "Global",
    "Description": "Description: Whenever a model with this special rule moves, it can choose either to move across the ground as normal, using its given Movement characteristic, or to move by flying through the air. When a model flies it uses a special ‘Fly Movement’ characteristic, shown in brackets after the name of this special rule (shown here as ‘X’). Models that choose to move by flying:\n- May move as normal (i.e. they may charge, march and manoeuvre as if moving on the ground), except that they are able to pass freely above other models, units and terrain features without any penalty, and they can march whilst within 8\" of an enemy unit without first having to make a Leadership test.\n- May end their movement in terrain, but will suffer its effects if they do. They cannot end their movement 'on top' of impassable terrain or another unit, or within 1\" of an enemy unit.\nModels that can Fly must begin and end all their movement on the ground. A character with this special rule cannot join a unit without this special rule, and vice versa.\n"
  },
  {
    "Id": "72db-24bb-7493-d753",
    "Name": "Stomp Attacks (D6+1)",
    "Type": "Global",
    "Description": "Description: The number of Stomp Attacks caused varies from model to model and will be shown in brackets after the name of this special rule. Often, this is determined by the roll of a dice.\nResolving Stomp Attacks: Stomp Attacks can only be made by a model that is in base contact with the enemy. Stomp Attacks are attacks made in combat that always strike at Initiative 1 (regardless of modifiers) and that hit automatically using the unmodified Strength characteristic of the model.\n"
  },
  {
    "Id": "883e-e1b1-4fe9-5912",
    "Name": "Close Order",
    "Type": "Global",
    "Description": "Description: A unit consisting of models with this special rule may adopt a Close Order formation.\n"
  },
  {
    "Id": "c822-7ad0-f24a-e4af",
    "Name": "Large Target",
    "Type": "Global",
    "Description": "Description: Enemy models never suffer To Hit modifiers for full or partial cover when shooting at models with this special rule. In addition, a model can draw a line of sight to a model with this special rule over or through other models, and vice versa.\n"
  },
  {
    "Id": "c521-1d17-cb12-239e",
    "Name": "Serrated Maw",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -\nSpecial Rules: Armour Bane (2), Multiple Wounds (2)\nNotes: In combat, this model must make one of its attacks each turn with this weapon.\n"
  },
  {
    "Id": "8382-4e23-e72c-d90",
    "Name": "Wicked Claws",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -2\nSpecial Rules: -\nNotes: -\n"
  },
  {
    "Id": "492-9fe3-86af-2ca0",
    "Name": "Aura of the Lady",
    "Type": "Global",
    "Description": "Description: Any unit this character has joined gains the Magical Attacks special rule.\n"
  },
  {
    "Id": "5c21-d1d5-9884-bce9",
    "Name": "Lore of the Lady",
    "Type": "Global",
    "Description": "Description: A Wizard with the 'Lore of the Lady' special rule may discard one of their randomly generated spells as normal. When they do so, they may select instead either the signature spell of their chosen Lore of Magic, or a spell from the 'Lore of the Lady'.\n"
  },
  {
    "Id": "90ed-c9be-a611-79cc",
    "Name": "Magic Resistance (-1)",
    "Type": "Global",
    "Description": "Description: The Casting roll of any enemy spell (including Bound Spells) that targets a unit that includes one or more models with this special rule suffers a modifier, as shown in brackets after the name of this special rule (-X).\nNote that this special rule is not cumulative. If two or more models in a unit have this special rule, use the highest modifier.\n"
  },
  {
    "Id": "2125-6aa2-f782-42bf",
    "Name": "Magical Attacks",
    "Type": "Global",
    "Description": "Description: Any attack made or hit caused by a model with this special rule, or made using a weapon with this special rule, is a ‘Magical’ attack.\nNote that all spells are considered to have this special rule, as are any hits caused by magic items.\n"
  },
  {
    "Id": "58ff-56d9-4cba-ccc",
    "Name": "Shield of the Lady",
    "Type": "Global",
    "Description": "Description: If this character has joined a unit that has a Unit Strength of 10 or more, and that has a Chivalrous Vow (see page 108), they may voluntarily ‘retire’ to the rear of the unit at any time, moving through the ranks and taking up a position away from the combat. Should they do so, they are no longer within the fighting rank and cannot make any attacks or have attacks directed against them. However, they continue to confer benefits to the unit in the form of Leadership and special rules, and may cast spells as if they were within the fighting rank.\n"
  },
  {
    "Id": "df-a39-e62-1c57",
    "Name": "Fast Cavalry",
    "Type": "Global",
    "Description": "Description: If all of the models (including characters) within a unit arrayed in an Open Order formation have this special rule, the unit may perform its Quick Turn (see page 183) even if it marched.\n"
  },
  {
    "Id": "5450-cbf1-3e74-254a",
    "Name": "Armoured Hide (1)",
    "Type": "Global",
    "Description": "Description: The hide of some creatures forms natural armour and improves their armour value ( and that of their rider). By how much armour value is improved varies from model to model, as shown in brackets after the name of this special rule.\nNote that a model that wears no armour is considerer to have an armour value of 7+ for the purposes of rules that improve armour value.\n"
  },
  {
    "Id": "59aa-eea8-56d3-1039",
    "Name": "Beguiling Aura",
    "Type": "Global",
    "Description": "Description: Enemy models must make a Leadership test before making any rolls To Hit against the model during the Combat phase. If this test is failed, only rolls of a natural 6 will hit.\n"
  },
  {
    "Id": "3c27-d55d-e778-cb89",
    "Name": "Battle Magic",
    "Type": "Equipment",
    "Description": "Fireball\nCurse of Arrow Attraction\nPillar of Fire\nArcane Urgency\nOaken Shield\nCurse of Cowardly Flight\nHammerhand\n"
  },
  {
    "Id": "96ca-2ea5-617-1189",
    "Name": "Untutored Arcanist",
    "Type": "Global",
    "Description": "Description: Many Outcast Wizards are poorly schooled in the arcane arts. Thus, when their spellcasting falters, great calamity can befall them. When required to roll on the Miscast table, a Wizard with this special rule must roll an extra D6 and discard the highest result.\n"
  },
  {
    "Id": "8cc3-d6f5-da17-6600",
    "Name": "Levies",
    "Type": "Global",
    "Description": "Description: Models with this special rule cannot use the Inspiring Presence rule of the army’s General nor the Hold your Ground rule of a Battle Standard. However, little is expected from Levies in battle. Therefore, units that do not have this special rule are not required to make a Panic test when a friendly unit of Levies Breaks and flees from combat.\n"
  },
  {
    "Id": "a0db-bdf1-3b5d-b099",
    "Name": "Peasant's Duty",
    "Type": "Global",
    "Description": "Description: This character and any unit they have joined may choose to Give ground rather than Fail Back in Good Order, and does not have to make a Panic test when a friendly unit of Levies Breaks and flees from combat whilst within 6\" of it. Additionally, unless this character is fleeing, any friendly unit that is within their Command range and has the Levies special rule may re-roll a failed Panic test.\n"
  },
  {
    "Id": "36a8-2e1e-31ba-afae",
    "Name": "Peasantry",
    "Type": "Global",
    "Description": "Description: If a unit with this special rule is within 6\" of a friendly model that has the Knight’s Vow, the Questing Vow or the Grail Vow, and if that model is not fleeing, this unit can use that model’s Leadership characteristic instead of its own. In addition, a standard carried by a unit with this special rule cannot be counted as a trophy of war. A character with this special rule can only join a unit that also has this special rule.\n"
  },
  {
    "Id": "505f-e12d-2e36-31d0",
    "Name": "Warband",
    "Type": "Global",
    "Description": "Description: Unless it is fleeing, a Warband gains a positive (+) modifier to its Leadership characteristic equal to its current Rank Bonus, up to a maximum of Leadership 10. However, a Warband cannot use this modifier to its Leadership should it ever choose to make a Restraint test. In addition, if the majority of the models in a unit have this special rule, it may re-roll its Charge roll.\nNote that unless a character also has this special rule, their Leadership cannot be modified by this special rule. A Warband can use either its own modified Leadership, the modified Leadership of a Warband character, or the unmodified Leadership of a non-Warband character, whichever is the higher.\n"
  },
  {
    "Id": "dbb2-4d85-84c2-528c",
    "Name": "Light Armour",
    "Type": "Equipment",
    "Description": "Description: Armour Value 6+\n"
  },
  {
    "Id": "b664-8530-a988-7ba9",
    "Name": "Impetuous",
    "Type": "Global",
    "Description": "Description: If during the Declare Charges & Charge Reactions sub-phase of its turn, a unit that includes one or more Impetuous models is able to declare a charge, roll a D6. On a roll of 1-3, the unit must declare a charge. On a roll of 4+, the unit may act as normal.\n"
  },
  {
    "Id": "cc9a-f69f-d2e7-b352",
    "Name": "Lance Formation",
    "Type": "Global",
    "Description": "Description: A unit consisting of models with this special rule may adopt a Lance formation.\n"
  },
  {
    "Id": "5f1c-fd04-b0d5-d5e",
    "Name": "Champion",
    "Type": "Equipment",
    "Description": null
  },
  {
    "Id": "3520-64c9-a855-ce9e",
    "Name": "Lance",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+2\nAP: -2\nSpecial Rules: Armour Bane (1)\nNotes: Models whose troop type is ‘cavalry’ or ‘monster’ only. A lance can only be used during a turn in which the wielder charged. In subsequent turns (or if the wielder did not charge) the model must use its hand weapon instead.\n"
  },
  {
    "Id": "40f2-dd77-f0ca-3663",
    "Name": "Musician",
    "Type": "Equipment",
    "Description": null
  },
  {
    "Id": "bcf8-d942-102e-b155",
    "Name": "Standard Bearer",
    "Type": "Equipment",
    "Description": null
  },
  {
    "Id": "eaca-69a2-8b6a-81c6",
    "Name": "Furious Charge",
    "Type": "Global",
    "Description": "Description: During a turn in which it made a charge move of 3\" or more, a model with this special rule gains a +1 modifier to its Attacks characteristic.\n"
  },
  {
    "Id": "9cba-89a5-1796-5fe4",
    "Name": "Horde",
    "Type": "Global",
    "Description": "Description: A unit with this special rule may increase the maximum Rank Bonus it can claim (as determined by its troop type) by one.\n"
  },
  {
    "Id": "32f7-8e30-3fe8-b11e",
    "Name": "Shieldwall",
    "Type": "Global",
    "Description": "Description: Once per game, during a turn in which it was charged, a unit with this special rule that is arrayed in a Close Order formation, and that is equipped with and chooses to use shields, may Give Ground rather than Fall Back in Good Order.\n"
  },
  {
    "Id": "e7c7-b48f-7d2c-b337",
    "Name": "Polearm (Double-handed)",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+1\nAP: -1\nSpecial Rules: Requires Two Hands\nNotes: -\n"
  },
  {
    "Id": "985a-110b-3393-79b7",
    "Name": "Polearm (Single handed)",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -\nSpecial Rules: Fight in Extra Rank\nNotes: -\n"
  },
  {
    "Id": "1a06-31aa-cbfe-1a5",
    "Name": "Fire & Flee",
    "Type": "Global",
    "Description": "Description: If the majority of the models in a unit armed armed with missile weapons have this special rule, the unit may declare that it will ‘Fire & Flee’ as a charge reaction:\nFire & Flee: The unit launches a volley of weapons fire before turning to flee from the enemy. If a unit with this special rule is armed with missile weapons and can draw a line of sight to the charging unit, it may declare that it will Fire & Flee. The unit will Stand & Shoot before turning tail and fleeing from the charge. However, due to the time spent shooting at the charging foe, when making its Flee roll the unit rolls two D6 and discards the lowest result. If both dice roll the same result, discard either.\nNote that, if the distance between this unit and the charging unit is less than the Movement characteristic of the charging unit, this unit must either Hold or Flee.\n"
  },
  {
    "Id": "5b67-8535-146c-7cea",
    "Name": "Open Order",
    "Type": "Global",
    "Description": "Description: A unit consisting of models with this special rule may adopt an Open Order formation.\n"
  },
  {
    "Id": "1f10-d7d-be19-7e8f",
    "Name": "Reserve Move",
    "Type": "Global",
    "Description": "Description: Unless it charged, marched or fled during the Movement phase, a unit in which the majority of the models have this special rule may make a Reserve move at the end of the Shooting phase of its turn, after all shooting has been resolved. A unit making a Reserve move moves as described in the Basic Movement rules. It may manoeuvre normally, but cannot march.\n"
  },
  {
    "Id": "59a5-7eca-ee35-96ac",
    "Name": "Skirmishers",
    "Type": "Global",
    "Description": "Description: A unit consisting of models with this special rule may adopt a Skirmish formation.\n"
  },
  {
    "Id": "ee75-c1a8-2f0c-c264",
    "Name": "Cavalry Spear",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+1\nAP: -1\nSpecial Rules: Fight in Extra Rank\nNotes: Models whose troop type is ‘cavalry’, ‘monster’ or ‘chariot’ only. A cavalry spear’s Strength and Armour Piercing modifiers apply only during a turn in which the wielder charged. A model wielding a cavalry spear cannot make a supporting attack during a turn in which it charged.\n"
  },
  {
    "Id": "1b65-71ef-52a3-93d0",
    "Name": "Shortbow",
    "Type": "Equipment",
    "Description": "R: 18\"\nS: 3\nAP: -\nSpecial Rules: Quick Shot, Volley Fire\nNotes: -\n"
  },
  {
    "Id": "16e8-23be-ce45-768d",
    "Name": "Longbow",
    "Type": "Equipment",
    "Description": "R: 30\"\nS: 3\nAP: -\nSpecial Rules: Armour Bane (1), Volley Fire\nNotes: -\n"
  },
  {
    "Id": "4022-c403-b083-ba83",
    "Name": "Veteran",
    "Type": "Global",
    "Description": "Description: If the majority of the models in a unit have this special rule, the unit may re-roll any failed Leadership test.\nNote that a Break test is not a Leadership test.\n"
  },
  {
    "Id": "98f8-9d8-94cd-3379",
    "Name": "Halberd",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+1\nAP: -1\nSpecial Rules: Armour Bane (1), Requires Two Hands\nNotes: -\n"
  },
  {
    "Id": "f4b3-18af-16bf-78dd",
    "Name": "Hatred (Orcs & Goblins)",
    "Type": "Global",
    "Description": "Description: A model with this special rule may re-roll any failed rolls To Hit made against a hatred enemy during the first round of combat.\nWhich enemies are hated varies from model to model and will be shown in brackets after the name of this special rule. Some models hate 'all enemies' meaning they hate all enemy models equally.\n"
  },
  {
    "Id": "e351-bbd6-f470-b604",
    "Name": "Stubborn",
    "Type": "Global",
    "Description": "Description: The first time this unit is required to make a Break test it may choose not to and will automatically Fall Back in Good Order instead, even if the Unit Strength of the winning side is more than twice that of the losing side. A unit that is not Stubborn does not become Stubborn when joined by a character that is. A Stubborn character cannot use this special rule whilst part of a unit that is not Stubborn.\n"
  },
  {
    "Id": "2a78-f58a-ac7f-87ae",
    "Name": "Dispersed Formation",
    "Type": "Global",
    "Description": "Description: Whilst in Skirmish formation, every model in a unit of Pegasus Knights must be within 2\" of another model belonging to the same unit, rather than the usual 1\".\n"
  },
  {
    "Id": "691e-10ec-4f7c-a2c4",
    "Name": "Vanguard",
    "Type": "Global",
    "Description": "Description: After deployment, units with this special rule may make a Vanguard move. A unit making a Vanguard move moves as described in the Basic Movement rules. It may manoeuvre normally but cannot march.\nIf both armies contain Vanguard units, a roll-off determines who moves first. The players then alternate moving their Vanguard units one at a time, starting with the player who won the roll-off.\n"
  },
  {
    "Id": "2746-8b42-242b-8634",
    "Name": "Bombard",
    "Type": "Equipment",
    "Description": "R: 48\"\nS: 8\nAP: -3\nSpecial Rules: Armour Bane (2), Cannon Fire, Cumbersome, Move or Shoot,Multiple Wounds (D3+1)\nNotes: This weapon shoots like a cannon, using the ‘Cannon Fire’ special rule. This weapon uses the Bombard Misfire table.\n\nBombard Misfire Table\n|||\n|:--|:--|\n|     D6|Result|\n|1|Destroyed: The weapon explodes with a thunderous noise, leaving a hole in the ground and a cloud of black smoke hanging in the air. The model is destroyed and immediately removed from play.|\n|2-3|Malfunction: The charge misfires, terminally inconveniencing one of the crew and knocking the war machine over. It can be righted, but it will take time. The crew immediately loses one Wound and the model fails to shoot this turn.|\n|4-5|Pffft: The fuse has gone out. As far as mishaps go, it is not very serious, but one of the crew will be feeling rather foolish! The model fails to shoot this turn.|\n|6|Boom!: The bombard discharges with an ear-splitting boom, the powerful report knocking the gun from its carriage. This weapon shoots this turn, as if a ‘2’ had been rolled on the Artillery dice, rather than a ‘Misfire’. However, it will take some time to right the toppled gun. This weapon cannot shoot during the next round.|\n"
  },
  {
    "Id": "6359-4018-5cd4-3720",
    "Name": "Motley Crew",
    "Type": "Global",
    "Description": "Description: Units with this special rule may include models of the same type that are equipped differently to one another, and/or models of different types that fight together in a single unit. If necessary, the army list entry for such units will be accompanied by a brief explanation of the unit’s composition.\nDifferent Weapons: The fighting rank of a Motley Crew may contain models that are armed with different weapons. In such cases, the controlling player must roll different batches of dice for the different models, making it clear to their opponent which model’s attacks they represent and where they are being directed. These attacks are made in the Initiative order of the individual models, as usual.\nDifferent Armour: Models within a Motley Crew may have different armour values. In combat, use the armour value of the majority of the models in the fighting rank. Against enemy shooting, use the armour value of the majority of the models in the unit.\nCasualty Removal: Against enemy shooting, casualty removal should be divided as equally as possible between the different models within the unit. In combat, casualties should be removed from among the majority of the models that make up the fighting rank. In either case, available models are brought forward from rear ranks to fill any gaps, as chosen by the controlling player.\n"
  },
  {
    "Id": "ffd7-6700-ecb9-1b17",
    "Name": "Field Trebuchet",
    "Type": "Equipment",
    "Description": "R: 12-72\" S5(10) AP-1(-4)\nS: 5 (10)\nAP: -1 (-4)\nSpecial Rules: Bombardment, Cumbersome, Immovable Object, Move or Shoot, Multiple Wounds (D3+1)\nNotes: -\n"
  },
  {
    "Id": "1439-c8b1-9ff8-298a",
    "Name": "The Questing Vow",
    "Type": "Global",
    "Description": "Description: A model with this Chivalrous Vow has the Stubborn special rule and can re-roll any failed Fear, Panic or Terror test. In addition, a model with this Chivalrous Vow does not have to make a Panic test when a friendly unit with the Peasantry special rule is destroyed whilst within 6\" of it, or when it is fled through by a friendly unit with the Peasantry special rule. However, a model with this Chivalrous Vow cannot be equipped with a lance (be it magical or mundane).\nA unit with this Chivalrous Vow cannot be joined by a character that has the Knight’s Vow or the Peasantry special rule. A character with this Chivalrous Vow cannot join a unit with the Peasantry special rule.\n"
  },
  {
    "Id": "77ca-5e-3d5e-ead5",
    "Name": "Great Weapon",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+2\nAP: -2\nSpecial Rules: Armour Bane (1), Requires Two Hands, Strike Last\nNotes: -\n"
  },
  {
    "Id": "5ec9-a98-d8c5-e18b",
    "Name": "Fear",
    "Type": "Global",
    "Description": "Description: Models with this special rule cause Fear:\n\n• If a unit wishes to declare a charge against an enemy unit that both causes Fear and has a higher Unit Strength, it must first make a Leadership test. If this test is failed, the unit cannot charge. It does not move and is considered to have made a failed charge. If this test is passed, the unit can charge as normal.\n\n• If a unit is engaged with an enemy unit that both causes Fear and has a higher Unit Strength when its combat is chosen during any Choose & Fight Combat sub-phase, it must make a Leadership test. If this test is failed, any models in the unit that direct their attacks against the Fear-causing enemy suffer a -1 modifier to their rolls To Hit.\nA unit only needs to make one Fear test per turn. Models that cause Fear are immune to Fear. A unit that does not cause Fear does not become immune to Fear when joined by a character that does.\n"
  },
  {
    "Id": "5c2-e9dd-2715-a0c0",
    "Name": "Impact Hits (1)",
    "Type": "Global",
    "Description": "Description: The number of Impact Hits caused varies from model to model, and will be shown in brackets after the name of this special rile. Often, this is determined by the roll of a dice.\nResolving Impact Hits: Impact Hits can only be made by a charging model that moved 3\" or more and that is in base contact with the enemy. Impact hits are attacks made in combat that always strike at Initiative 10 (regardless of modifiers), and that hit automatically using the unmodified Strength characteristic of the model.\n"
  },
  {
    "Id": "4d1b-2617-ebdc-4f4d",
    "Name": "Mercenaries",
    "Type": "Global",
    "Description": "Description: Often, an army can include certain units drawn from another army list as mercenaries. Any such units included in your army gain this special rule. Mercenaries cannot use the Inspiring Presence rule of the army’s General (see page 203) nor the Hold your Ground rule of a Battle Standard (see page 203). Mercenaries cannot be joined by characters drawn from another army list.\n"
  },
  {
    "Id": "9e92-303-8d40-895c",
    "Name": "Ogre Charge",
    "Type": "Global",
    "Description": "Description: The Armour Piercing characteristic of any Impact Hits caused by a model with this special rule (but not its mount) is improved by the current Rank Bonus of its unit (or, in the case of characters, the current Rank Bonus of any unit they have joined).\n"
  },
  {
    "Id": "7c08-9451-ab5c-b5eb",
    "Name": "Bonegrinder Giant Attacks",
    "Type": "Global",
    "Description": "Description: |||\n|:--|:--|\n|Crush Underfoot|The Bonegrinder Giant stomps heavily upon the enemy. Place a large (5\") blast template so that its central hole is directly over the centre of the target unit. Any model (friend or foe, but not including this model) whose base lies underneath the template risks being hit and suffering a single hit, using the Strength characteristic of this model, with an AP of -3.|\n|’Eadbutt|The Bonegrinder Giant squints angrily at their enemy and ’eadbutts them.The target unit suffers a single hit and suffers D3+1 wounds with no armour or Regeneration saves permitted (Ward saves can be attempted as normal).|\n|Grind its Bones|Faced with rank upon rank of bite-sized snacks, the Bonegrinder Giant tries to gobble up enemies by the handful. Every model within the fighting rank of the target unit must immediately make an Initiative test: Those unable to escape the grasping hands of the Bonegrinder Giant are scooped up and eaten whole. Every model that fails this test is removed from play as a casualty. Those able to duck or dodge away from the Bonegrinder Giant’s grasping hands escape a terrible fate. Every model that passes this test remains unharmed. Note that any characters in the fighting rank of the target unit can make a “Look Out, Sir!” roll, as if their unit had been hit by a shooting attack.|\n|Mighty Swing|The Bonegrinder Giant swings its club at its enemies. The target unit suffers D6+1 hits from the Bonegrinder Giant’s club. For this attack, the Bonegrinder Giant’s club has a Strength characteristic of S+1 and an AP of -2.|\n|Vomit|Peering down at such tiny creatures makes the Bonegrinder Giant dizzy and messily sick! Place a flame template so that the narrow end touches the edge of this model’s base that is in contact with the target unit and the broad end is over the target unit. Any model (friend or foe, but not including this model) whose base lies underneath the template risks being hit and suffering a single Strength 5 hit with an AP of -2.|\n|Wallop|The Bonegrinder Giant grasps its club two-handed and cracks its enemy on the head. The Bonegrinder Giant makes a single attack against the target unit. For this attack, the Bonegrinder Giant’s club has a Strength characteristic of S+3, an AP of -4 and the Multiple Wounds (2D3) special rule.|\n"
  },
  {
    "Id": "4f28-3f86-cf88-6b3a",
    "Name": "Timmm-Berrr!",
    "Type": "Global",
    "Description": "Description: When this model is reduced to zero Wounds, the winner of a roll-off chooses one of its arcs (front, flank or rear) for it to fall into. Any units that are within the chosen arc and in base contact with this model suffer D6 hits, each using the Strength characteristic of this model, with an AP of -1. Once these hits are resolved, this model is removed from play.\n"
  },
  {
    "Id": "d3a2-c528-1da0-e731",
    "Name": "Bonegrinder Giant’s Club",
    "Type": "Equipment",
    "Description": "R: Combat\nS: *\nAP: *\nSpecial Rules: *\nNotes: A Bonegrinder Giant’s club may have different characteristics and special rules depending upon what they do with it, as described in the Bonegrinder Giant Attacks special rules.\nBonegrinder Giant Attacks Bonegrinder Giants do not attack in the same way as other creatures. They are far too large and fractious to take orders and much too scatter-brained to have any sort of coherent plan.\nInstead of attacking normally during the Combat phase, a Bonegrinder Giant must make a ‘Bonegrinder Giant Attack’. To do so, nominate an enemy unit that the Bonegrinder Giant is engaged in combat with to be the target of the attack and roll on the Bonegrinder Giant Attacks table below. The Troop Type of the target unit determines whether it is a ‘little thing’, a ‘big thing’ or a ‘bigger thing’:\nLittle Things: Units whose Troop Type is ‘regular infantry’, ‘heavy infantry’, ‘swarms’, ‘light cavalry’, ‘heavy cavalry’ or ‘war beasts’.\nBig Things: Units whose Troop Type is ‘monstrous infantry’, ‘monstrous cavalry’, ‘light chariot’ or ‘war machine’.\nBigger Things: Units whose Troop Type is ‘heavy chariot’, ‘monstrous creature’ or ‘behemoth’.\nBonegrinder Giant Attacks Table\n|||||\n|:--|:--|:--|:--|\n|D6|Little Things|Big Things|Bigger Things|\n|1-2|Crush Underfoot|Crush Underfoot|Wallop|\n|3-4|Grind its Bones|Vomit|Mighty Swing|\n|5-6|Vomit|Mighty Swing|’Eadbutt|\n"
  },
  {
    "Id": "233a-1715-82be-1410",
    "Name": "Deathblow",
    "Type": "Global",
    "Description": "Description: When a model with this special rule is reduced to zero Wounds by an enemy attack during the Combat phase, the unit that made the attack suffers a Strength 3 hit, with an AP of -1.\nNote that if this model is reduced to zero Wounds whilst engaged in a challenge, it is the model that made the attack that suffers this hit, rather than its unit.\n"
  },
  {
    "Id": "74e5-b4c9-5ca9-6ca2",
    "Name": "Doomseeker",
    "Type": "Global",
    "Description": "Description: At the end of the battle, a Doomseeker that has been slain is worth no Victory Points. However, if a Doomseeker is still alive, the enemy players win a bonus number of Victory Points equal to 100% of its points cost.\n"
  },
  {
    "Id": "8961-ff44-72ad-9de1",
    "Name": "First to the Fray",
    "Type": "Global",
    "Description": "Description: This model increases its maximum possible charge range by 3\" and, when it makes a Charge roll, may apply a + D3 modifier to the result.\n"
  },
  {
    "Id": "2e16-e293-353e-6881",
    "Name": "Gromril Weapons",
    "Type": "Global",
    "Description": "Description: A hand weapon carried by a model with this special rule has an Armour Piercing characteristic of -1.\nNote that this special rule only applies to a single, ordinary hand weapon. If the model is using two hand weapons or any other sort of weapon, or if their hand weapon is inscribed with any Weapon runes, this special rule ceases to apply.\n"
  },
  {
    "Id": "1b08-4621-6379-ff1f",
    "Name": "Random Attacks",
    "Type": "Global",
    "Description": "Description: Models with this special rule do not have a normal Attacks characteristic. Instead, a dice roll is given (D3+1, for example). Each time a model with this special rule attacks in combat, roll the dice to determine the number of attacks it will make, then roll To Hit as normal. If a fighting rank contains more than one model with this special rule, roll separately for each, unless specified otherwise.\n"
  },
  {
    "Id": "a230-c540-6a65-4974",
    "Name": "Resolute",
    "Type": "Global",
    "Description": "Description: Models with this special rule suffer a -1 modifier to the result of any Flee roll or Pursuit roll they make (to a minimum of 1).\n"
  },
  {
    "Id": "133a-a421-c52f-e33f",
    "Name": "Whirlwind of Death",
    "Type": "Global",
    "Description": "Description: Impact Hits caused by this model are resolved using the profile of its whirling blades of death. In addition, when this model makes a roll To Wound, a roll of 4+ is always a success, regardless of the target's Toughness.\n"
  },
  {
    "Id": "559-d4c6-b2e8-500f",
    "Name": "Detachment",
    "Type": "Global",
    "Description": "Description: A unit with this special rule can be fielded as a ‘detachment’ (see page 282).\n"
  },
  {
    "Id": "d6b8-1ad9-d024-1d72",
    "Name": "Warbow",
    "Type": "Equipment",
    "Description": "R: 24\"\nS: S\nAP: -\nSpecial Rules: Volley Fire\nNotes: -\n"
  },
  {
    "Id": "eee5-db12-1271-f2c5",
    "Name": "Throwing Weapon",
    "Type": "Equipment",
    "Description": "R: 9\"\nS: S\nAP: -\nSpecial Rules: Multiple Shots (2), Move & Shoot, Quick Shot\nNotes: -\n"
  },
  {
    "Id": "9bc5-ae1d-c50c-3442",
    "Name": "Two Hand Weapon",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -\nSpecial Rules: Extra Atacks (+1), Require Two Hands\nNotes: -\n"
  },
  {
    "Id": "1f64-3ddc-db58-12fb",
    "Name": "Drilled",
    "Type": "Global",
    "Description": "Description: Unless it is fleeing, a Drilled unit may perform a free redress the ranks manoeuvre immediately before moving. Once this manoeuvre is complete, the unit moves as normal. In addition, a Drilled unit can march whilst within 8\" of an enemy unit without first having to make a Leadership test.\nNote that any character that joins a Drilled unit is considered to be Drilled as well.\n"
  },
  {
    "Id": "3f0e-1dc6-b425-bf59",
    "Name": "Brace of Pistols",
    "Type": "Equipment",
    "Description": "R: 12\"\nS: 4\nAP: -1\nSpecial Rules: Armour Bane(1), Multiple Shots (2), Quick Shot\nNotes: In combat: Extra Attacks (+1), Requires Two Hands\n"
  },
  {
    "Id": "f170-4b76-b645-29c4",
    "Name": "Dragonblade",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+2\nAP: -2\nSpecial Rules: Armour Bane (1), Magical Attacks\nNotes: Dragonblade is inscribed with a Rune of fury and Grudge Rune, as described on page 34 of Forces of Fantasy\n"
  },
  {
    "Id": "34c9-6f88-dcfd-d3fa",
    "Name": "Grudge Rune",
    "Type": "Equipment",
    "Description": "Description: For each Grudge Rune inscribed upon a weapon, its wielder may re-roll a single roll To Hit of a natural 1 made during the Combat phase.\n"
  },
  {
    "Id": "ea58-1a09-e839-cced",
    "Name": "Rune of Fury",
    "Type": "Equipment",
    "Description": "Description: For each Rune of Fury inscribed upon a weapon, its wielder has a +1 modifier to their Attacks characteristic.\n"
  }
]