[
  {
    "Id": "5a7c-a7a1-92b4-7c69",
    "Name": "Ancestral Fury",
    "Type": "Global",
    "Description": "Description: During a turn in which a unit in a Royal Clan army makes a charge move of 3\" or more, or made a follow up move, it gains a +1 modifier to its Strength characteristic.\n"
  },
  {
    "Id": "1a10-9069-8ff3-84ef",
    "Name": "Gromril Armour",
    "Type": "Global",
    "Description": "Description: A model with this special rule may re-roll any roll of a natural 1 made when making an Armour Save roll\n"
  },
  {
    "Id": "854c-e63a-a9df-fa82",
    "Name": "Grudgelore",
    "Type": "Global",
    "Description": "Description: Once Thorgrim has set the Grudgestone, both he and any unit he has joined replaces the Hates (Orcs & Goblins) special rule with Hatred (all enemies) special rule.\n"
  },
  {
    "Id": "f4b3-18af-16bf-78dd",
    "Name": "Hatred (Orcs & Goblins)",
    "Type": "Global",
    "Description": "Description: A model with this special rule may re-roll any failed rolls To Hit made against a hatred enemy during the first round of combat.\nWhich enemies are hated varies from model to model and will be shown in brackets after the name of this special rule. Some models hate 'all enemies' meaning they hate all enemy models equally.\n"
  },
  {
    "Id": "90ed-c9be-a611-79cc",
    "Name": "Magic Resistance (-1)",
    "Type": "Global",
    "Description": "Description: The Casting roll of any enemy spell (including Bound Spells) that targets a unit that includes one or more models with this special rule suffers a modifier, as shown in brackets after the name of this special rule (-X).\nNote that this special rule is not cumulative. If two or more models in a unit have this special rule, use the highest modifier.\n"
  },
  {
    "Id": "23c4-bd19-2422-ad08",
    "Name": "Rallying Cry",
    "Type": "Global",
    "Description": "Description: During the Command sub-phase of their turn, if they are not engaged in combat, this character may nominate a single fleeing friendly unit that is within their Command range. The nominated unit immediately makes a Rally test. If this test is failed, the unit may attempt to rally again as normal during the Rally sub-phase.\n"
  },
  {
    "Id": "a230-c540-6a65-4974",
    "Name": "Resolute",
    "Type": "Global",
    "Description": "Description: Models with this special rule suffer a -1 modifier to the result of any Flee roll or Pursuit roll they make (to a minimum of 1).\n"
  },
  {
    "Id": "e351-bbd6-f470-b604",
    "Name": "Stubborn",
    "Type": "Global",
    "Description": "Description: The first time this unit is required to make a Break test it may choose not to and will automatically Fall Back in Good Order instead, even if the Unit Strength of the winning side is more than twice that of the losing side. A unit that is not Stubborn does not become Stubborn when joined by a character that is. A Stubborn character cannot use this special rule whilst part of a unit that is not Stubborn.\n"
  },
  {
    "Id": "11be-213c-2821-bcd2",
    "Name": "The Grudgestone",
    "Type": "Global",
    "Description": "Description: During any Start of Turn sub-phase, Thorgrim may set the Grudgestone. Once set, Thorgrim and any unit he has joined gains the Unbreakable special rule and automatically passes any Panic tests they are required to make. However, once the Grudgestone has been set, Thorgrim and his unit cannot choose to Flee as a charge reaction and cannot move other than to Give Ground, to make a follow up move or to reform.\n"
  },
  {
    "Id": "5632-89ff-eff2-3ed9",
    "Name": "Grudge-Settler",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+2\nAP: -1\nSpecial Rules: Armour Bane (1), Magical Attacks\nNotes: Grudge-settler is inscribed with the Master Rune of Smiting and the Rune of Parrying, as described on pages 33) 34 of Forces of Fantasy\n"
  },
  {
    "Id": "6d4a-7733-d725-a267",
    "Name": "Hand Weapon",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S\nAP: -\nSpecial Rules: -\nNotes: Unless specified otherwise, all models are assumed to be equipped with a hand weapon.\n"
  },
  {
    "Id": "599-5e44-7276-ba0e",
    "Name": "Master Rune of Smiting",
    "Type": "Equipment",
    "Description": "Description: A weapon inscribed with the Master Rune of Smiting gains the [Multiple Wounds (D6)] special rule.\n"
  },
  {
    "Id": "427d-d38f-e232-fb0e",
    "Name": "Rune of Parrying",
    "Type": "Equipment",
    "Description": "Description: Any enemy model that direct its attacks against a model wielding a weapon inscribed with a Rune of Parrying during the Combat phase suffers a -1 modifiers to its rolls to Hit.\n"
  },
  {
    "Id": "8997-c74d-3a8d-ecf9",
    "Name": "Shield",
    "Type": "Equipment",
    "Description": "Description: A model that carries a shield improves its armour value by 1. For example, a model equipped with light armour has an armour value of 6+. Should that model also carry a shield, its armour value would be improved by 1 by lowering the target number from 6+ to 5+.\nNote that if a model uses a weapon that has the Requires Two Hands special rule in combat, it cannot also use a shield.\n"
  },
  {
    "Id": "11d9-1f0c-fae6-678b",
    "Name": "The Armour of Skaldour",
    "Type": "Equipment",
    "Description": "Description: The Armour of Skaldour is a suit of heavy armour. In addition, it's wearer has a 4+ Ward save against a Killing Blow, or against any wounds suffered that were caused by an attack that has the Multiple Wounds (X) special rule.\n"
  },
  {
    "Id": "233a-1715-82be-1410",
    "Name": "Deathblow",
    "Type": "Global",
    "Description": "Description: When a model with this special rule is reduced to zero Wounds by an enemy attack during the Combat phase, the unit that made the attack suffers a Strength 3 hit, with an AP of -1.\nNote that if this model is reduced to zero Wounds whilst engaged in a challenge, it is the model that made the attack that suffers this hit, rather than its unit.\n"
  },
  {
    "Id": "93d9-c75b-f655-30ac",
    "Name": "Immune To Psychology",
    "Type": "Global",
    "Description": "Description: If the majority of the models in a unit are Immune to Psychology, the unit automatically passes any Fear, Panic or Terror tests it is required to make. However, if the majority of the models in a unit have this special rule, the unit cannot choose to Flee as a charge reaction.\nNote that this special rule does not make a unit immune to any test made against Leadership not stated here.\n"
  },
  {
    "Id": "73d0-308c-917f-84c0",
    "Name": "King of the Slayer Hold",
    "Type": "Global",
    "Description": "Description: Ungrim Ironfist may join a unit of Hammerers or a unit of Slayers (even though he does not have the Loner special rule). A unit of Hammerers joined by Ungrim gains the Immune to Psychology and Unbreakable special rules for as long as he remains with the unit.\n\nIn addition, if Ungrim Ironfist is taken as the General of a Royal Clan army:\n\n- Daemon Slayers and Dragon Slayers may be taken as Character choices\n- 0-1 unit of Slayers per 1,000 points may be taken as a Core choice\n- 0-4 Doomseekers per 1,000 points may be taken as Special choices\n"
  },
  {
    "Id": "ea84-d53c-ef3b-57e8",
    "Name": "Slayer",
    "Type": "Global",
    "Description": "Description: When this model makes a roll To Wound, a roll of 4+ is always a success, regardless of the target’s Toughness.\n"
  },
  {
    "Id": "d3eb-1fa0-bb19-f390",
    "Name": "Unbreakable",
    "Type": "Global",
    "Description": "Description: If a unit with this special rule loses a round of combat, it is not required to make a Break test. Instead, it will automatically Give Ground as it is pushed back by the enemy. Characters that are not Unbreakable cannot join units that are, and vice versa.\n"
  },
  {
    "Id": "dbb2-4d85-84c2-528c",
    "Name": "Light Armour",
    "Type": "Equipment",
    "Description": "Description: Armour Value 6+\n"
  },
  {
    "Id": "1c85-693f-e00f-9a3d",
    "Name": "The Axe of Dargo",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+2\nAP: -3\nSpecial Rules: Magical Attacks, Monster Slayer\nNotes: undefined\n"
  },
  {
    "Id": "1dff-4744-d20c-13be",
    "Name": "The Slayer Crown",
    "Type": "Equipment",
    "Description": "Description: The wearer of the Slayer crown improves their armour value by 2. In addition, its wearer has a 5+ Ward save against any wounds suffered.\n"
  },
  {
    "Id": "fd89-f754-8e40-4a9f",
    "Name": "Ancestral Shield",
    "Type": "Global",
    "Description": "Description: An Anvil of Doom and the Forgefather & Anvil Guard have a 5+ Ward save against any wounds suffered.\n"
  },
  {
    "Id": "2e16-e293-353e-6881",
    "Name": "Gromril Weapons",
    "Type": "Global",
    "Description": "Description: A hand weapon carried by a model with this special rule has an Armour Piercing characteristic of -1.\nNote that this special rule only applies to a single, ordinary hand weapon. If the model is using two hand weapons or any other sort of weapon, or if their hand weapon is inscribed with any Weapon runes, this special rule ceases to apply.\n"
  },
  {
    "Id": "3206-e578-a350-89cb",
    "Name": "Immovale Object",
    "Type": "Global",
    "Description": "Description: Once a Anvil of Doom has been placed on the battlefield during deployment it cannot be moved by its crew during Remaining Moves sub-phase.\nNote that an Anvil of Doom can still pivot freely at any time during its turn (the better to face the enemy) and may make a follow up move as normal.\n"
  },
  {
    "Id": "c4c7-d2ea-309b-011e",
    "Name": "Riches & Heirlooms",
    "Type": "Global",
    "Description": "Description: Character models in this army may spend an additional 25 points on runes. In addition, unit that are able to purchase Standard runes may spend an additional 25 points on Standard runes (with the exception of Royal Clan Warriors, who already have this bonus included on their profile).\n"
  },
  {
    "Id": "7bfd-8005-56c0-6e77",
    "Name": "Rune Lore",
    "Type": "Global",
    "Description": "Description: A model with this special rule may be nominated to attempt a Wizardly Dispel, as if it were a Wizard. For the purposes of Wizardly Dispel attempts:\nAn Anvil of Doom counts as a level 3 Wizard A Runelord counts as a Level 2 Wizard A Runesmith counts as a Level 1 Wizard\n"
  },
  {
    "Id": "59a5-7eca-ee35-96ac",
    "Name": "Skirmishers",
    "Type": "Global",
    "Description": "Description: A unit consisting of models with this special rule may adopt a Skirmish formation.\n"
  },
  {
    "Id": "25f3-44ad-a37b-a5c",
    "Name": "Strike the Runes",
    "Type": "Global",
    "Description": "Description: An Anvil of Doom can cast the following Bound spells, with a Power Level of 3:\n"
  },
  {
    "Id": "86ed-3561-ab24-dda9",
    "Name": "Striking a Grudge",
    "Type": "Global",
    "Description": "Description: After deployment but before the first turn begins, nominate a single enemy character. For one reason or another, this individual has earned themselves a place in the Clan's Book of Grudges and must be brought to justice. All friendly models gain the Hatred (nominated enemy character) special rule. In addition, you win a bonus of 75 Victory Points if the nominated character is slain, has fled the battlefield or is fleeing when the game ends.\n"
  },
  {
    "Id": "c56e-8d1b-bb4-de99",
    "Name": "Heavy Armour",
    "Type": "Equipment",
    "Description": "Description: Armour Value 5+\n"
  },
  {
    "Id": "860b-e13a-4710-9bf0",
    "Name": "Killing Blow",
    "Type": "Global",
    "Description": "Description: If a model with this special rule rolls a natural 6 when making a roll To Wound for an attack made in combat, it has struck a ‘Killing Blow’. Enemy models whose troop type is ‘infantry’ or ‘cavalry’ are not permitted an armour or Regeneration save (see page 176) against a Killing Blow (Ward saves can be attempted as normal). If an enemy model whose troop type is ‘infantry’ or ‘cavalry’ suffers an unsaved wound from a Killing Blow, it loses all of its remaining Wounds.\nNote that if an attack wounds automatically, this special rule cannot be used.\n"
  },
  {
    "Id": "2ecd-c6b3-bd8b-864b",
    "Name": "Loner",
    "Type": "Global",
    "Description": "Description: A character with this special rule cannot be your General and cannot join a unit without this special rule. A unit with this special rule cannot be joined by a character without this special rule.\n"
  },
  {
    "Id": "2750-3d7-feff-371b",
    "Name": "Slayer of Deamons",
    "Type": "Global",
    "Description": "Description: When this character makes a roll To Wound, a roll of 4+ is always a success regardless of the target's Toughness. In addition, each unsaved wound inflicted by this character against an enemy model with the Warp-spawned special rule, or whose troop type is 'behemoth' has the Multiple Wounds(D3) special rule.\n"
  },
  {
    "Id": "691e-10ec-4f7c-a2c4",
    "Name": "Vanguard",
    "Type": "Global",
    "Description": "Description: After deployment, units with this special rule may make a Vanguard move. A unit making a Vanguard move moves as described in the Basic Movement rules. It may manoeuvre normally but cannot march.\nIf both armies contain Vanguard units, a roll-off determines who moves first. The players then alternate moving their Vanguard units one at a time, starting with the player who won the roll-off.\n"
  },
  {
    "Id": "4351-9800-6134-8cc4",
    "Name": "Slayer of Dragons",
    "Type": "Global",
    "Description": "Description: When this character makes a roll To Wound, a roll of 4+ is always a success, regardless of the target’s Toughness. In addition, each unsaved wound inflicted by this character against an enemy model whose troop type is ‘behemoth’ has the Multiple Wounds (D3) special rule.\n"
  },
  {
    "Id": "c1e6-4b13-26b1-6f6",
    "Name": "Ancestral Grudge",
    "Type": "Global",
    "Description": "Description: A model with this special rule has the Hatred (enemy characters) special rule, meaning it hates all characters in the opposing army. If this character joins a unit of Longbeards or Hammerers, that unit will also gain this special rule. Should this character leave a unit of Longbeards or Hammerers they have joined for any reason, that unit loses this special rule.\n"
  },
  {
    "Id": "93e6-c161-1b92-c8af",
    "Name": "Borne Aloft",
    "Type": "Global",
    "Description": "Description: A model with Shieldbearers consists of not one, but four models – the character and three loyal retainers – occupying a single base and acting together as a single entity. To represent this, a model with Shieldbearers has a split profile and follows the ‘Split Profile (Cavalry)’ rule. In all other respects, this model is heavy infantry.\n"
  },
  {
    "Id": "b8b7-17f2-c5f-353d",
    "Name": "Dwarf Crafted",
    "Type": "Global",
    "Description": "Description: Models with this special rule do not suffer the usual -1 To Hit modifier when making a Stand & Shoot charge reaction.\n"
  },
  {
    "Id": "9a1d-38b0-7d7-7552",
    "Name": "Full Plate Armour",
    "Type": "Equipment",
    "Description": "Description: Armour Value 4+\n"
  },
  {
    "Id": "2af0-975f-bb14-8b8f",
    "Name": "Armour Bane (1)",
    "Type": "Global",
    "Description": "Description: If a model with this special rule rolls a natural 6 when making a roll To Wound, the Armour Piercing characteristic of its weapon is improved by the amount shown in brackets after the name of this special rule.\nFor example, if a natural 6 is rolled when rolling To Wound with a weapon that has an AP of \"-\" and the Armour Bane (1) special rule its AP counts as being -1 when making an Armour Save roll against that wound.\n"
  },
  {
    "Id": "8acf-1a19-b087-ef76",
    "Name": "Forgefire",
    "Type": "Global",
    "Description": "Description: If this character joins a unit, that unit will gain the Armour Bane (2) and Flaming Attacks special rules. Should this character leave a unit it has joined for any reason, that unit loses these special rules.\n"
  },
  {
    "Id": "883e-e1b1-4fe9-5912",
    "Name": "Close Order",
    "Type": "Global",
    "Description": "Description: A unit consisting of models with this special rule may adopt a Close Order formation.\n"
  },
  {
    "Id": "32f7-8e30-3fe8-b11e",
    "Name": "Shieldwall",
    "Type": "Global",
    "Description": "Description: Once per game, during a turn in which it was charged, a unit with this special rule that is arrayed in a Close Order formation, and that is equipped with and chooses to use shields, may Give Ground rather than Fall Back in Good Order.\n"
  },
  {
    "Id": "e78f-d6ed-5364-a697",
    "Name": "Venerable",
    "Type": "Global",
    "Description": "Description: Unless this unit is fleeing, friendly units within 6\" of it can re-roll any failed Panic test.\n"
  },
  {
    "Id": "4022-c403-b083-ba83",
    "Name": "Veteran",
    "Type": "Global",
    "Description": "Description: If the majority of the models in a unit have this special rule, the unit may re-roll any failed Leadership test.\nNote that a Break test is not a Leadership test.\n"
  },
  {
    "Id": "5f1c-fd04-b0d5-d5e",
    "Name": "Champion",
    "Type": "Equipment",
    "Description": null
  },
  {
    "Id": "40f2-dd77-f0ca-3663",
    "Name": "Musician",
    "Type": "Equipment",
    "Description": null
  },
  {
    "Id": "bcf8-d942-102e-b155",
    "Name": "Standard Bearer",
    "Type": "Equipment",
    "Description": null
  },
  {
    "Id": "1ef1-8579-c310-4fb5",
    "Name": "Crossbow",
    "Type": "Equipment",
    "Description": "R: 30\"\nS: 4\nAP: -\nSpecial Rules: Armour Bane (2), Ponderous\nNotes: -\n"
  },
  {
    "Id": "6359-4018-5cd4-3720",
    "Name": "Motley Crew",
    "Type": "Global",
    "Description": "Description: Units with this special rule may include models of the same type that are equipped differently to one another, and/or models of different types that fight together in a single unit. If necessary, the army list entry for such units will be accompanied by a brief explanation of the unit’s composition.\nDifferent Weapons: The fighting rank of a Motley Crew may contain models that are armed with different weapons. In such cases, the controlling player must roll different batches of dice for the different models, making it clear to their opponent which model’s attacks they represent and where they are being directed. These attacks are made in the Initiative order of the individual models, as usual.\nDifferent Armour: Models within a Motley Crew may have different armour values. In combat, use the armour value of the majority of the models in the fighting rank. Against enemy shooting, use the armour value of the majority of the models in the unit.\nCasualty Removal: Against enemy shooting, casualty removal should be divided as equally as possible between the different models within the unit. In combat, casualties should be removed from among the majority of the models that make up the fighting rank. In either case, available models are brought forward from rear ranks to fill any gaps, as chosen by the controlling player.\n"
  },
  {
    "Id": "5b67-8535-146c-7cea",
    "Name": "Open Order",
    "Type": "Global",
    "Description": "Description: A unit consisting of models with this special rule may adopt an Open Order formation.\n"
  },
  {
    "Id": "36e4-28b4-31ff-39dc",
    "Name": "Bolt Thrower",
    "Type": "Equipment",
    "Description": "R: 48\"\nS: 6\nAP: -3\nSpecial Rules: Cumbersome, Move or Shoot, Multiple Wounds (2), Through & Through\nNotes: -\n"
  },
  {
    "Id": "74e5-b4c9-5ca9-6ca2",
    "Name": "Doomseeker",
    "Type": "Global",
    "Description": "Description: At the end of the battle, a Doomseeker that has been slain is worth no Victory Points. However, if a Doomseeker is still alive, the enemy players win a bonus number of Victory Points equal to 100% of its points cost.\n"
  },
  {
    "Id": "8961-ff44-72ad-9de1",
    "Name": "First to the Fray",
    "Type": "Global",
    "Description": "Description: This model increases its maximum possible charge range by 3\" and, when it makes a Charge roll, may apply a + D3 modifier to the result.\n"
  },
  {
    "Id": "5c2-e9dd-2715-a0c0",
    "Name": "Impact Hits (1)",
    "Type": "Global",
    "Description": "Description: The number of Impact Hits caused varies from model to model, and will be shown in brackets after the name of this special rile. Often, this is determined by the roll of a dice.\nResolving Impact Hits: Impact Hits can only be made by a charging model that moved 3\" or more and that is in base contact with the enemy. Impact hits are attacks made in combat that always strike at Initiative 10 (regardless of modifiers), and that hit automatically using the unmodified Strength characteristic of the model.\n"
  },
  {
    "Id": "4d1b-2617-ebdc-4f4d",
    "Name": "Mercenaries",
    "Type": "Global",
    "Description": "Description: Often, an army can include certain units drawn from another army list as mercenaries. Any such units included in your army gain this special rule. Mercenaries cannot use the Inspiring Presence rule of the army’s General (see page 203) nor the Hold your Ground rule of a Battle Standard (see page 203). Mercenaries cannot be joined by characters drawn from another army list.\n"
  },
  {
    "Id": "1b08-4621-6379-ff1f",
    "Name": "Random Attacks",
    "Type": "Global",
    "Description": "Description: Models with this special rule do not have a normal Attacks characteristic. Instead, a dice roll is given (D3+1, for example). Each time a model with this special rule attacks in combat, roll the dice to determine the number of attacks it will make, then roll To Hit as normal. If a fighting rank contains more than one model with this special rule, roll separately for each, unless specified otherwise.\n"
  },
  {
    "Id": "133a-a421-c52f-e33f",
    "Name": "Whirlwind of Death",
    "Type": "Global",
    "Description": "Description: Impact Hits caused by this model are resolved using the profile of its whirling blades of death. In addition, when this model makes a roll To Wound, a roll of 4+ is always a success, regardless of the target's Toughness.\n"
  },
  {
    "Id": "5977-6036-f107-2c9d",
    "Name": "Bugman's Cart",
    "Type": "Global",
    "Description": "Description: During the Command sub-phase of their turn, any Dwarf unit that is not fleeing or engaged in combat and that is within 6\" of a friendly Bugman's Cart (that is itself not fleeing or engaged) gains a +1 modifier to its Movement characteristic until the end of the turn.\n\nNote that this modifier is not cumulative.\n"
  },
  {
    "Id": "bfbc-c435-2046-4691",
    "Name": "Stone Thrower",
    "Type": "Equipment",
    "Description": "R: 12-60\"\nS: 4 (8)\nAP: -1 (-3)\nSpecial Rules: Bombardment, Cumbersome, Move or Shoot, Multiple Wounds (D3+1)\nNotes: -\n"
  },
  {
    "Id": "51a7-1a2-bff3-1d7a",
    "Name": "Royal Guard",
    "Type": "Global",
    "Description": "Description: Your army may include one unit of Hammerers for every King or Thane it includes. Any model in a unit of Hammerers that has been joined by a King or Thane can issue and accept challenges in the same manner as a character. Should the King or Thane leave the unit for any reason, the unit loses this ability.\n"
  },
  {
    "Id": "b2ce-d68c-502b-d777",
    "Name": "Stoic Defenders",
    "Type": "Global",
    "Description": "Description: During a turn in which it was charged by the enemy, a model with this special rule gains a +1 modifier to its Initiative and Attacks characteristics.\n"
  },
  {
    "Id": "cdc6-1b83-7af0-2ab",
    "Name": "Great Hammer",
    "Type": "Equipment",
    "Description": "R: Combat\nS: +2\nAP: -2\nSpecial Rules: Armour Bane(2), Magical Attacks, Requires Two Hands\nNotes: undefined\n"
  },
  {
    "Id": "7424-ec43-7581-965a",
    "Name": "Regimental Unit",
    "Type": "Global",
    "Description": "Description: A unit with this special rule can be accompanied by ‘detachments’ (see page 282).\n"
  },
  {
    "Id": "d1f1-520-9b27-c144",
    "Name": "Runes of Protection",
    "Type": "Global",
    "Description": "Description: This unit has a 6+ Ward save against any wounds suffered that were caused by a non-magical enemy attack.\n"
  },
  {
    "Id": "559-d4c6-b2e8-500f",
    "Name": "Detachment",
    "Type": "Global",
    "Description": "Description: A unit with this special rule can be fielded as a ‘detachment’ (see page 282).\n"
  },
  {
    "Id": "10d8-4849-8c3a-f636",
    "Name": "Runes of Warding",
    "Type": "Global",
    "Description": "Description: A model with this special rule has a 5+ Ward save against any wounds suffered that were caused by an attack that has the Flaming Attacks special rule.\n"
  },
  {
    "Id": "b22b-104e-4b47-bcba",
    "Name": "Drakegun",
    "Type": "Equipment",
    "Description": "R: 18\"\nS: 5\nAP: -1\nSpecial Rules: Armour Bane (2), Dwarf Crafted, Flaming Attacks, Quick Shot\nNotes: -\n"
  },
  {
    "Id": "e83e-f127-1904-3858",
    "Name": "Move Through Cover",
    "Type": "Global",
    "Description": "Description: Models with this special rule do not suffer any modifiers to their Movement characteristic for moving through difficult or dangerous terrain. In addition, a model with this special rule may re-roll any rolls of 1 when making Dangerous Terrain tests.\n"
  },
  {
    "Id": "fe5e-8838-7fbd-a7ec",
    "Name": "Scouts",
    "Type": "Global",
    "Description": "Description: Units with this special rule may be deployed after all other units from both armies. They can be deployed anywhere on the battlefield that is more than 12\" away from an enemy model. If deployed in this way, Scouts cannot declare a charge during their first turn.\nIf both armies contain Scouts, a roll-off should determine which player deploys Scouts first. The players then alternate deploying their scouting units one at a time, starting with the player who won the roll-off.\n"
  },
  {
    "Id": "5ec9-a98-d8c5-e18b",
    "Name": "Fear",
    "Type": "Global",
    "Description": "Description: Models with this special rule cause Fear:\n\n• If a unit wishes to declare a charge against an enemy unit that both causes Fear and has a higher Unit Strength, it must first make a Leadership test. If this test is failed, the unit cannot charge. It does not move and is considered to have made a failed charge. If this test is passed, the unit can charge as normal.\n\n• If a unit is engaged with an enemy unit that both causes Fear and has a higher Unit Strength when its combat is chosen during any Choose & Fight Combat sub-phase, it must make a Leadership test. If this test is failed, any models in the unit that direct their attacks against the Fear-causing enemy suffer a -1 modifier to their rolls To Hit.\nA unit only needs to make one Fear test per turn. Models that cause Fear are immune to Fear. A unit that does not cause Fear does not become immune to Fear when joined by a character that does.\n"
  },
  {
    "Id": "9e92-303-8d40-895c",
    "Name": "Ogre Charge",
    "Type": "Global",
    "Description": "Description: The Armour Piercing characteristic of any Impact Hits caused by a model with this special rule (but not its mount) is improved by the current Rank Bonus of its unit (or, in the case of characters, the current Rank Bonus of any unit they have joined).\n"
  },
  {
    "Id": "7c08-9451-ab5c-b5eb",
    "Name": "Bonegrinder Giant Attacks",
    "Type": "Global",
    "Description": "Description: |||\n|:--|:--|\n|Crush Underfoot|The Bonegrinder Giant stomps heavily upon the enemy. Place a large (5\") blast template so that its central hole is directly over the centre of the target unit. Any model (friend or foe, but not including this model) whose base lies underneath the template risks being hit and suffering a single hit, using the Strength characteristic of this model, with an AP of -3.|\n|’Eadbutt|The Bonegrinder Giant squints angrily at their enemy and ’eadbutts them.The target unit suffers a single hit and suffers D3+1 wounds with no armour or Regeneration saves permitted (Ward saves can be attempted as normal).|\n|Grind its Bones|Faced with rank upon rank of bite-sized snacks, the Bonegrinder Giant tries to gobble up enemies by the handful. Every model within the fighting rank of the target unit must immediately make an Initiative test: Those unable to escape the grasping hands of the Bonegrinder Giant are scooped up and eaten whole. Every model that fails this test is removed from play as a casualty. Those able to duck or dodge away from the Bonegrinder Giant’s grasping hands escape a terrible fate. Every model that passes this test remains unharmed. Note that any characters in the fighting rank of the target unit can make a “Look Out, Sir!” roll, as if their unit had been hit by a shooting attack.|\n|Mighty Swing|The Bonegrinder Giant swings its club at its enemies. The target unit suffers D6+1 hits from the Bonegrinder Giant’s club. For this attack, the Bonegrinder Giant’s club has a Strength characteristic of S+1 and an AP of -2.|\n|Vomit|Peering down at such tiny creatures makes the Bonegrinder Giant dizzy and messily sick! Place a flame template so that the narrow end touches the edge of this model’s base that is in contact with the target unit and the broad end is over the target unit. Any model (friend or foe, but not including this model) whose base lies underneath the template risks being hit and suffering a single Strength 5 hit with an AP of -2.|\n|Wallop|The Bonegrinder Giant grasps its club two-handed and cracks its enemy on the head. The Bonegrinder Giant makes a single attack against the target unit. For this attack, the Bonegrinder Giant’s club has a Strength characteristic of S+3, an AP of -4 and the Multiple Wounds (2D3) special rule.|\n"
  },
  {
    "Id": "c822-7ad0-f24a-e4af",
    "Name": "Large Target",
    "Type": "Global",
    "Description": "Description: Enemy models never suffer To Hit modifiers for full or partial cover when shooting at models with this special rule. In addition, a model can draw a line of sight to a model with this special rule over or through other models, and vice versa.\n"
  },
  {
    "Id": "72db-24bb-7493-d753",
    "Name": "Stomp Attacks (D6+1)",
    "Type": "Global",
    "Description": "Description: The number of Stomp Attacks caused varies from model to model and will be shown in brackets after the name of this special rule. Often, this is determined by the roll of a dice.\nResolving Stomp Attacks: Stomp Attacks can only be made by a model that is in base contact with the enemy. Stomp Attacks are attacks made in combat that always strike at Initiative 1 (regardless of modifiers) and that hit automatically using the unmodified Strength characteristic of the model.\n"
  },
  {
    "Id": "c7a2-35bf-4313-f4f0",
    "Name": "Terror",
    "Type": "Global",
    "Description": "Description: Models with this special rule cause Terror. Models that cause Terror also cause Fear:\n\n• When a unit that causes Terror declares a charge, the charge target must immediately make a Leadership test. If this test is failed, it must Flee. If this test is passed, it can declare its charge reaction normally.\n\n• If the winning side of a combat includes one or more units that cause Terror, each unit that belongs to the losing side must apply a -1 modifier to its Leadership characteristic when making its Break test.\nNote that if a charged unit cannot choose to Flee, it does not make this Leadership test.\nModels with the Fear special rule Fear models that cause Terror. Models that cause Terror are immune to Terror. A unit that does not cause Terror does not become immune to Terror when joined by a character that does.\n"
  },
  {
    "Id": "4f28-3f86-cf88-6b3a",
    "Name": "Timmm-Berrr!",
    "Type": "Global",
    "Description": "Description: When this model is reduced to zero Wounds, the winner of a roll-off chooses one of its arcs (front, flank or rear) for it to fall into. Any units that are within the chosen arc and in base contact with this model suffer D6 hits, each using the Strength characteristic of this model, with an AP of -1. Once these hits are resolved, this model is removed from play.\n"
  },
  {
    "Id": "d3a2-c528-1da0-e731",
    "Name": "Bonegrinder Giant’s Club",
    "Type": "Equipment",
    "Description": "R: Combat\nS: *\nAP: *\nSpecial Rules: *\nNotes: A Bonegrinder Giant’s club may have different characteristics and special rules depending upon what they do with it, as described in the Bonegrinder Giant Attacks special rules.\nBonegrinder Giant Attacks Bonegrinder Giants do not attack in the same way as other creatures. They are far too large and fractious to take orders and much too scatter-brained to have any sort of coherent plan.\nInstead of attacking normally during the Combat phase, a Bonegrinder Giant must make a ‘Bonegrinder Giant Attack’. To do so, nominate an enemy unit that the Bonegrinder Giant is engaged in combat with to be the target of the attack and roll on the Bonegrinder Giant Attacks table below. The Troop Type of the target unit determines whether it is a ‘little thing’, a ‘big thing’ or a ‘bigger thing’:\nLittle Things: Units whose Troop Type is ‘regular infantry’, ‘heavy infantry’, ‘swarms’, ‘light cavalry’, ‘heavy cavalry’ or ‘war beasts’.\nBig Things: Units whose Troop Type is ‘monstrous infantry’, ‘monstrous cavalry’, ‘light chariot’ or ‘war machine’.\nBigger Things: Units whose Troop Type is ‘heavy chariot’, ‘monstrous creature’ or ‘behemoth’.\nBonegrinder Giant Attacks Table\n|||||\n|:--|:--|:--|:--|\n|D6|Little Things|Big Things|Bigger Things|\n|1-2|Crush Underfoot|Crush Underfoot|Wallop|\n|3-4|Grind its Bones|Vomit|Mighty Swing|\n|5-6|Vomit|Mighty Swing|’Eadbutt|\n"
  },
  {
    "Id": "57cc-870a-8ff4-b492",
    "Name": "Whirling Doom",
    "Type": "Global",
    "Description": "Description: With a single salvo of spinning axes, a Goblin-Hewer can cut through several ranks of troops. When shooting a Goblin-Hewer, roll an Artillery Dice before making any rolls To Hit. The number of shots is equal to the roll of the Artillery dice plus a D3 modifier:\n- Per rank (including the rear rank, even if it is incomplete), if the Goblin-Hewer lies in the unit's front or rear arc.\n- Per file, if the Goblin-Hewer lies in the unit's flank arc.\n\nHowever if a misfire is rolled on the Artillery dice, no shots are fired and a critical fault has occurred. Roll immediately on the appropriate Misfire table to determine exactly what.\n"
  },
  {
    "Id": "1263-dddc-ef66-5efc",
    "Name": "Goblin-Hewer",
    "Type": "Equipment",
    "Description": "R: 36\"\nS: 4\nAP: -1\nSpecial Rules: Armour Bane (1), Cumbersome, Move or Shoot, Whirling Doom\nNotes: This weapon uses the Stone Thrower Misfire Table\n"
  },
  {
    "Id": "1f64-3ddc-db58-12fb",
    "Name": "Drilled",
    "Type": "Global",
    "Description": "Description: Unless it is fleeing, a Drilled unit may perform a free redress the ranks manoeuvre immediately before moving. Once this manoeuvre is complete, the unit moves as normal. In addition, a Drilled unit can march whilst within 8\" of an enemy unit without first having to make a Leadership test.\nNote that any character that joins a Drilled unit is considered to be Drilled as well.\n"
  },
  {
    "Id": "3f0e-1dc6-b425-bf59",
    "Name": "Brace of Pistols",
    "Type": "Equipment",
    "Description": "R: 12\"\nS: 4\nAP: -1\nSpecial Rules: Armour Bane(1), Multiple Shots (2), Quick Shot\nNotes: In combat: Extra Attacks (+1), Requires Two Hands\n"
  },
  {
    "Id": "77ca-5e-3d5e-ead5",
    "Name": "Great Weapon",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+2\nAP: -2\nSpecial Rules: Armour Bane (1), Requires Two Hands, Strike Last\nNotes: -\n"
  },
  {
    "Id": "f170-4b76-b645-29c4",
    "Name": "Dragonblade",
    "Type": "Equipment",
    "Description": "R: Combat\nS: S+2\nAP: -2\nSpecial Rules: Armour Bane (1), Magical Attacks\nNotes: Dragonblade is inscribed with a Rune of fury and Grudge Rune, as described on page 34 of Forces of Fantasy\n"
  },
  {
    "Id": "34c9-6f88-dcfd-d3fa",
    "Name": "Grudge Rune",
    "Type": "Equipment",
    "Description": "Description: For each Grudge Rune inscribed upon a weapon, its wielder may re-roll a single roll To Hit of a natural 1 made during the Combat phase.\n"
  },
  {
    "Id": "ea58-1a09-e839-cced",
    "Name": "Rune of Fury",
    "Type": "Equipment",
    "Description": "Description: For each Rune of Fury inscribed upon a weapon, its wielder has a +1 modifier to their Attacks characteristic.\n"
  }
]